{"title": "Article 25. Post Construction Stormwater Regulations", "metadataJson": "{\"base_url\": \"article-25-post-construction-stormwater-regulations\"}", "section": [{"title": "25.1 PURPOSE", "text": "This article is intended to protect, maintain, and enhance the public health, safety, environment, and welfare by establishing minimum requirements and procedures to control the adverse effects of increased post-construction stormwater runoff and non-point source pollution associated with development and redevelopment. It has been determined that proper management of construction-related and post-construction stormwater runoff will minimize damage to public and private property and infrastructure, safeguard the public health, safety, and welfare, and protect water and aquatic resources. These regulations meet these purposes through the following specific objectives and means:\nEstablishing decision-making processes for development and redevelopment that protect the integrity of all watersheds and preserve the health of water resources.\nMinimizing changes to the pre-development hydrologic response for development and redevelopment in their post-construction state in accordance with the requirements of this article for the applicable design storm in order to reduce flooding, stream bank erosion, and non-point and point source pollution, as well as to maintain the integrity of stream channels, aquatic habitats, and healthy stream temperatures.\nEstablishing minimum post-construction stormwater management standards and design criteria for the regulation and control of stormwater runoff quantity and quality.\nEstablishing design and review criteria for the construction, function, and use of structural stormwater control facilities that may be used to meet the minimum post-construction stormwater management standards.\nEstablishing criteria for the use of better management and site design practices, such as the preservation of green space and other conservation areas.\nEstablishing provisions for the long-term responsibility for, and maintenance of, structural and nonstructural stormwater control measures (SCMs) to ensure that they continue to function as designed, are maintained appropriately, and pose minimum risk to public safety.\nEstablishing administrative references and/or procedures for the submission, review, approval, and disapproval of stormwater management plans, for the inspection of approved projects, and to assure appropriate long-term maintenance.\n", "metadataJson": "{\"section_url\": \"/articles/article-25-post-construction-stormwater-regulations/#251-purpose\"}"}, {"title": "25.2 APPLICABILITY", "text": "A. GeneralThe requirements of this article apply to all development and redevelopment within the City and its extraterritorial jurisdiction (ETJ). All development and redevelopment shall require a Stormwater Management Permit unless exempted below. Documentation to ensure exemption shall be approved by the Stormwater Administrator prior to any development or redevelopment:\nThe following are exempt, if approved prior to July 1, 2008 and unexpired:\n\nResidential development: Preliminary subdivision plan or in the case of minor subdivisions, construction plan for required improvements.\nNonresidential development: Preliminary subdivision plan.\n\n\nCommon law vested right established (e.g., the substantial expenditure of resources (time, labor, money) based on a good faith reliance upon having received a valid governmental approval to proceed with a project.\nA conditional zoning district, including those districts which previously were described variously as conditional district, conditional use district, parallel conditional district, and parallel conditional use district, approved prior to July 1, 2008, provided a minimum of 22.5% of the area of the conditional district has been developed; or any phase of a project so long as such phase is part of a project that includes project-wide water quality requirements to achieve 85% total suspended solids (TSS) removal from developed areas.\nDevelopment and redevelopment that cumulatively disturbs less than one acre and cumulatively creates less than 5,000 square feet of new built-upon area (BUA).\nResidential development and redevelopment on an individual lot recorded prior to July 1, 2008 and less than 20,000 square feet (lot shall have been described by metes and bounds and cannot be part of a larger common plan of development or redevelopment).\nActivities exempt from permit requirements of Section 404 of the Federal Clean Water Act, as specified in 40 CFR Part 232, (primarily, ongoing farming and forestry activities).\nB. DefinitionsThe definitions of Section 25.10 only apply to this article. Unless specifically defined in Section 25.10, other words or phrases used in this article are as defined in Article 2 for general definitions or Article 15 for use definitions. In the case of a conflict between a term defined in Article 2 or Article 15 and this article, the definition in Section 25.10 controls.", "metadataJson": "{\"section_url\": \"/articles/article-25-post-construction-stormwater-regulations/#252-applicability\"}"}, {"title": "25.3 STORMWATER MANAGEMENT PERMIT STANDARDS", "text": "Standards for a Stormwater Management Permit are contained in this section.A. Definition of Watershed DistrictsStandards for development and the associated Stormwater Management Permit vary depending on the watershed district in which a project is located as described below:\nCentral CatawbaThat area of land that drains to Sugar, Little Sugar, and McAlpine Creeks, including all tributaries, except Six Mile Creek.\nWestern CatawbaThat area of land that drains to Lake Norman, Mountain Island Lake, and Lake Wylie, including all creeks and tributaries.\nYadkin-Southeast CatawbaThat area of land that drains to the Yadkin River basin, including all creeks and tributaries and Six Mile Creek.\nB. Standards for Stormwater Control Measures (SCMs)\nEvaluation Per Design ManualAll SCM’s required under this article shall be evaluated by the Stormwater Administrator according to the policies, criteria, and information, including technical specifications, standards and the specific design criteria for each stormwater best management practice (BMP) contained in the Charlotte-Mecklenburg Stormwater Control Measure Design Manual (SCM Design Manual). The Stormwater Administrator shall determine whether these measures will be adequate to meet the requirements of this article.\nDetermination of Adequacy; Presumptions and AlternativesSCMs that are designed, constructed, and maintained in accordance with the criteria and specifications in the SCM Design Manual will be presumed to meet the minimum water quality and quantity performance standards of this article. Whenever an applicant proposes to utilize a practice or practices not designed and constructed in accordance with the criteria and specifications in the SCM Design Manual, the applicant shall have the burden of proof for demonstrating that the practice(s) will satisfy the minimum water quality and quantity performance standards of this article before it can be approved for use. As described in the SCM Design Manual, the Stormwater Administrator shall require the applicant to provide monitoring, documentation, calculations, and examples as necessary for the Stormwater Administrator to determine whether such an affirmative showing is made.\nC. Standards for Water Quality Buffers\nAll water quality buffers required by this article shall be subject to standards contained in Table 25-1.\n\nThe following may be located within post-construction water quality buffers when they meet the minimum requirements of this article and the articles listed below:\n\nRequired open space per Article 16.\nLandscape yard per Article 20.\nAmenitized tree areas per Article 20.\nTree save per Article 20.\nInternal trees per Article 20.\nPerimeter trees per Article 20.\nWater supply water quality buffer per Article 23.\nPost-construction water quality buffer per Article 25.\nSWIM water quality buffer per Article 26.\nFloodplain per Article 27.\nAreas for greenways or parks per Article 32 offered for dedication and accepted by Mecklenburg County Park and Recreation.\n\n\nD. Central Catawba District Standards\nStandards for Low-Density ProjectsAny drainage area within a project boundary in the Central Catawba District is considered low-density when said drainage area has less than or equal to 24% BUA as determined by the methodology established in the SCM Design Manual. Such low-density projects shall comply with the following standards. Stormwater controls shall only be required on redeveloped BUA as allowed by state law (N.C.G.S § 143-214.7). Development and redevelopment projects shall not decrease existing on-site structural stormwater controls.\n\nVegetated ConveyancesStormwater runoff shall be transported by vegetated conveyances to the maximum extent practicable.\nWater Quality Buffers\n\nThe Surface Water Improvement and Management (SWIM) water quality buffer requirements apply in the Central Catawba as described in Article 26. Additionally, intermittent and perennial streams within the project boundary shall require a water quality buffer as specified in Table 25-1: Post-Construction Water Quality Buffers. Intermittent and perennial streams shall be delineated by a certified professional using U.S. Army Corps of Engineers and N.C. Division of Water Quality methodology and shall be shown in the Stormwater Management Permit application along with all buffer areas.\nStandards for Post-Construction Water Quality Buffers are described within Table 25-1 above.\nAll buffers shall be measured from the top of the bank on both sides of the stream. All provisions of the SWIM regulations shall apply except for water quality buffer widths in the Central Catawba District. Additionally, no BUA is allowed within 15 feet of the top of bank of the stream (or innermost 15 feet of buffer surrounding ponds) unless the BUA is associated with an exempt impact.\n\n\nStormwater Peak Control\n\nFor low-density development and redevelopment placing 20,000 square feet or more of BUA, peak control shall be provided for the 2-year, 6-hour storm and 10-year, 6-hour storm.\n\n\n\n\nStandards for High-Density ProjectsAny drainage area within a project boundary in the Central Catawba District is considered high-density when said drainage area has greater than 24% built upon area (BUA) as determined by the methodology established in the SCM Design Manual. Such high-density projects shall implement stormwater treatment systems that comply with following standards. Stormwater controls shall only be required on redeveloped BUA as allowed by state law (N.C.G.S § 143-214.7). Development and redevelopment projects shall not decrease existing on-site structural stormwater controls.\n\nStormwater Quality Treatment VolumeStormwater quality treatment systems shall treat the runoff generated from the first inch of rainfall.\nStormwater Quality TreatmentAll structural stormwater treatment systems used to meet these requirements shall be designed to have a minimum of 85% average annual removal for total suspended solids (TSS). Low impact development techniques as described in the SCM Design Manual can be used to meet this requirement.\nStormwater Treatment System DesignGeneral engineering design criteria for all projects shall be in accordance with the North Carolina Administrative Code (NCAC) per 15A NCAC 2H.1008(c), as explained in the SCM Design Manual.\nWater Quality Buffers\n\nThe SWIM water quality buffer requirements apply in the Central Catawba as described in Article 26. In addition, intermittent and perennial streams within the project boundary shall be delineated by a certified professional using U.S. Army Corps of Engineers and N.C. Division of Water Quality methodology and shall be shown in the Stormwater Management Permit application along with all buffer areas.\nStandards for post-construction water quality buffers are described within Table 25-1 above.\nAll buffers shall be measured from the top of the bank on both sides of the stream. All provisions of the SWIM regulations shall apply except for water quality buffer widths in the Central Catawba District. Additionally, no BUA is allowed within 15 feet of the top of bank of the stream (or innermost 15 feet of buffer surrounding ponds) unless the BUA is associated with an exempt impact.\n\n\nStormwater Volume ControlStormwater treatment systems shall be installed to control the volume leaving the project site at post development for the one-year, 24-hour storm. Runoff volume drawdown time shall be a minimum of 48 hours, but not more than 120 hours.\nStormwater Peak Control\n\nFor residential land disturbing activities exceeding 24% built-upon area, peak control shall be installed for the appropriate storm frequency (i.e., 10-, 25-, 50- or 100-year, six-hour) as determined by the Stormwater Administrator based on a downstream flood analysis provided by the owner or designee using the criteria specified in the SCM Design Manual or, if a downstream analysis is not performed, the peak shall be controlled for the 10-year and 25-year, 6-hour storms.\nFor commercial land disturbing activities exceeding 24% built-upon area, peak control shall be installed for the 10-year, 6-hour storm and additional peak control provided for the appropriate storm frequency (i.e., 25-, 50- or 100-year, 6-hour) as determined by the Stormwater Administrator based on a downstream flood analysis provided by the owner or designee using the criteria specified in the SCM Design Manual or, if a downstream analysis is not performed, the peak shall be controlled for the 10- year and 25-year, 6-hour storms. Controlling the one-year, 24-hour volume achieves peak control for the 2-year, 6-hour storm.\n\n\n\n\nE. Western Catawba District Standards\nStandards for Low-Density ProjectsAny drainage area within a project boundary in the Western Catawba District is considered low-density when said drainage area has less than or equal to 12% built-upon area as determined by the methodology established in the SCM Design Manual. Such low-density projects shall comply with the following standards. Stormwater controls shall only be required on redeveloped BUA as allowed by state law (N.C.G.S § 143-214.7). Development and redevelopment projects shall not decrease existing on-site structural stormwater controls.\n\nVegetated ConveyancesStormwater runoff shall be transported by vegetated conveyances to the maximum extent practicable.\nWater Quality Buffers\n\nThe SWIM water quality buffer requirements apply in the Western Catawba as described in Article 26, as do the buffers described for the water supply watershed areas contained in Article 23. Additionally, intermittent and perennial streams within the project boundary shall be delineated by a certified professional using U.S. Army Corps of Engineers and N.C. Division of Water Quality methodology and shall be shown in the Stormwater Management Permit application along with all buffer areas.\nStandards for post-construction water quality buffers are described within Table 25-1 above.\nAll buffers shall be measured from the top of the bank on both sides of the stream. All provisions of the SWIM regulations shall apply except for water quality buffer widths in the Western Catawba District. Additionally, no BUA is allowed within 15 feet of the top of bank of the stream (or innermost 15 feet of buffer surrounding ponds) unless the BUA is associated with an exempt impact.\n\n\nStormwater Peak Control\n\nFor low-density development and redevelopment creating 20,000 square feet or more of BUA, peak control shall be provided for the 2-year, 6-hour storm and 10-year, 6-hour storm.\n\n\n\n\nDevelopment Standards for High-Density ProjectsAny drainage area within a project boundary in the Western Catawba District is considered high-density when said drainage area has greater than 12% BUA as determined by the methodology established in the SCM Design Manual. The BUA maximums specified in the water supply watershed protection requirements contained in Article 23 shall apply. High-density projects shall implement stormwater controls that comply with the following standards. Stormwater controls shall only be required on redeveloped BUA as allowed by state law (N.C.G.S § 143-214.7). Development and redevelopment projects shall not decrease existing on-site structural stormwater controls.\n\nStormwater Quality Treatment VolumeStormwater quality treatment systems shall treat the runoff generated from the first inch of rainfall.\nStormwater Quality TreatmentAll structural stormwater treatment systems used to meet these requirements shall be designed to have a minimum of 85% average annual removal for TSS and 70% average annual removal for total phosphorus.\nStormwater Treatment System DesignGeneral engineering design criteria for all projects shall be in accordance with 15A NCAC 2H.1008(c), as explained in the SCM Design Manual.\nWater Quality Buffers\n\nThe SWIM water quality buffer requirements apply in the Western Catawba District as described in Article 26, as do the water quality buffers described for the watershed areas contained in Article 23. When there is a conflict between buffer requirements, the more stringent shall apply. Additionally, intermittent and perennial streams within the project boundary shall be delineated by a certified professional using U.S. Army Corps of Engineers and N.C. Division of Water Quality methodology and shall be shown in the Stormwater Management Permit application along with all buffer areas.\nStandards for post-construction water quality buffers are described within Table 25-1 above.\nAll buffers shall be measured from the top of the bank on both sides of the stream. All provisions of the SWIM regulations shall apply except for water quality buffer widths in the Western Catawba District. Additionally, no BUA is allowed within 15 feet of the top of bank of the stream (or innermost 15 feet of buffer surrounding ponds) unless the BUA is associated with an exempt impact.\n\n\nStormwater Volume ControlStormwater treatment systems shall be installed to control the volume leaving the project site at post development for the 1-year, 24-hour storm. Runoff volume drawdown time shall be a minimum of 48 hours, but not more than 120 hours.\nStormwater Peak Control\n\nFor residential land disturbing activities exceeding 12% built-upon area, peak control shall be installed for the appropriate storm frequency (i.e., 10-, 25-, 50- or 100-year, 6-hour) as determined by the Stormwater Administrator based on a downstream flood analysis provided by the owner or designee using the criteria specified in the SCM Design Manual, or if a downstream analysis is not performed, the peak shall be controlled for the 10-year and 25-year, 6-hour storms.\nFor commercial land disturbing activities exceeding 12% built-upon area, peak control shall be installed for the 10-year, 6-hour storm and additional peak control provided for the appropriate storm frequency (i.e., 25-, 50- or 100-year, 6-hour) as determined by the Stormwater Administrator based on a downstream flood analysis provided by the owner or designee using the criteria specified in the SCM Design Manual or, if a downstream analysis is not performed, the peak shall be controlled for the 10- year and 25-year, 6-hour storms. Controlling the one-year, 24-hour volume achieves peak control for the 2-year, 6-hour storm.\n\n\n\n\nF. Yadkin-Southeast Catawba District Standards\nStandards for Low-Density ProjectsAny drainage area within a project boundary in the Yadkin-Southeast Catawba District is considered low-density when said drainage area has less than or equal to 10% BUA as determined by the methodology established in the SCM Design Manual. Such low-density projects shall comply with the following standards. Stormwater controls shall only be required on redeveloped BUA as allowed by state law (N.C.G.S § 143-214.7). Development and redevelopment projects shall not decrease existing on-site structural stormwater controls.\n\nVegetated ConveyancesStormwater runoff shall be transported by vegetated conveyances to the maximum extent practicable.\nWater Quality Buffers\n\nIntermittent and perennial streams within the project boundary shall be delineated by a certified professional using U.S. Army Corps of Engineers and N.C. Division of Water Quality methodology and shall be shown in the Stormwater Management Permit application along with all buffer areas.\nStandards for Post-Construction Water Quality Buffers are described within Table 25-1 above.\nSix Mile Creek Watershed Only: In addition to the above information for streams in the Yadkin- Southeast Catawba Basin Watershed, all perennial streams in the Six Mile Creek Watershed shall require 200-foot undisturbed buffers, plus entire FEMA floodplain. All intermittent streams in the Six Mile Creek Watershed shall require 100-foot undisturbed buffers all measured on each side of the stream from top of bank. Additionally, no BUA is allowed within 15 feet of the top of bank of the stream (or innermost 15 feet of buffer surrounding ponds) unless the BUA is associated with an exempt impact specifically allowed within Six Mile Creek per the most recent version of the Charlotte-Mecklenburg Water Quality Buffer Implementation Guidelines.\nAll buffers shall be measured from the top of the bank on both sides of the stream. All provisions of the stream side zone of the SWIM regulations shall apply except for water quality buffer widths in the Yadkin-Southeast Catawba District. Additionally, no BUA is allowed within 15 feet of the top of bank of the stream (or innermost 15 feet of buffer surrounding ponds) unless the BUA is associated with an exempt impact.\n\n\nStormwater Peak ControlFor low-density development and redevelopment creating 20,000 square feet or more of BUA, peak control shall be provided for the 2-year, 6-hour storm and 10-year, 6-hour storm.\n\n\nStandards for High-Density ProjectsAny drainage area within a project boundary in the Yadkin-Southeast Catawba District is considered high-density when said drainage area has greater than 10% BUA as determined by the methodology established in the SCM Design Manual. Such high-density projects shall implement stormwater treatment systems that comply with the following standards. Stormwater controls shall only be required on redeveloped BUA as allowed by state law (N.C.G.S § 143-214.7). Development and redevelopment projects shall not decrease existing on-site structural stormwater controls.\n\nStormwater Quality Treatment VolumeStormwater quality treatment systems shall treat the runoff generated from the first inch of rainfall.\nStormwater Quality TreatmentAll structural stormwater treatment systems used to meet these requirements shall be designed to have a minimum of 85% average annual removal for TSS and 70% average annual removal for total phosphorus.\nStormwater Treatment System DesignGeneral engineering design criteria for all projects shall be in accordance with 15A NCAC 2H.1008(c), as explained in the SCM Design Manual.\nWater Quality Buffers\n\nIntermittent and perennial streams within the project boundary shall be delineated by a certified professional using U.S. Army Corps of Engineers and N.C. Division of Water Quality methodology and shall be shown in the Stormwater Management Permit application along with all buffer areas.\nStandards for post-construction water quality buffers are described within Table 25-1 above.\nSix Mile Creek Watershed Only: In addition to the above information for streams in the Yadkin- Southeast Catawba Basin Watershed, all perennial streams in the Six Mile Creek Watershed shall have 200-foot undisturbed buffers, plus entire FEMA floodplain and all intermittent streams in the Six Mile Creek Watershed shall have 100-foot undisturbed buffers all measured on each side of the stream from top of bank. Additionally, no BUA is allowed within 15 feet of the top of bank of the stream (or innermost 15 feet of buffer surrounding ponds) unless the BUA is associated with an exempt impact specifically allowed within Six Mile Creek per the most recent version of the Charlotte-Mecklenburg Water Quality Buffer Implementation Guidelines.\nAll buffers shall be measured from the top of the bank on both sides of the stream. All provisions of the stream side zone of the SWIM regulations shall apply except for water quality buffer widths in the Yadkin-Southeast Catawba District. Additionally, no BUA is allowed within 15 feet of the top of bank of the stream (or innermost 15 feet of buffer surrounding ponds) unless the BUA is associated with an exempt impact.\n\n\nStormwater Volume ControlStormwater treatment systems shall be installed to control the volume leaving the project site at post development for the 1-year, 24-hour storm. Runoff volume drawdown time shall be a minimum of 48 hours, but not more than 120 hours.\nStormwater Peak Control\n\nFor residential land disturbing activities exceeding 10% built-upon area, peak control shall be installed for the appropriate storm frequency (i.e., 10-, 25-, 50- or 100-year, 6-hour) as determined by the Stormwater Administrator based on a downstream flood analysis provided by the owner or designee using the criteria specified in the SCM Design Manual or, if a downstream analysis is not performed, the peak shall be controlled for the ten-year and 25-year, 6-hour storms.\nFor commercial land disturbing activities exceeding 10% built-upon area, peak control shall be installed for the 10-year, 6-hour storm and additional peak control provided for the appropriate storm frequency (i.e., 25-, 50- or 100-year, 6-hour) as determined by the Stormwater Administrator based on a downstream flood analysis provided by the owner or designee using the criteria specified in the SCM Design Manual or, if a downstream analysis is not performed, the peak shall be controlled for the tenyear and 25-year, 6-hour storms. Controlling the one-year, 24-hour volume achieves peak control for the 2-year, 6-hour storm.\n\n\n\n\nG. Linear Projects\nLinear roadway projects constructed within publicly maintained property (ROW, easement, etc.) shall follow the most recent Post Construction Stormwater Implementation Policy for Transportation Projects within City limits and ETJ, as applicable.\nGreenway trails constructed within publicly maintained property (ROW, easement, etc.) shall follow the most recent Charlotte-Mecklenburg Water Quality Buffer Implementation Guidelines.\n‍", "metadataJson": "{\"section_url\": \"/articles/article-25-post-construction-stormwater-regulations/#253-stormwater-management-permit-standards\"}"}, {"title": "25.4 STORMWATER MANAGEMENT PERMIT APPROVAL PROCESS", "text": "A. PurposeThe Stormwater Management Permit is the development plan, as approved by the Stormwater Administrator, that details how stormwater runoff will be controlled through structural and/or nonstructural management features.B. Submission of a Stormwater Management Plan\nGeneralA Stormwater Management Permit developed in accordance with the specifications set forth in the Stormwater Regulations Administrative Manual (Administrative Manual) shall be submitted to the City as part of the plan for development or redevelopment and shall be reviewed in accordance with established procedures.\nStormwater Management Permit Contents and FormThe Stormwater Administrator shall establish requirements for the content and form of the Stormwater Management Permit. These general requirements shall be contained in the Administrative Manual, which may be amended from time to time.\nPermit Review FeesA fee, as established by City Council, shall accompany the submission of the preliminary Stormwater Management Permit.\nComplete SubmissionA Stormwater Management Permit will not be considered complete until it contains all elements required by the Stormwater Administrator, along with the appropriate fee. If the Stormwater Administrator finds that a Stormwater Management Permit is incomplete, the applicant shall be notified of the deficient elements and provided with an opportunity to correct the plan. No review of a Stormwater Management Permit shall commence until the Stormwater Administrator has determined the plan is complete.\nC. Review and Approval of Stormwater Management Plan\nPreparation by Professional RequiredThe preliminary Stormwater Management Permit shall be prepared by a licensed state professional engineer or registered landscape architect. The professional engineer or registered landscape architect shall certify that the design of all stormwater management facilities and practices meets the requirements of these regulations.\nFinal Approval of Stormwater Management PlanIf the Stormwater Administrator finds the Stormwater Management Permit complies with the requirements of these regulations, the Stormwater Administrator shall approve the Stormwater Management Permit, which approval shall constitute the issuance of the permit. The Stormwater Administrator may impose conditions of approval as needed to ensure compliance with this article. The conditions shall be included in the permit as part of the approval.\nEffect of the PermitThe permit shall remain valid for a period of three years from the date of approval. If no work on the site in furtherance of the Stormwater Management Permit has commenced within the three year period, the permit and plan approval will become null and void and a new application will be required to develop the site. If work on the site in furtherance of the plan has commenced that involves any utility installations or street improvements except grading, the permit and plan shall remain valid and in force and the project may be completed in accordance with the approved plan.\nDisapproval of Stormwater Management PlanIf the Stormwater Administrator disapproves the preliminary Stormwater Management Permit, the grounds for such disapproval shall be stated in writing to the applicant. After such disapproval, an appeal from that decision may be taken to Stormwater Advisory Committee (SWAC). SWAC may approve, disapprove, in whole or in part, or otherwise modify the action of the Stormwater Administrator. A final Stormwater Management Permit approved by SWAC, after appeal from the decision of the Stormwater Administrator, will qualify as the permit.\nD. As-Built Plans and Final Approval\n An applicant shall certify that the completed project is in accordance with the approved Stormwater Management Permit and designs and shall submit as-built plans for all stormwater management facilities or practices after final construction is completed. Failure to provide approved as-built plans within the timeframe specified by the Stormwater Administrator may result in assessment of penalties. At the discretion of the Stormwater Administrator, performance guarantees may be required for stormwater management facilities or practices until as-built plans are approved.\n As-built plans shall show the final design specifications for all stormwater management facilities and practices and the field location, size, depth, and planted vegetation of all measures, controls, and devices, as installed. The designer of the stormwater management measures and plans shall certify, under seal, that the as-built stormwater measures, controls, and devices are in compliance with the approved Stormwater Management Permit and designs and with the requirements of this article. As conditions of the as-built plan(s) approval, the designer shall submit a digital copy of the as-built plan(s) as described in the Administrative Manual to the Stormwater Administrator for the purpose of maintaining records, performing inspections, maintenance and other future needs as determined by the City.\n Approved final as-built plans and a final inspection by the Stormwater Administrator are required before a project is determined to be in compliance with this article. At the discretion of the Stormwater Administrator, certificates of occupancy may be withheld pending receipt of as-built plans and the completion of a final inspection and approval of a project.\n", "metadataJson": "{\"section_url\": \"/articles/article-25-post-construction-stormwater-regulations/#254-stormwater-management-permit-approval-process\"}"}, {"title": "25.5 MITIGATION OPTIONS", "text": "A. Total Phosphorus Mitigation\nPurposeThe purpose of this mitigation is to reduce the cost of complying with the 70% total phosphorus removal criteria for development with greater than or equal to 24% built-upon area while ensuring the reduction of pollution loads and achievement of the objectives of this article\nGeneral Description\n\nThere are two total phosphorus mitigation options available to development greater than or equal to 24% built-upon area: 1) an off-site mitigation option; and 2) a buy-down option as described in this article. Both off-site and buy-down mitigation will result in the construction of retrofit SCMs in the same river basin (Catawba or Yadkin) as the mitigated site. In the Western Catawba District both forms of mitigation shall occur in the watershed of the same named creek system for the purpose of ensuring a balance of total phosphorus loads to lake cove areas where phosphorus is a limiting pollutant with the exception that up to 30% of the buy-down money can be spent outside the watershed. In addition, the buy-down option is available provided the City has projects and/or property available for mitigation. There is no total phosphorus requirement in the Central Catawba District so the mitigation option is not necessary.\nThe named creek (or drainage basin) systems referred to above include:\n\nWestern Catawba: Studman Branch, Porter Branch, Neal Branch, Stowe Branch, Beaverdam Creek, Little Paw Creek, Paw Creek, Long Creek, Gar Creek, and the Lower Mountain Island watershed.\nYadkin-Southeast Catawba: Six Mile Creek, Twelve Mile Creek, Caldwell Creek, McKee Creek, Reedy Creek, Fuda Creek, Back Creek, Mallard Creek, and Lower Clarke Creek.\n\n\n\n\nCriteria for Off-Site Mitigation\n\nThe owner or designee of a proposed construction site that will include greater than or equal to 24% BUA shall construct SCM retrofit project designed to achieve an equivalent or greater net mass removal of total phosphorus as would be achieved by removing 70% of the total phosphorus from the proposed site. Off-site mitigation is allowed only for total phosphorus removal above 50%. On-site SCMs shall be constructed to achieve 50% removal of total phosphorus from the project site.\nThe Stormwater Administrator shall receive and review the application for off-site mitigation. After reviewing the application the Stormwater Administrator shall approve, disapprove, or approve with conditions an “Application for Off-Site Total Phosphorus Mitigation.” This application shall be submitted with the Stormwater Management Permit application and shall at a minimum contain a description of the SCM(s) to be constructed, including their type and size as well as the pollutant removal efficiencies to be achieved. The location of the site where the SCM(s) are to be constructed shall be described, including the size of the drainage area to be treated and percentage and type of existing BUA. The application shall also include the pounds of total phosphorus being mitigated for and the pounds of total phosphorus reduced with the retrofit SCM(s). Documentation shall be submitted with the application to demonstrate that the applicant has land rights to perform the SCM retrofit on the property.\nThe criteria for approval of off-site total phosphorus mitigation by the Stormwater Administrator are as follows:\n\nSCM(s) shall be constructed in accordance with 15A NCAC 2H.1008(c), as explained in the SCM Design Manual.\nSCM(s) shall be sized for the corresponding watershed area according to the SCM Design Manual.\nSCM(s) shall be inspected by the Stormwater Administrator and found to be in compliance with all approved plans and specifications prior to the issuance of certificate(s) of occupancy for the mitigated site.\n\n\nFollowing approval from the Stormwater Administrator, SCM(s) may be installed and credits obtained for pounds of total phosphorus removed that can be applied to future projects. These credits can be accumulated or banked for a period of time as specified by the Stormwater Administrator in the Administrative Manual.\nAll off-site mitigation SCMs shall be subject to the maintenance requirements as well as installation and maintenance performance securities specified in Section 25.7.\n\n\nCriteria for Total Phosphorus Buy-Down Option\n\nThe owner or designee of a proposed construction site that will include greater than or equal to 24% BUA may buy-down the 70% phosphorus removal requirement to no less than 50%. On-site SCMs shall be installed to remove the remaining total phosphorus load. The funds shall be used by the City to construct SCM retrofit projects designed to achieve an equivalent or greater net mass removal of total phosphorus as would be achieved by removing 70% of the total phosphorus from the proposed site.\nThe Stormwater Administrator shall receive and review the application for the buy-down option. After receiving the application the Stormwater Administrator shall approve, disapprove, or approve with conditions an application for total phosphorus buy-down. This application shall be submitted with the Stormwater Management Permit application and shall at a minimum contain calculations showing the total load buydown and all cost calculations as described in the Administrative Manual.\nThe criteria for the buy-down option are as follows:\n\nThe buy-down option shall not be approved by the Stormwater Administrator unless projects and/or properties are available for mitigation, including SCM construction, SCM maintenance, SCM rehabilitation, and stream restoration.\nThere is no time constraint for the City to spend mitigation funds. However, the City shall strive to spend funds collected in a timely and efficient manner such that a net improvement in water quality results.\nThe City shall ensure that the function of all SCMs constructed by the City as part of this mitigation option shall be maintained in perpetuity. Individual maintenance responsibilities are further defined in project specific easement agreements.\n\n\nThe criteria for calculating the buy-down cost shall be provided in the Administrative Manual.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-25-post-construction-stormwater-regulations/#255-mitigation-options\"}"}, {"title": "25.6 DEED RECORDATION AND PLAT SPECIFICATIONS", "text": "\nThe approval of the Stormwater Management Permit shall require an enforceable restriction on property usage that runs with the land, such as a plat, recorded deed restrictions or protective covenants, to ensure that future development maintains the site in a manner consistent with the approved project plans.\nStreams and buffer boundaries, including the delineation of each buffer zone, shall be specified on all surveys and record plats.\nThe applicable operations and maintenance agreement pertaining to every SCM shall be referenced on the final plat and shall be recorded with the Mecklenburg County Register of Deeds Office upon final plat approval. If no subdivision plat is recorded for the site, then the operations and maintenance agreement shall be recorded with the Mecklenburg County Register of Deeds Office so as to appear in the chain of title of all subsequent purchasers under generally accepted searching principles.\nA copy of the recorded operations and maintenance agreement shall be provided to the Stormwater Administrator within 14 days following receipt of the recorded document. A maintenance easement shall be recorded for every SCM to allow sufficient access for adequate maintenance. The specific recordation and deed restriction requirements, as well as notes to be displayed on final plats and deeds, shall be contained in the Administrative Manual.\n", "metadataJson": "{\"section_url\": \"/articles/article-25-post-construction-stormwater-regulations/#256-deed-recordation-and-plat-specifications\"}"}, {"title": "25.7 MAINTENANCE/LONG-TERM STEWARDSHIP", "text": "\nDedication of SCMs, Facilities and Improvements\n\nMaintenance and Operation of SCMs\nThe owner of an SCM installed pursuant to this article shall maintain and operate the SCM so as to preserve and continue its function in controlling stormwater quality and quantity at the degree or amount of function for which the SCM was designed.\n\n\n\n\n\nAnnual Maintenance Inspection and Report\nThe person responsible for maintenance of any SCM installed pursuant to this article shall submit to the Stormwater Administrator an annual inspection report from a qualified professional as defined in the Administrative Manual. All inspection reports shall be on forms supplied by the Stormwater Administrator that are contained in the Administrative Manual. An original inspection report shall be provided to the Stormwater Administrator beginning one year from the date of as-built certification and each year thereafter on or within 45 days before the anniversary date of the as-built certification.\n\n\n\n\n\nDetectability\nNotwithstanding any other applicable provision of any city or state law, any underground SCM constructed for the purposes of this chapter shall be detectable to utility location services.\n\n\n\nOperation and Maintenance Agreement \n\nGeneral \n\nAt the time that as-built plans are provided to the Stormwater Administrator and prior to final approval of a project for compliance with this article, but in all cases prior to placing any SCMs in service, the applicant or owner of the site shall execute an operation and maintenance agreement that shall be binding on all current and subsequent owners of the site, portions of the site, and lots or parcels served by the SCMs. \nFailure to execute an operation and maintenance agreement within the time frame specified by the Stormwater Administrator may result in assessment of penalties as specified in Section 25.8. Until the transference of all property, sites, or lots served by any SCM, the original owner or applicant shall have the primary responsibility for carrying out the provisions of the maintenance agreement. \nAt the discretion of the Stormwater Administrator, certificates of occupancy may be withheld pending receipt of an operation and maintenance agreement. \nThe operation and maintenance agreement shall require the owner or owners to maintain, repair, and, if necessary, reconstruct any SCM, and shall state the terms, conditions, and schedule of maintenance for the SCM. In addition, it shall grant to the City a right of entry in the event that the Stormwater Administrator has reason to believe it has become necessary to inspect, monitor, maintain, repair, or reconstruct the SCM. However, in no case shall the right of entry, of itself, confer an obligation on the City to assume responsibility for the SCM. \nStandard operation and maintenance agreements for SCMs shall be developed by the Stormwater Administrator and made available in the Administrative Manual. The operation and maintenance agreement shall be approved by the Stormwater Administrator prior to plan approval, and it shall be referenced on the recorded plat. \n\n\nSpecial Requirement for Homeowners’ and other Associations\nFor any SCMs required pursuant to this article that are to be or are owned and maintained by a homeowners’ association, property owners’ association, or similar entity, the required operation and maintenance agreement shall include the provisions described in the SCM Design Manual. \n\n\nInspection Program\nInspections and inspection programs by the City may be conducted or established on any reasonable basis, including but not limited to routine inspections; random inspections; inspections based upon complaints or other notice of possible violations; and joint inspections with other agencies inspecting under environmental or safety laws. Inspections may include, but are not limited to, reviewing maintenance and repair records; sampling discharges, surface water, groundwater, and material or water in SCMs; and evaluating the condition of SCMs. If the owner or occupant of any property refuses to permit such inspection, the Stormwater Administrator shall proceed to obtain an administrative search warrant pursuant to N.C.G.S. § 15-25.2 or its successor. No person shall obstruct, hamper, or interfere with the Stormwater Administrator while carrying out their official duties.\n\nPerformance Security for Installation and Maintenance\nThe City may require the submittal of a performance guarantee with surety, cash escrow, letter of credit, or other acceptable legal arrangement prior to issuance of a permit in accordance with the provisions contained in the Administrative Manual.\n\nRecords of Installation and Maintenance Activities\nThe owner of any SCM shall keep records of inspections, maintenance, and repairs for at least five years from the date of creation of the record and shall submit the same upon reasonable request to the Stormwater Administrator.\n\nMaintenance Easement\nEvery SCM installed pursuant to this article shall be made accessible for adequate inspection, maintenance, reconstruction and repair by a maintenance easement, which shall be shown and labeled on all plans and plats. The easement shall be recorded to provided adequate and perpetual access and sufficient area, in favor of the City or otherwise, for inspection, maintenance, repair, or reconstruction. For all SCMs that are not located adjacent to a public right-of-way, the owner shall provide a 20 foot wide access easement in favor of the City that connects the SCM area to the public right-of-way. The easement shall be described on all plans and plats as defined in the Administrative Manual. The easement shall be recorded as described in Section 25.6 and its terms shall specify who may make use of the easement and for what purposes.\n", "metadataJson": "{\"section_url\": \"/articles/article-25-post-construction-stormwater-regulations/#257-maintenance/long-term-stewardship\"}"}, {"title": "25.8 ADMINISTRATION", "text": "\nAppeals and variances of this article shall be subject to Article 37.\nInspections and enforcement actions of this article shall be subject to Article 39.\n", "metadataJson": "{\"section_url\": \"/articles/article-25-post-construction-stormwater-regulations/#258-administration\"}"}, {"title": "25.9 STORMWATER ADMINISTRATOR", "text": "\nDesignation\nThe Director of the City of Charlotte department responsible for management of the City’s NPDES MS4 Stormwater permit has been designated as the Stormwater Administrator. The Stormwater Administrator is authorized to administer and enforce Article 25.\n\nPowers and Duties \nIn addition to the powers and duties that may be conferred by other provisions of this Ordinance and other laws, the Stormwater Administrator shall have the following powers and duties under this article: \n\n\n\nTo review and approve or disapprove applications submitted pursuant to Article 25. \nTo make determinations and render interpretations of Article 25. \nTo establish application requirements and schedules for submittal and review of applications and appeals. \nTo enforce Article 25 in accordance with its enforcement provisions. \nTo maintain records, maps, and official materials as they relate to the adoption, amendment, enforcement, or administration of Article 25. \nTo provide expertise and technical assistance upon request to the City Council and the Stormwater Advisory Committee (SWAC). \nTo designate appropriate other person(s) who shall carry out the powers and duties of the Stormwater Administrator. \nTo provide information and recommendations relative to variances and information as requested by the UDO Board of Adjustment in response to appeals. \nTo prepare and make available to the public a Stormwater Regulations Administrative Manual that includes the Stormwater Management Permit application, submittal checklist, fee schedule, maintenance agreements, and a reference to the SCM Design Manual. \nTo take any other action necessary to administer the provisions of Article 25. \n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-25-post-construction-stormwater-regulations/#259-stormwater-administrator\"}"}, {"title": "25.10 DEFINITIONS", "text": "The definitions below only apply to this article. Unless specifically defined in this section, other words or phrases used in this article are as defined in Article 2 for general definitions or Article 15 for use definitions. In the case of a conflict between a term defined in Article 2 or Article 15 and this article, the definition in this section controls.\nStormwater Control Measure (SCM) Design Manual (SCM Design Manual). The SCM Design Manual includes a list of acceptable stormwater treatment practices, including the specific design criteria for each stormwater practice. Stormwater treatment practices that are designed and constructed in accordance with these design and sizing criteria will be presumed to meet the minimum water quality performance standards of Article 25 and the NPDES Phase II laws. If the specifications or guidelines of the SCM Design Manual are more restrictive or apply a higher standard than other laws or regulations, that fact shall not prevent application of the specifications or guidelines in the SCM Design Manual.\nCommercial Development or Redevelopment. Any land disturbing activity that is not residential development or redevelopment as defined herein. (This includes all development not specifically included under residential development).\nDevelopment. Land-disturbing activity that creates built-upon area or that otherwise decreases the infiltration of precipitation into the soil.\nOwner. The legal or beneficial owner of land, including but not limited to a fee owner, mortgagee or vendee in possession, receiver, executor, trustee, or long-term or commercial lessee, or any other person or entity holding proprietary rights in the property or having legal power of management and control of the property. Owner shall include long-term commercial tenants; management entities, such as those charged with or engaged in the management of properties for profit; and every person or entity having joint ownership of the property. A secured lender not in possession of the property does not constitute an owner, unless the secured lender is included within the meaning of owner under another description in this definition, such as a management entity.\nRedevelopment. Any land-disturbing activity that does not result in a net increase in built-upon area and that provides greater or equal stormwater control than the previous development.\nResidential Development or Redevelopment. A land-disturbing activity with land on at least two sides of each dwelling unit. This includes but is not limited to single-family residential, townhouses, and duplex/triplex/quadraplex with units located on sublots.\n‍", "metadataJson": "{\"section_url\": \"/articles/article-25-post-construction-stormwater-regulations/#2510-definitions\"}"}]}