{"title": "Article 28. Soil Erosion & Sedimentation Control", "metadataJson": "{\"base_url\": \"article-28-soil-erosion-sedimentation-control\"}", "section": [{"title": "28.1 PURPOSE", "text": "This article is adopted for the purposes of:A. Regulating certain land-disturbing activity to control accelerated erosion and sedimentation in order to prevent pollution of water and other damage to lakes, wetlands, watercourses, and other public and private property by sedimentation.B. Permitting development of the City with the least detrimental effects from pollution by erosion and sedimentation.C. Establishing procedures through which these purposes can be fulfilled.", "metadataJson": "{\"section_url\": \"/articles/article-28-soil-erosion-sedimentation-control/#281-purpose\"}"}, {"title": "28.2 APPLICABILITY", "text": "A. The requirements of this article apply to all land-disturbing activity within the corporate limits of the City and the extraterritorial jurisdiction (ETJ).B. This article shall not apply to the following land-disturbing activities:\nActivities including production and activities relating or incidental to the production of crops, grains, fruits, ornamental and flowering plants, dairy, livestock, poultry, and other forms of agriculture undertaken on agricultural land for the production of plants and animals useful to man, including, but not limited to:\n\nForage and sod crops, grains and feed crops, tobacco, cotton, and peanuts.\nDairy animals and dairy products.\nPoultry and poultry products.\nLivestock, including beef cattle, llamas, sheep, swine, horses, ponies, mules, and goats.\nBees and apiary products.\nFur-producing animals.\nMulch, ornamental plants, and other horticultural products.\n\n\nAn activity undertaken on forestland for the production and harvesting of timber and timber products and conducted in accordance with standards defined by the Forest Practice Guidelines Related to Water Quality (Best Management Practices), as adopted by the North Carolina Department of Agriculture and Consumer Services. If land-disturbing activity undertaken on forestland for the production and harvesting of timber and timber products is not conducted in accordance with standards defined by the Forest Practice Guidelines Related to Water Quality, the provisions of this article shall apply to such activity and any related land-disturbing activity on the tract.\nActivities for which a permit is required under the Mining Act of 1971, Article 7 of Chapter 74 of the North Carolina General Statutes.\nFor the duration of an emergency, activities essential to protect human life.\nLand-disturbing activity over which the state has exclusive regulatory jurisdiction as provided in N.C.G.S. § 113A-56(a).\n Activities undertaken to restore the wetlands functions of converted wetlands to provide compensatory mitigation to offset impacts permitted under Section 404 of the Federal Clean Water Act.\nActivities undertaken pursuant to Federal Natural Resources Conservation Service standards to restore the wetlands functions of converted wetlands as defined in Title 7 Code of Federal Regulations § 12.2.\nC. The definitions of Section 28.7 only apply to this article. Unless specifically defined in Section 28.7, other words or phrases used in this article are as defined in Article 2 for general definitions or Article 15 for use definitions. In the case of a conflict between a term defined in Article 2 or Article 15 and this article, the definition in Section 28.7 controls.", "metadataJson": "{\"section_url\": \"/articles/article-28-soil-erosion-sedimentation-control/#282-applicability\"}"}, {"title": "28.3 REQUIREMENTS, OBJECTIVES, AND STANDARDS", "text": "A. General Requirements\nErosion and Sedimentation Control MeasuresAll land-disturbing activities, including those that disturb less than an acre, shall provide adequate erosion control measures, structures, or devices in accordance with this article sufficient to retain the sediment generated by the land-disturbing activity within the boundaries of the tract during construction upon and development of the tract.\nPlan RequiredNo person shall initiate, direct, allow, or conduct any land-disturbing activity on a tract that meets any of the following criteria without having a copy of an erosion and sedimentation control plan (hereinafter referred to as “plan”) on the job site approved by the City:\n\nUncovers one acre or more. In determining the size of the disturbed area, lands being developed as a unit shall be aggregated regardless of ownership.\nIn borrow and waste areas covered by item D.6 below, with a disturbed area one acre or greater.\n\n\nCompliancePlans submitted to the Stormwater Administrator shall comply with this section and Section 28.4 of this article.\nProtection of PropertyPersons conducting land-disturbing activity shall take all reasonable measures to protect all public and private property from damage caused by such activity and associated sedimentation.\nConflicts; Applicability of More Restrictive RulesWhenever conflicts exist between the regulations in this article and federal, state, or local laws, ordinances, or rules, the more restrictive provision shall apply.\nB. Basic Control ObjectivesA plan shall include adequate erosion control measures, structures, or devices to address the following control objectives:\nIdentify Critical AreasOn-site areas that are subject to severe erosion and off-site areas that are especially vulnerable to damage from erosion and/or sedimentation are to be identified and receive special attention.\nLimit Time of ExposureAll land-disturbing activity shall be planned and conducted to limit exposure to the shortest feasible time.\nLimit Exposed AreasAll land-disturbing activity shall be planned and conducted to minimize the size of the area to be exposed at any one time.\nControl Surface WaterSurface water runoff originating upgrade of exposed areas should be controlled to reduce erosion and sediment loss during the period of exposure.\nControl SedimentationAll land-disturbing activity shall be planned and conducted to prevent sedimentation damage.\nManage Stormwater RunoffWhen the increase in the velocity of stormwater runoff resulting from a land-disturbing activity is sufficient to cause accelerated erosion of the receiving watercourse, plans are to include measures to control the velocity at the discharge point so as to minimize accelerated erosion of the site and to decrease sedimentation to any lake or watercourse.\nC. Mandatory Standards for Land-Disturbing ActivityNo land-disturbing activity subject to the control of this article shall be undertaken except in accordance with the following:\nLake, Watercourse and Wetland ProtectionAdditional erosion control measures, structures, or devices as specified in the City and Mecklenburg County Soil Erosion and Sedimentation Control Policies and Procedures statement issued by the Stormwater Administrator shall be required to provide a higher level of protection to lakes, watercourses, and wetlands from sedimentation.\nGraded Slopes and FillsThe angle for graded slopes and fills shall be no greater than the angle which can be retained by vegetative cover or other adequate erosion control measures, structures, or devices. In any event, slopes left exposed shall, within 21 calendar days of completion of any phase of grading, be planted or otherwise provided with temporary or permanent groundcover, devices, or structures sufficient to restrain erosion. The angle for graded slopes and fills shall be demonstrated to be stable. Stable is the condition where the soil remains in its original configuration, with or without mechanical constraints.\nFill MaterialMaterials being used as fill shall be consistent with those described in the North Carolina Administrative Code (NCAC) per 15A NCAC 13B .0562 unless the site is permitted by the North Carolina Department of Environmental Quality (hereinafter referred to as NCDEQ) Division of Waste Management to operate as a landfill. Not all materials described in 15A NCAC 13B .0562 may be suitable to meet geotechnical considerations of the fill activity and should be evaluated accordingly.\nGroundcoverWhenever land-disturbing activity is undertaken on a tract, the person conducting the land-disturbing activity shall install erosion and sedimentation control devices and practices that are sufficient to retain the sediment generated by the land-disturbing activity within the boundaries of the tract during construction upon and development of said tract, and shall plant or otherwise provide a permanent groundcover sufficient to restrain erosion after completion of construction or development. Provisions for a permanent groundcover sufficient to restrain erosion shall be accomplished within 21 calendar days following completion of construction or development. For an area of a site that is inactive for a period of 21 calendar days or longer, temporary groundcover shall be required\nPrior Plan ApprovalNo person shall initiate any land-disturbing activity on a tract if one acre or more is to be disturbed unless a plan for that activity has been submitted and approved in accordance with Section 28.4.\nPre-Construction ConferenceIf one acre or more is to be uncovered, the person conducting land-disturbing activity, or an agent of that person shall contact the Stormwater Administrator at least 48 hours before commencement of the land-disturbing activity. The purpose is to arrange an on-site meeting with the Stormwater Administrator to review and discuss the approved plan and the proposed land-disturbing activity.\nMonitoringThe landowner, financially responsible party, person conducting land-disturbing activity, or an agent of those persons, shall inspect all erosion and sedimentation control measures at least once a week and within 24 hours after any storm event of greater than one inch of rain per 24 hour period, or more frequently if required by federal or state law. The person performing this monitoring shall have certification or commensurate training and experience approved by the Stormwater Administrator.\n\nIf one acre or more is to be disturbed, a record of inspections shall be kept by the person conducting the land-disturbing activity, or an agent of that person, until six months after construction is completed and grading permit termination is approved by the Stormwater Administrator. The record shall include all monitoring and inspection elements as required by the North Carolina General Permit, NCG01 (NCG01). Additional record keeping may be required by federal or state law and as stated on the approved plans.\nCorrective action for repairs and maintenance indicated on the record shall be initiated within 24 hours after a rain event or within 24 hours of the last inspection if a rain event did not prompt the inspection, unless additional time is allowed by the Stormwater Administrator. The date of the completion of such repairs shall be noted. The records of inspection shall be made available to the Stormwater Administrator upon request.\nPersons who have had a notice of violation or repeated warning about off-site sedimentation or nonmaintenance of adequate erosion control measures, structures, or devices may be required to provide the Stormwater Administrator with a self-inspection record for the particular tract.\n\n\nSedimentation Control BufferNo land-disturbing activity during periods of construction or improvement to land shall be permitted in proximity to a lake or watercourse unless a sedimentation control buffer zone is provided along the margin of the watercourse of sufficient width to confine visible siltation within the 25% of the sedimentation control buffer zone nearest the land-disturbing activity.\n\nProjects On, Over, or Under WaterThis sedimentation control buffer requirement shall not apply to a land-disturbing activity in connection with the construction of facilities to be located on, over, or under a lake or watercourse.\nSedimentation Control Buffer MeasurementUnless otherwise provided, the width of a sedimentation control buffer zone is measured horizontally from the edge of the water to the nearest edge of the disturbed area, with the 25% of the strip nearer the landdisturbing activity containing natural or artificial means of confining visible siltation.\n\n\nAdherence to Approved PlansThe land-disturbing activity shall be conducted in accordance with the approved erosion and sedimentation control plan.\nD. Design and Performance Standards\nDesign StormAdequate erosion control measures, structures, and devices shall be planned, designed, constructed and maintained so as to provide protection from the calculated maximum peak of runoff from the 10-year storm. Runoff rates shall be calculated using the procedures in the USDA, Natural Resource Conservation Service’s (formerly Soil Conservation Service’s) National Engineering Field Manual for Conservation Practices, or other acceptable calculation procedures including, but not limited to, the Charlotte-Mecklenburg Storm Water Services Design Manual.\nInnovative MeasuresErosion and sedimentation measures applied alone or in combination to satisfy the intent of this article are acceptable if they are sufficient to prevent adverse secondary consequences. Innovative techniques and ideas shall be considered and may be used following approval by the Stormwater Administrator if it can be demonstrated that such techniques and ideas are likely to produce successful results.\nResponsibility for MaintenanceDuring the development of a tract, the person conducting the land-disturbing activity shall install and maintain all temporary and permanent erosion and sedimentation control measures as required by the approved plan or any section of this article, The North Carolina Sedimentation Pollution Control Act of 1973 and all rules and orders adopted pursuant to it (referred to as “Act’ within this article), or any order adopted pursuant to this article or the Act. After development, the landowner or person in possession or control of the land shall install and maintain all necessary permanent erosion and sediment control measures.\nAdditional MeasuresWhenever the Stormwater Administrator determines that accelerated erosion and sedimentation continues or shall likely continue, despite installation and maintenance of protective practices, the person conducting the landdisturbing activity shall be required to take additional protective action necessary to achieve compliance with the conditions specified in this article.\nStorm Drainage Facilities ProtectionPersons shall design the plan and conduct land-disturbing activity so that the post-construction velocity of the 10- year storm does not exceed the maximum nonerosive velocity tolerated by the soil of the receiving watercourse or the soil of the receiving land.\nBorrow and Waste AreasIf the same person conducts the land-disturbing activity and any related borrow or waste activity, the related borrow or waste activity shall constitute part of the land-disturbing activity, unless the borrow or waste activity is regulated under the Mining Act of 1971, N.C.G.S. 74, Article 7, or is a landfill regulated by the Division of Waste Management. If the land-disturbing activity and any related borrow or waste activity are not conducted by the same person, they shall be considered by the approving authority as separate land-disturbing activities.\nTemporary Access and Haul RoadsTemporary access and haul roads, other than public roads, constructed or used in connection with any landdisturbing activity shall be considered a part of such activity.\nOperations in Lakes or WatercoursesLand-disturbing activity in connection with construction in, on, over, or under a lake or watercourse shall be planned and conducted in such a manner as to minimize the extent and duration of disruption of the stream channel. The relocation of a stream, where relocation is an essential part of the proposed activity, shall be planned and executed so as to minimize changes in the stream flow characteristics.\n", "metadataJson": "{\"section_url\": \"/articles/article-28-soil-erosion-sedimentation-control/#283-requirements,-objectives,-and-standards\"}"}, {"title": "28.4 PLANS AND PERMITS", "text": "A. Erosion and Sedimentation Control Plans\nPlan RequirementsAll plans required for land-disturbing activities as identified in Section 28.3.A.2 shall meet the following:\n\nPlans shall contain architectural or engineering drawings, maps, assumptions, calculations, and narrative statements as needed to adequately describe the proposed development of the tract and the measures planned to comply with the requirements of this article. Plan content may vary to meet the needs of site-specific requirements. Detailed guidelines for plan preparation may be obtained from the Stormwater Administrator.\nPlans shall contain an authorized statement of financial responsibility and ownership signed by the person financially responsible for the land-disturbing activity or that person’s attorney-in-fact. The statement shall include the mailing and street addresses of the principal place of business of the person financially responsible and of the owner of the land or their registered agent(s). If the person financially responsible is not a resident of North Carolina, an agent in the state shall be designated in the statement for the purpose of receiving service of process and notice of compliance or noncompliance with the plan, the Act, this article, or rules or orders adopted or issued pursuant to this article.\nExcept as provided in item 4 below, if the person submitting the plan (hereinafter referred to as “the applicant”) is not the owner of the land to be disturbed, the draft erosion and sedimentation control plan shall include the owner’s written consent for the applicant to submit a draft erosion and sedimentation control plan and to conduct the anticipated land-disturbing activity.\nThe land-disturbing activity described in the plan shall comply with all federal, state, and local water quality laws, rules, and regulations, including, but not limited to, the Federal Clean Water Act. The Stormwater Administrator may require supporting documentation.\nThe land-disturbing activity described in the plan shall not result in a violation of rules adopted by the North Carolina Environmental Management Commission to protect riparian buffers along surface waters.\nThe land-disturbing activity described in the plan shall not result in a violation of any local ordinance, law, rule, or regulation.\nIf the plan is submitted for land-disturbing activity for which an environmental document is required by the North Carolina Environmental Policy Act (N.C.G.S. §113A-1, et seq.), such as required on tracts involving public money or public land, a complete environmental document shall be presented for review. The Stormwater Administrator’ time for reviewing the plan shall not commence until a complete environmental document is available for review.\nThe plan shall be filed digitally with the Stormwater Administrator. A copy of the stamped, approved plan shall be maintained on the job site.\nEffort should be made not to uncover more than 20 acres at any one time. If more than 20 acres are proposed to be uncovered at any one time, the plan shall contain the following:\n\nThe method of limiting the time of exposure and amount of exposed area to achieve the objectives of this article.\nA cut/fill analysis that shows where soil shall be moved from one area of the tract to another as ground elevation is changed.\nConstruction sequence and construction phasing to justify the time and amount of exposure.\nTechniques to be used to prevent sedimentation associated with larger disturbed areas.\nAdditional erosion control measures, structures, and devices to prevent sedimentation.\n\n\n\n\nPlan Review Process\n\nTimeline for Decisions on Plans\n\nThe Stormwater Administrator shall review each complete plan submitted and within 30 days of receipt thereof shall notify the applicant, that it has been approved, approved with modifications, or disapproved.\nShould the plan be filed and not reviewed within the specified timeframe, the land-disturbing activity may commence subject to Section 28.3.C.6 and item A.1.e, above, and the Stormwater Administrator shall endeavor to review the plan on an expedited schedule.\nIf the plan is disapproved, the Stormwater Administrator shall notify the applicant and, if required, the Director of the Division of Energy, Mineral, and Land Resources (NCDEMLR) within the NCDEQ of such disapproval within ten days thereof. The Stormwater Administrator shall advise the applicant and the Director of NCDEMLR in writing as to the specific reasons that the plan was disapproved. The applicant shall have the right to appeal the Stormwater Administrator decision as provided in Section 37.8.B.\nThe Stormwater Administrator will review each revised Plan submitted and within 15 days shall notify the applicant, that it has been approved, approved with modifications, or disapproved. Failure to approve, approve with modifications, or disapprove a revised Plan within 15 days of receipt shall be deemed approval.\n\n\nApprovalThe Stormwater Administrator shall only approve a plan upon determining that it complies with all applicable state and local regulations for erosion and sedimentation control. Approval assumes the applicant’s compliance with the federal and state water quality laws, regulations and rules. The Stormwater Administrator shall condition approval of plans upon the applicant’s compliance with federal and state water quality laws, regulations, and rules. Plans for which land-disturbing activity has not commenced within three years from the initial plan approval date are void.\nDisapproval of Plans\n\nDisapproval for ContentThe Stormwater Administrator may disapprove a plan based on its content. A disapproval based upon a plan’s content shall specifically state in writing the reasons for disapproval.\nOther DisapprovalsAny plan that is not in accordance with the requirements set forth in Section 28.4.A.1 above shall be disapproved. Additionally, a plan may be disapproved upon a finding that the financially responsible person or any parent or subsidiary thereof:\n\n(A)  Is conducting or has conducted land-disturbing activity without an approved plan, or has received notice of violation or is not in compliance with the provisions of the notice; or\n(B)  Has failed to pay a civil penalty assessed pursuant to the Act, or a local ordinance adopted pursuant to the Act, by the time the payment is due; or\n(C)  Has been convicted of a misdemeanor pursuant to N.C.G.S. §113A-64(b) or any criminal provision of a local ordinance adopted pursuant to the Act; or\n(D)  Has failed to substantially comply with state rules or local ordinances and regulations adopted pursuant to the Act.\n\n\nFor purposes of this subsection, an applicant’s record or the proposed transferee’s record may be considered for only the two years prior to the application date.\n\n\n\n\nAmendments to Plans\n\nCity-Required RevisionsIf the Stormwater Administrator, either upon review of such plan or upon inspection of the job site, determines that the plan is inadequate to meet the requirements of this article or that a significant risk of accelerated erosion or off-site sedimentation exists, a revised plan may be required. Pending the preparation of the revised plan, work on the affected area shall cease unless approved to continue under conditions outlined by the Stormwater Administrator.\nSubmission of Revisions or AmendmentsAmendments or revisions to a plan shall be made in written and/or graphic form and may be submitted at any time under the same requirements for submission of original plans. Until such time as the Stormwater Administrator approves any amendments or revisions, the land-disturbing activity shall not proceed, except in accordance with the plan as originally approved or under conditions outlined by the Stormwater Administrator per item a above.\n\n\nTransfer of PlansThe Stormwater Administrator may transfer an erosion and sedimentation control plan approved pursuant to this article without the consent of the plan holder to a successor-owner of the property on which the permitted activity is occurring or shall occur as provided in this subsection.\n\nThe Stormwater Administrator may transfer a plan if the following conditions are met:\n\nThe successor-owner of the property submits to the City a written request for the transfer of the plan and an authorized statement of financial responsibility and ownership.\nThe Stormwater Administrator finds the following:\n\n(A)  The plan holder is one of the following:\n\n(1)  A natural person who is deceased.\n(2)  A partnership, limited liability corporation, corporation, or any other business association that has been dissolved.\n(3)  A person who has been lawfully and finally divested of title to the property on which the permitted activity is occurring or shall occur.\n(4)   A person who has sold the property on which the permitted activity is occurring or shall occur.\n\n\n(B)  The successor-owner holds title to the property on which the permitted activity is occurring or shall occur.\n(C)  The successor-owner is the sole claimant of the right to engage in the permitted activity.\n(D)  There shall be no substantial change in the permitted activity.\n\n\n\n\nThe plan holder shall comply with all terms and conditions of the plan until such time as the plan is transferred.\nThe successor-owner shall comply with all terms and conditions of the plan once the plan has been transferred.\nNotwithstanding changes to law made after the original issuance of the plan, the Stormwater Administrator may not impose new or different terms and conditions in the plan without the prior express consent of the successor-owner. Nothing in this subsection shall prevent the Stormwater Administrator from requiring a revised plan pursuant to N.C.G.S. §113A-54.1(b) or item A.3 above.‍\n\n\nDisplay of Plan ApprovalA plan approval issued under this section shall be prominently displayed on the site until all construction is complete, all temporary sedimentation and erosion control measures are removed, the site has been stabilized, and the grading permit has been terminated and approved by the Stormwater Administrator. A copy of the stamped plan may serve to satisfy this requirement.\nFailure to File or Follow a PlanAny person engaged in land-disturbing activity who fails to file a plan required by and in accordance with this article shall be deemed in willful violation of this article. Any person who conducts a land-disturbing activity except in accordance with provisions of an approved plan shall be deemed in willful violation of this article.\nB. Permits\nNo person shall undertake any land-disturbing activity on a tract that disturbs one or more acres without obtaining the following:\n\nAn NCG01 permit by completing and submitting an electronic notice of intent (E-NOI) form requesting a certificate of coverage (COC) and obtaining the coverage certificate under the NCG01 Construction Site Stormwater General Permit. The letter of approval from the City shall contain a notice of the NCG01 permit requirement and the acreage approved for disturbance.\nA stamped and approved soil erosion and sedimentation control plan subject to Section 28.4.A.\nA land disturbance permit from the Stormwater Administrator. The only exceptions to the requirement for a land disturbance permit are land-disturbing activities that:\n\nHave been preapproved by the Stormwater Administrator at a pre-construction conference for the purpose of installing erosion and sedimentation control measures indicated on the approved plan; or\nAre for the purpose of fighting fires; or\nAre for the stockpiling of raw or processed sand, stone, or gravel in existing material processing plants and existing storage yards, provided that sediment control measures are utilized to protect against off-site damage; or\nDo not equal or exceed one acre of disturbed area. In determining the size of the disturbed area, lands being developed as a unit shall be aggregated regardless of ownership. Although a plan and a permit may not be required for a land-disturbing activity comprising less than one acre, such activity is subject to all other requirements of this article.\n\n\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-28-soil-erosion-sedimentation-control/#284-plans-and-permits\"}"}, {"title": "28.5 ADMINISTRATION", "text": "A. Appeals and variances of this article shall be subject to Article 37.B. Inspections and enforcement actions of this article shall be subject to Article 39.", "metadataJson": "{\"section_url\": \"/articles/article-28-soil-erosion-sedimentation-control/#285-administration\"}"}, {"title": "28.6 STORMWATER ADMINISTRATOR", "text": "A. DesignationThe Director of the City of Charlotte department responsible for management of the City’s NPDES MS4 Stormwater permit has been designated as the Stormwater Administrator. The Stormwater Administrator is authorized to administer and enforce Article 28.B. Powers and DutiesIn addition to the powers and duties that may be conferred by other provisions of this Ordinance and other laws, the Stormwater Administrator shall have the following powers and duties under this article:\nTo review and approve or disapprove applications submitted pursuant to Article 28.\nTo make determinations and render interpretations of Article 28.\nTo establish application requirements and schedules for submittal and review of applications and appeals.\nTo enforce Article 28 in accordance with its enforcement provisions in Article 39.\nTo maintain records, maps, and official materials as they relate to the adoption, amendment, enforcement, or administration of Article 28.\nTo provide expertise and technical assistance upon request to the City Council and the UDO Board of Adjustment.\n To designate appropriate other person(s) who shall carry out the powers and duties of the Stormwater Administrator.\nTo provide information and recommendations relative to variances and information as requested by the UDO Board of Adjustment in response to appeals.\nTo prepare and make available to the public a Stormwater Regulations Administrative Manual.\nTo take any other action necessary to administer the provisions of Article 28.\n", "metadataJson": "{\"section_url\": \"/articles/article-28-soil-erosion-sedimentation-control/#286-stormwater-administrator\"}"}, {"title": "28.7 DEFINITIONS", "text": "The definitions of this section apply only to this article. Unless specifically defined in this section, other words or phrases used in this article are as defined in Article 2 for general definitions or Article 15 for use definitions. In the case of a conflict between a term defined in Article 2 or Article 15 and this article, the definition in this section controls.\nSedimentation Control Buffer. The strip of land adjacent to a lake or watercourse.\nDay, Working. Days exclusive of Saturday, Sunday, and City government holidays during which weather conditions or soil conditions permit land disturbing activity to be undertaken.‍\nGroundcover. Any vegetative growth or other material that renders the soil surface stable against accelerated erosion.\nLake or Watercourse. Any stream, river, brook, swamp, sound, bay, creek, run, branch, canal, waterway, estuary, and any reservoir, lake or pond, natural or impounded, in which sediment may be moved or carried in suspension and which could be damaged by accumulation of sediment.\nNatural Erosion. The wearing away of the earth’s surface by water, wind, or other natural agents under natural environmental conditions undisturbed by man.\nMulch. Horticultural products composed primarily of plant remains or mixtures of such substances.\nParent. An affiliate that directly, or indirectly through one or more intermediaries, controls another person.\nPermit. The permit to conduct land-disturbing activities issued by the Stormwater Administrator.\nUncovered. The removal of groundcover from, on, or above the soil surface.\nUndertaken. The initiating of any activity, or phase of activity, which results or will result in a change in the groundcover or topography of a tract of land.\n", "metadataJson": "{\"section_url\": \"/articles/article-28-soil-erosion-sedimentation-control/#287-definitions\"}"}]}