{"title": "Article 29. Introduction to Subdivision, Streets, & Infrastructure", "metadataJson": "{\"base_url\": \"article-29-introduction-to-subdivision-streets-infrastructure\"}", "section": [{"title": "29.1 PURPOSE", "text": "These regulations for subdivision, streets, and other infrastructure are intended to allow for the orderly development of the City and its extraterritorial jurisdiction (ETJ), including the dedication of land and required improvements for rights-of-way and other public purposes, and to support the City’s goals for creating complete neighborhoods, safe and complete transportation networks, and a vibrant economy. Specifically, they are intended to:A. Protect and promote public health, safety, and welfare of community residents, visitors, property and business owners, and those that provide vital services to the community.B. Coordinate existing and future streets and infrastructure, including transit, pedestrian, and bicycle facilities, to ensure appropriate distribution of traffic, access to transportation choices, and safe and efficient access to land uses.C. Create and improve a network of well-connected streets and transit services that:\nBetter serves all users by providing more and safer route and mode choices and, therefore, more equitable access to transit services and destinations.\nIntegrates land use and transportation by creating the combinations of land uses and transportation infrastructure to best implement Place Type goals and policies, including facilitating planned growth.\nSupports sustainable quality of life and economic development by providing both increased transportation capacity for all modes and more user-friendly streets.\nD. Secure rights-of-way or easements to accommodate necessary and complete streets and other infrastructure.E. Promote the orderly division or consolidation of lots for development by implementing Subdivision regulations that incorporate the above, plus the following:\nSecure land to accommodate the City’s evolving needs for infrastructure and public facilities.\nPreserve and enhance the quality of the City’s natural features and natural resources.\n", "metadataJson": "{\"section_url\": \"/articles/article-29-introduction-to-subdivision-streets-infrastructure/#291-purpose\"}"}, {"title": "29.2 APPLICABILITY", "text": "A. The regulations in these Subdivision, Streets, and Other Infrastructure Articles apply to development activity, including change of use, within the City and its ETJ.B. North Carolina General Statutes (N.C.G.S.) limit what transportation improvements may be required for schools (see N.C.G.S. § 160A-307.1); therefore, some of the requirements, standards, and processes included within the Subdivision, Streets, and Other Infrastructure Articles may not be required for schools. Any reimbursements required by N.C.G.S. § 160A-307.1 shall be determined on a case-by-case basis by the Charlotte Department of Transportation (CDOT).C. Where development abuts a street controlled by the North Carolina Department of Transportation (NCDOT), all requirements and standards in these Subdivision, Streets, and Other Infrastructure Articles apply, unless otherwise prohibited by NCDOT.", "metadataJson": "{\"section_url\": \"/articles/article-29-introduction-to-subdivision-streets-infrastructure/#292-applicability\"}"}, {"title": "29.3 ADMINISTRATION", "text": "A. Variances and appeals of these Subdivision, Streets, and Other Infrastructure Articles (Articles 29 through 34) shall be subject to Article 37.B. Inspections and enforcement actions of these Subdivision, Streets, and Other Infrastructure Articles (Articles 29 through 34) shall be subject to Article 39.‍", "metadataJson": "{\"section_url\": \"/articles/article-29-introduction-to-subdivision-streets-infrastructure/#293-administration\"}"}]}