{"title": "Article 39. Enforcement", "metadataJson": "{\"base_url\": \"article-39-enforcement\"}", "section": [{"title": "39.1 INSPECTIONS", "text": "Section 39.1.A provides regulations and procedures applicable to all inspections and investigations related to this Ordinance. Subsequent sections provide supplementary information that is specific to the various articles.  Supplementary sections are arranged alphabetically by article title. The following articles do not have supplementary information related to inspections by the designated administrators: zoning (Articles 3 through 21), water supply watershed protection (Article 23), surface water improvement and management (SWIM) buffers (Article 26), floodplain regulations (Article 27), and tree protection (Article 20, Sections 20.12 through 20.18).A. Applicable to All Inspections and Investigations\nCity and County administrative staff may enter and inspect any premises, including land, buildings, and structures, within the jurisdiction of the City to determine compliance with the terms of applicable development approvals, or rules or orders adopted or issued pursuant to this Ordinance, and applicable state and local laws. In exercising this power, staff may enter any premises within the jurisdiction of the City or County at all reasonable hours for the purposes of inspection, investigation, or other enforcement action, upon presentation of proper credentials, so long as the appropriate consent has been given for inspection of areas that are not open to the public or an appropriate inspection warrant has been secured.\nIf, through inspection, it is determined that a property owner or person in control of the land has failed to comply or is no longer in compliance with this Ordinance or rules or orders issued, a written notice of violation may be issued in accordance with Section 39.2.A.1.\nNo person shall willfully resist, delay, obstruct, hamper, or interfere with any authorized City or County representative, Director or agent while inspecting and/or investigating or attempting to inspect and/or investigate an activity regulated in this Ordinance.\nThe City or County may, upon completion of work or activity undertaken pursuant to a development approval, make final inspections and issue a certificate of compliance or occupancy if staff finds that the completed work complies with all applicable state and local laws and with the terms of the approval. No building, structure, or use of land that is subject to a building permit required by N.C.G.S. § 160D, Article 11, shall be occupied or used until a certificate of occupancy or temporary certificate pursuant to N.C.G.S. § 160D-1116 has been issued.\nIn an emergency issued by the state or County, such as a windstorm, ice storm, fire, or other disaster, the requirements of this article may be waived by the City during the emergency period so that the requirements of this article shall in no way hamper private or public work to restore order in the City. This shall not be interpreted to be a general waiver of the intent of this article.\nB. Post Construction Stormwater Inspection -Additional Regulations (Article 25)This section supplements Section 39.1.A.\nThe Stormwater Administrator may, in accordance with Section 39.1.A.1, upon presentation of proper credentials, or an appropriate inspection warrant if necessary, enter and inspect any land, building, structure, or premises at all reasonable hours to ensure compliance with Article 25, or rules or orders adopted or issued pursuant to Article 25, and to investigate to determine whether the activity is being conducted in accordance with Article 25 and the approved Stormwater Management Plan, the Charlotte-Mecklenburg Storm Water Services Design Manual, the Charlotte-Mecklenburg Stormwater Control Measure (SCM) Design Manual and Administrative Manual and whether the measures required in the plan are effective. The Stormwater Administrator shall also have the power to require written statements or the filing of reports under oath as part of an investigation.\nNo person shall willfully resist, delay, obstruct, hamper, or interfere with the Stormwater Administrator while inspecting and/or investigating or attempting to inspect and/or investigate an activity under Article 25.\nInspections and investigations may be conducted or established on any reasonable basis including, but not limited to: routine inspections and/or investigations; random inspections and/or investigations; inspections and/or investigations based upon complaints or other notice of possible violations; and joint inspections and/or investigations with other agencies inspecting and/or investigations under environmental or safety laws. Inspections may include, but are not limited to, reviewing maintenance and repair records; sampling discharges, surface water, groundwater, and material or water in the SCMs; and evaluating the condition of SCM’s.\nC. Sign Inspection – Additional Regulations (Article 22)This section supplements Section 39.1.A\nThe Zoning Administrator may periodically inspect signs in order to ensure compliance with Article 22.\nThe Zoning Administrator may require written statements or the filing of reports with respect to pertinent questions relating to signs.\nD. Soil Erosion and Sedimentation Control Inspection -Additional Regulations (Article 28)This section supplements Section 39.1.A.\nThe Stormwater Administrator may, in accordance with Section 39.1.A.1, upon presentation of proper credentials, or an appropriate inspection warrant if necessary, inspect the sites of land-disturbing activity at all reasonable hours to ensure compliance and determine whether the activity is being conducted in accordance with Article 28, rules or orders adopted or issued pursuant to Article 28, and the approved plan. The Stormwater Administrator may also inspect whether the measures required in the plan are effective in controlling erosion and sediment resulting from land-disturbing activity. Notice of the right to inspect shall be included in the notification of each plan approval or issuance of the permit. No person shall willfully resist, delay, obstruct, hamper, or interfere with the Stormwater Administrator while they are inspecting or attempting to inspect a land-disturbing activity for compliance with Article 28.\nThe Stormwater Administrator may conduct such investigation as is reasonably deemed necessary to carry out their duties as prescribed in Article 28and enter at all reasonable hours upon any property, public or private, for the purpose of investigating and inspecting the sites of any land-disturbing activity.\nNo person shall refuse entry or access to the Stormwater Administrator who requests entry for purpose of inspection or investigation.\nThe Stormwater Administrator shall also have the power to require written statements or the filing of reports under oath as a part of investigating land-disturbing activity.\nE. Storm Drainage Inspection -Additional Regulations (Article 24)This section supplements Section 39.1.A.\nThe Stormwater Administrator may, in accordance with Section 39.1.A.1, upon presentation of proper credentials, or an appropriate inspection warrant if necessary, enter and inspect any land, building, structure, or premises at all reasonable hours to ensure compliance with Article 24, rules or orders adopted or issued pursuant to Article 24, and investigate to determine whether the activity is being conducted in accordance with Article 24 and the approved Stormwater Management Plan, the Charlotte-Mecklenburg Storm Water Services Design Manual, the Charlotte-Mecklenburg Stormwater Control Measure (SCM) Design Manual and Administrative Manual, and whether the measures required in the plan are effective. The Stormwater Administrator shall also have the power to require written statements or the filing of reports under oath as part of an investigation.\nNo person shall willfully resist, delay, obstruct, hamper, or interfere with the Stormwater Administrator while they are inspecting and/or investigating or attempting to inspect and/or investigate an activity for compliance with Article 24. The Stormwater Administrator, to the extent permitted by law, may seek the issuance of a search warrant to determine compliance with Article 24.\nThe inspections and investigations outlined in this section may be conducted or established on any reasonable basis including, but not limited to, routine inspections and/or investigations; random inspections and/or investigations; inspections and/or investigations based upon complaints or other notice of possible violations; and joint inspections and/or investigations with other agencies under environmental or safety laws. Inspections may include, but are not limited to, reviewing grading, surface water, construction methods and materials of storm drainage, and the location of permanent structures, walls, and fences.\nThe Stormwater Administrator shall also have the power to require written statements or the filing of reports under oath as part of an investigation.\nF. Subdivision, Streets, and Other Infrastructure Inspection – Additional Regulations (Articles 29 through 34)This section supplements Section 39.1.A.\nThe City shall be notified two days in advance of the work to be started in a subdivision so that an authorized representative of the City may be assigned to make any and all necessary inspections of the work performed.\nInspectors, may in accordance with Section 39.1.A.1, upon presentation of proper credentials, access to all parts of the work to ascertain whether or not the work as performed is in accordance with the specifications in Articles 29 through 34.\nNo material may be placed nor any work performed except in the presence of the inspector without special permission of the appropriate agency. Such inspection, however, does not relieve the contractor from any obligation to perform all of the work strictly in accordance with the specifications in Articles 29 through 34.\nIf any dispute arises as to the material furnished or the manner of performing the work, the inspector shall have authority to reject materials and/or suspend work until the question or issue can be referred to and decided by the appropriate agency. The contractor shall remove any work or material condemned as unsatisfactory by the inspector and shall rebuild and replace the work or material to the standard required by the specifications, all at their own expense.\n", "metadataJson": "{\"section_url\": \"/articles/article-39-enforcement/#391-inspections\"}"}, {"title": "39.2 ENFORCEMENT", "text": "Section 39.2.A provides enforcement regulations and procedures applicable to all enforcement actions for notices of violation, citations, penalties, criminal penalties, stop work orders, injunctions, orders of abatement, and other remedies. Subsequent sections provide supplementary regulations that are specific to the various articles. Supplementary sections are arranged in alphabetical order by article title.A. Applicable to all Enforcement ActionsAny person who violates any of the sections of this Ordinance, or rules or orders adopted or issued pursuant to this Ordinance, shall be subject to any one, all, or a combination of the civil penalties prescribed in this section. Penalties assessed under this article are in addition to and not in lieu of compliance with the requirements of this Ordinance. The person performing the work, the property owner, and the person contracting for the performance shall be jointly and severally liable for any penalty or other enforcement action imposed pursuant to this Ordinance or other applicable provision of law.\nNotice of Violation\n\nIf, through inspection and/or investigation, it is determined that a property owner or person in control of the land has failed to comply or is no longer in compliance with this Ordinance or rules, orders, or approvals issued pursuant to this Ordinance, the designated administrator of each article may issue a written notice of violation.\nA notice of violation shall identify the nature of the violation, contain the address or other description of the site upon which the violation occurred or is occurring, and shall set forth the measures necessary to achieve compliance with this Ordinance. The notice shall specify a date by which the person shall comply or remedy each violation and/or inform the person if a civil penalty will be assessed. If a violation continues or is not corrected within a reasonable period of time, as provided in the notification, appropriate action may be taken to correct and abate the violation, including civil and criminal penalties, as allowed by applicable law.\nWhen applicable, the notice of violation shall state that, if not corrected, each day’s continuing violation is a separate and distinct offense and is subject to additional civil penalties.\nThe notice of violation shall be delivered to the holder of the development approval, and to the property owner, if the property owner is not the holder of the development approval, by personal delivery, electronic delivery, or first-class mail and may be provided by similar means to the occupant of the property or the person undertaking the work or activity.\nThe notice of violation may be posted on the property.\nThe person providing the notice of violation shall certify to the City that the notice was provided, and the certificate shall be deemed conclusive in the absence of fraud.\nExcept as provided by N.C.G.S. § 160D-1123 or otherwise provided by law, a notice of violation may be appealed in accordance with Section 37.8.B. An appeal stays enforcement of the action appealed from and accrual of any fines assessed during the pendency of the appeal.\n\n\nCitations and PenaltiesViolation(s) of this Ordinance may subject the offender to a civil penalty that may be recovered by the City in a civil action in the nature of debt if the offender does not pay the penalty within the prescribed period of time in the notice of violation. Civil penalties associated with specific articles are described in the supplementary regulations located in Sections 39.2.B through 39.2.L and arranged in alphabetical order by article title.\nCriminal PenaltiesCriminal penalties may be imposed in specific articles or regulations of this UDO, when allowed under State law. Where misdemeanors may be imposed in this Ordinance, they are listed in the supplementary regulations and are located in the following sections of this article:  Section 39.2.B, “Floodplain Violations and Enforcement”, and Section 39.2.F, “Soil Erosion and Sedimentation Control Violations and Enforcement.”\nStop Work OrdersWhenever any work or activity subject to regulation pursuant to this Ordinance is undertaken in substantial violation of State or local law, or in a manner that endangers life or property, staff may order the specific part of the work or activity that is in violation or presents such a hazard to be immediately stopped.\n\nThe order shall be in writing, directed to the person doing the work or activity, and shall state the specific work or activity to be stopped, the reasons therefore, and the conditions under which the work or activity may be resumed. A copy of the order shall be delivered to the holder of the development approval and to the owner of the property involved, if that person is not the holder of the development approval, by personal delivery, electronic delivery, or first-class mail.\nThe staff person or persons delivering the stop work order shall certify to the City that the order was delivered and that certificate shall be deemed conclusive in the absence of fraud. Except as provided by N.C.G.S. § 160D-1208, a stop work order may be appealed in accordance with Section 37.8.B. No further work or activity shall take place in violation of a stop work order pending a ruling on the appeal. Violation of a stop work order shall constitute a Class 1 misdemeanor.\n\n\nInjunctions and Order of Abatement\n\nWhen any person violates an Ordinance regulation that makes unlawful a condition existing upon or use made of real property or any rule or order adopted or issued, or any term, condition or provision of an approved development approval or permit, the Director of a Department or the Administrator responsible for administering the applicable Article may either before or after the institution of any other action or proceeding authorized by this Ordinance, authorize the City Attorney to institute a civil action in the name of the City for a mandatory or prohibitory injunction and order of abatement requiring correction of the unlawful condition upon or cessation of the unlawful use of the property, or threatened violation. When a violation of the Ordinance occurs, the City may apply to the Mecklenburg County Superior Court for a mandatory or prohibitory injunction and order of abatement requiring correction of the unlawful condition upon or cessation of the unlawful use of the property.\nIn addition to an injunction, the court may enter an order of abatement as a part of the judgment. An order of abatement may direct that buildings or other structures on the property be closed, demolished, or removed; that fixtures, furniture, or other movable property be removed from buildings on the property; that improvements or repairs be made; or that any other action be taken that is necessary to bring the property into compliance with the Ordinance.\nIf the defendant fails or refuses to comply with an injunction or with an order of abatement within the time allowed by the court, the defendant may be cited for contempt, and the City may execute the order of abatement. The City shall have a lien on the property for the cost of executing an order of abatement in the nature of a mechanic’s and materialman’s lien. The defendant may secure cancellation of an order of abatement by paying all costs of the proceedings and posting a bond for compliance with the order. The bond shall be given with sureties approved by the Mecklenburg County Superior Court in an amount approved by the judge before whom the matter is heard and shall be conditioned on the defendant’s full compliance with the terms of the order of abatement within a time fixed by the judge. Cancellation of an order of abatement shall not suspend or cancel an injunction issued in conjunction therewith.\nAn action for injunctive relief under this section shall not relieve any party to such proceedings from any civil or criminal penalty prescribed for violation in specific articles of this Ordinance.\n\n\nOther RemediesSubject to the provisions of the development regulation, any development regulation may be enforced by any remedy provided by N.C.G.S. § 160A-175.\n\nIn addition to other remedies, professional staff may withhold approval for the issuance of a permit, or a certificate of occupancy to prevent the unlawful erection, construction, reconstruction, alteration, repair, conversion, moving, maintenance, use of the land, building or structure or to prevent any illegal act, business, or use in or about the site or premises.\nIn addition to other remedies, professional staff may suspend or revoke a permit, development approval, or a certificate of occupancy issued under the provisions of this Ordinance if it is determined that the permit was issued in error, or on the basis of incorrect information.  Revocation of a development approval is authorized for any substantial departure from the approved application, plans, or specifications; for refusal or failure to comply with the requirements of any applicable development regulations; or for false statements or misrepresentations made in securing the approval; or any State law delegated to the City or County for enforcement purposes in lieu of the State. Revocation of a permit, development approval, or certificate of occupancy is also authorized when the site, parcel, building or structure, or any portion thereof, is in violation of any applicable provision of the sign regulations that would create a public health and safety hazard.\n\nWritten notice of the suspension or revocation of a permit, development approval, or a certificate of occupancy shall be given in accordance with the same provisions for issuance of the permit, development approval, or certificate of occupancy, and by notifying the holder of the permit, development approval, or certificate of occupancy in writing, stating the reason for the revocation or suspension. The same development review and approval process required for issuance of the approval shall be followed.\n\n\nAny party aggrieved by the suspension or revocation of a permit, development approval or a certificate of occupancy may appeal the decision in accordance with Section 37.8.B.\n\n\nB. Floodplain Violations and Enforcement – Additional Regulations (Article 27)This section supplements Section 39.2.A.\nPenalties for Violation\n\nMisdemeanorViolation of the provisions of the floodplain regulations in Article 27 or failure to comply with any of its requirements including violation of conditions and safeguards established in connection with grants of floodplain development permits, variances, or conditions, shall constitute a Class 1 misdemeanor.\nFines and Imprisonmentny person who violates Article 27 or fails to comply with any of its requirements shall, upon conviction thereof, be fined not more than $500 or imprisoned for not more than 30 days. Each day such violation continues shall be considered a separate offense.\nOther ActionNothing herein contained shall prevent the City or the Floodplain Administrator from taking such other lawful action as is necessary to prevent or remedy any violation, including but not limited to seeking injunctive relief, orders of abatement, or other similar equitable relief.\n\n\nCorrective Procedures\n\nViolationIf the Floodplain Administrator finds violations of Article 27 and notifies the property owner, building occupant, or permittee of the violation, the owner, occupant, or permittee shall immediately remedy each violation of law cited in the notice.\nNotice of Violation and Order\n\nIf the property owner or occupant of a building or property fails to take prompt corrective action, the Floodplain Administrator may issue a written notice of violation, in accordance with Section 39.2.A.1\nIf the Floodplain Administrator finds that the building or development is in violation of the floodplain regulations, they may issue an order in writing, to the property owner, or occupant. The order shall require the property owner or occupant to remedy the violation within a period, not less than 60 calendar days, nor more than 180 calendar days. If the Floodplain Administrator finds that there is imminent danger to life or other property, they may order that corrective action be taken within a lesser period as may be feasible. If no corrective action is taken as ordered, the Floodplain Administrator, with the written authorization of the City Manager, shall have the authority to enter upon the property to perform the work necessary to correct the condition and the owner or occupant shall be responsible for the actual costs incurred.\n\n\nAppealAny property owner or occupant who has received a notice of violation or order to take corrective action may appeal the order to the UDO Board of Adjustment in accordance with Section 37.8.B.\nFailure to Comply with OrderIf the property owner or occupant of a building or property fails to comply with an order to take corrective action from which no appeal has been taken or fails to comply with an order of the UDO Board of Adjustment following an appeal, they shall be guilty of a Class 1 misdemeanor and shall be punished at the discretion of the court. In addition, the owner or occupant shall be subject to civil enforcement as described in this section.\nInsurance CoverageIssuance of an order to take corrective action may impact insurance coverage through the National Flood Insurance Program including, but not limited to, denying coverage. The Floodplain Administrator may notify the property owner and a lender with a security interest in the property that the order to take corrective action may impact flood insurance coverage until the violation is corrected and the order rescinded.\n\n\nC. Historic District Overlay Enforcement –The Zoning Administrator provides enforcement for Sections 14.1 and 14.2. The enforcement actions and requirements in Section 39.2.A are supplemented in the following sections:\nHistoric District Overlay (HDO):\n\nSection 14.1.N, “Violations and Enforcement”;\nSection 14.1.O, “Notices of Violation”;\nSection 14.1.P, “Citations and Penalties”;\nSection 14.1.Q, “Civil Judicial Penalties”;\nSection 14.1.R, “Other Remedies”;\nSection 14.1.S, “Revocation of Building Permit”; and\nSection 14.1.T, “Denial or Revocation of Certificate of Compliance and Occupancy”.\n\n\nStreetside Historic District Overlay (HDO-S):\n\nSection 14.2.D, “Violations and Enforcement”;\nSection 14.2.E, “Notices of Violation”;\nSection 14.2.F, “Citations and Penalties”;\nSection 14.2.G, “Civil Judicial Penalties”;\nSection 14.2.H, “Other Remedies”;\nSection 14.2.I, “Revocation of Building Permit”; and\nSection 14.2.J, “Denial or Revocation of Certificate of Compliance and Occupancy”\n\n\nD. Post Construction Storm Water Violations and Enforcement – Additional Regulations (Article 25)This section supplements Section 39.2.A.\nViolations\n\nFailure to comply with an applicable requirement, prohibition, standard, or limitation imposed by Article 25, or the terms or conditions of any permit or other development or redevelopment approval or authorization granted pursuant to Article 25, is unlawful and shall constitute a violation of Article 25.\nAny person who erects, constructs, reconstructs, alters (whether actively or passively), or fails to erect, construct, reconstruct, alter, repair, or maintain any structure, SCM, practice, or condition in violation of the Article 25 shall be subject to the remedies, penalties and/or enforcement actions in accordance with this section. For the purposes of Article 25, responsible person(s) shall include but not be limited to:\n\nAny person who participates in, assists, directs, creates, causes, or maintains a condition that constitutes a violation of Article 25, or fails to take appropriate action, so that a violation of Article 25 results or persists.\nThe owner of the land on which the violation occurs, any tenant or occupant of the property, any person who is responsible for stormwater controls or practices pursuant to a private agreement or public document, or any person, who has control over, or responsibility for, the use, development, or redevelopment of the property.\n\n\n\n\nNotice of Violation and Order to CorrectIf, through inspection and/or investigation, it is found that any building, structure, or land is in violation of Article 25, the Stormwater Administrator may issue a written notice of violation to the responsible person/entity, in accordance with Section 39.2.A.1. The notice shall, if required, specify a date by which the responsible person/entity shall comply with Article 25, and advise that they are subject to remedies and/or penalties or that failure to correct the violation within the time specified will subject the responsible person/entity to remedies and/or penalties as described in this section. In determining the measures required and the time for achieving compliance, the Stormwater Administrator shall take into consideration the technology and quantity of work required, and shall set reasonable and attainable time limits. If a violation is not corrected within a reasonable period of time, as provided in the notification, the Stormwater Administrator may take appropriate action to correct and abate the violation to ensure compliance with Article 25.\nExtension of TimeA responsible person/entity who receives a notice of violation and correction order, or the owner of the land on which the violation occurs, may submit to the Stormwater Administrator a written request for an extension of time for correction of the violation. Upon determining that the request includes enough information to show that the violation cannot be corrected within the specified time limit for reasons beyond the control of the responsible person/entity requesting the extension, the Stormwater Administrator may extend the time limit as is reasonably necessary to allow timely correction of the violation, up to, but not exceeding 60 days. The Stormwater Administrator may grant 30-day extensions in addition to the foregoing extension if the violation cannot be corrected within the permitted time due to circumstances beyond the control of the responsible person/entity violating Article 25. The Stormwater Administrator may grant an extension only by written notice of extension. The notice of extension shall state the date prior to which correction shall be made, after which the violator will be subject to the penalties described in the notice of violation and correction order.\nEmergency EnforcementIf a violation seriously threatens the effective enforcement of Article 25 or poses an immediate danger to the public health, safety, or welfare or the environment, the Stormwater Administrator may order the immediate cessation of a violation. Any person so ordered shall cease any violation immediately. The Stormwater Administrator may seek immediate enforcement, without prior written notice, through any remedy or penalty specified in this section.\nRemedies and Penalties\n\nCivil PenaltiesAny person who violates any of the provisions of Article 25 or rules or other orders adopted or issued pursuant to Article 25 may be subject to a civil penalty. A civil penalty may be assessed from the date the violation occurs. The Stormwater Administrator shall determine the amount of the civil penalty and shall notify the violator of the amount of the penalty and the reason for assessing the penalty. No penalty shall be assessed until the person alleged to be in violation has been notified of the violation except as provided in this section in which case the penalty is assessed concurrently with a notice of violation. Refusal to accept the notice or failure to notify the Stormwater Administrator of a change of address shall not relieve the violator’s obligation to comply with Article 25 or to pay such a penalty.\nEach Day a Separate OffenseEach day that a violation continues shall constitute a separate and distinct violation or offense.\nPenalties Assessed Concurrent with Notice of ViolationPenalties may be assessed concurrently with a notice of violation for any of the following, in which case the notice of violation shall also contain a statement of the civil penalties to be assessed, the time of their accrual, and the time within which they shall be paid or be subject to collection in the nature of a debt. Notices of violations shall be provided in accordance with Section 39.2.A.1.\n\nFailure to submit a Stormwater Management Plan.\nPerforming activities regulated by Article 25 without an approved Stormwater Management Plan.\nObstructing, hampering, or interfering with an authorized representative who is in the process of carrying out official duties.\nA repeated violation for which a notice was previously given on the same project and to the same responsible person/entity responsible for the violation.\nWillful violation of Article 25.\nFailure to install or maintain an SCM per the approved plan.\n\n\nAmount of PenaltyThe civil penalty for each violation of Article 25 may be up to the maximum allowed by law, and in accordance with the Stormwater Regulations Administrative Manual. In determining the amount of the civil penalty, the Stormwater Administrator shall consider any relevant mitigating and aggravating factors including, but not limited to:\n\nThe effect, if any, of the violation.\nThe degree and extent of harm caused by the violation.\nThe cost of rectifying the damage.\nhether the violator saved money through noncompliance.\nWhether the violator took reasonable measures to comply with Article 25.\nWhether the violation was committed willfully.\nWhether the violator reported the violation to the Stormwater Administrator.\nThe prior record of the violator in complying or failing to comply with Article 25 or any other erosion and sedimentation control regulations or law.\n\n\nFailure to Pay Civil Penalty AssessmentIf a violator does not pay a civil penalty assessed by the Stormwater Administrator within 30 days after it is due, or does not request an appeal hearing, in accordance with Section 37.8.B, the Stormwater Administrator shall request the City Attorney to initiate a civil action to recover the amount of the assessment. The civil action shall be brought in Mecklenburg County Superior Court or in any other court of competent jurisdiction. A civil action shall be filed within three years of the date the assessment was due. An assessment that is appealed is due at the conclusion of the administrative and judicial review of the assessment.\nAppeal of Remedy or PenaltyThe issuance of an order of restoration and/or notice of assessment of a civil penalty by the Stormwater Administrator shall entitle the responsible party or entity to an appeal before the UDO Board of Adjustment if such person submits written request for an appeal hearing to the clerk of the UDO Board of Adjustment within 30 days of the receipt of an order of restoration and/or notice of assessment of a civil penalty. The request for an appeal shall be accompanied by a filing fee as established by the City Council. The appeal of an order of restoration and/or notice of assessment of a civil penalty shall be conducted as described in Section 37.8.B.\nAdditional Remedies\n\nWithholding of Certificate of OccupancyThe Stormwater Administrator or other authorized agent may refuse to issue a certificate of occupancy for the building or other improvements constructed or being constructed on the site and served by the stormwater practices in question until the applicant or other responsible person has taken the remedial measures set forth in the notice of violation or has otherwise cured the violations described therein.\nDisapproval of Subsequent Permits and Plan ApprovalsAs long as a violation of Article 25 continues and remains uncorrected, the Stormwater Administrator or other authorized agent may withhold, and the Stormwater Administrator may disapprove, any request for permit or plan approval or authorization provided for by Article 25 or other regulations of the City, as appropriate for the land on which the violation occurs.\nInjunction, Abatements, Etc.The Stormwater Administrator, with the written authorization of the City Manager, may authorize the City Attorney to institute a civil action in the name of the City in a court of competent jurisdiction for a mandatory or prohibitory injunction and order of abatement requiring the correction of a violation of Article 25. Any person violating Article 25 shall be subject to the full range of equitable remedies provided in the general statutes or at common law.\nCorrection as Public Health Nuisance, Costs as Lien, Etc.If the violation is deemed dangerous or prejudicial to the public health or public safety and is within the geographic limits prescribed by N.C.G.S. § 160A-193, the Stormwater Administrator, with the written authorization of the City Manager, may request the City Council to cause the violation to be corrected upon a finding that the violation is dangerous or prejudicial to public health or safety, and the costs of the action shall be paid by the person in default.  If the expense is not paid, it is a lien against the property.\nRestoration of Areas Affected by Failure to ComplyBy issuance of an order of restoration, the Stormwater Administrator may require a person who engaged in a land-disturbing activity and failed to comply with Article 25 to restore the waters and land affected by such failure so as to minimize the detrimental effects of the resulting pollution. This authority is in addition to any other civil penalty or injunctive relief authorized in this section.\n\n\n\n\nE. Sign Violations and Enforcement – Additional Regulations (Article 22)This section supplements Section 39.2.A\nEnforcement\n\nIf, through inspection, it is determined that a person has failed to comply with the provisions of Article 22, the Zoning Administrator shall issue to the violator either: 1) a warning citation for violations associated with, but not limited to, temporary-type signs such as portable signs, banners, and feather flags; or 2) a notice of violation for violations associated with permanent-type signs.\nViolators issued a warning citation shall correct the violation within ten days and violators issued a notice of violation shall correct the violation within 30 days. If the violation is not corrected within the specified time period, the violator is subject to further enforcement action.\nIf a person continues to fail to comply with a particular provision of the sign regulations after the imposition of any one type of penalty, the person shall continue to remain subject to the remedies prescribed in this section for the continued violation of the particular provision of these regulations. The sign regulations in Article 22 may be enforced by any one, all, or a combination of the penalties and remedies authorized and prescribed in Section 39.2.A and in this section.\n\n\nNotice of ViolationsUpon recognition of a zoning violation, the Zoning Administrator may issue a notice of violation, in accordance with Section 39.2.A.1.\nCitations and Penalties\n\nThe Zoning Administrator may issue written citations to any person if there is a reasonable cause to believe that the person has violated any provision of the sign regulations in Article 22. A violator shall be deemed to be the owner of the premises, the agent of the owner authorized to be responsible for the premises, the occupant of the premises, or the holder of the development approval. Citations may be directly issued or delivered to the occupant, lessee, or person having immediate beneficial use of the property, or the holder of the development approval. If the violator cannot be readily found, then the citation may be mailed to the last known mailing address as shown in the Mecklenburg County tax abstract, or by making other reasonable efforts to communicate the existence of the violation to violator, in accordance with Section 39.2.A.1.\nThe initial citation for each violation shall be $50. The issuance of a second citation for any violation that has not been corrected shall be in an amount up to $200 for the first and second citation, up to $500 for the third citation, and up to $500 thereafter. Any unpaid citations and delinquency charges shall be cumulative and shall subject the violator to a possible civil penalty to be recovered in a civil action in the nature of debt.\nThe citation shall direct the violator to make payment to the Planning Department within 15 days of the date of the citation, or alternatively pay the citation by mail. If the violator does not make such payment or does not mail the citation and payment within 15 days of the issuance, a delinquency charge of $10 shall be added to the amount shown on the citation. The citation shall inform the violator that a civil complaint may be filed if the citation and delinquency charge is not paid within 15 days from the date of delinquency. Further, the citation shall state that the violation is a continuing violation and additional citations may be issued with escalating amounts for a continuing violation.\n\n\nCivil Judicial Remedies\n\nThe City may institute any appropriate action or proceedings to prevent any structure from being erected, constructed, reconstructed, altered, repaired, converted, maintained, or any structure or land from being used in violation of the sign regulations or other City regulations in order to restrain, correct, or abate the violation. The General Court of Justice shall have jurisdiction to issue such orders as may be appropriate.\nIf the sign regulations make unlawful a condition existing upon or use made of real property, then the sign regulations may be enforced by injunction and order of abatement and the General Court of Justice shall have jurisdiction to issue such orders. When a violation of Article 22 occurs, the City may apply to the appropriate division of the General Court of Justice for a mandatory or prohibitory injunction and order of abatement commanding the defendant to correct the unlawful condition upon or cease the unlawful use of the property. See also Section 38.6.\n\n\nF. Soil Erosion and Sedimentation Control Violations and Enforcement – Additional Regulations (Article 28)This section supplements Section 39.2.A.\nNotice of Violation\n\nIf it is determined that a person engaged in land-disturbing activity has failed to comply with the North Carolina Sedimentation Pollution Control Act, the soil erosion and sedimentation control regulations in Article 28, or rules or orders adopted or issued, or has failed to comply with an approved plan, the Stormwater Administrator shall issue a written notice of violation to the property owner, the property owner’s agent, or other person in possession or control of the land, in accordance with N.C.G.S. § 113A­61.1.\nNotices of violations shall be provided to the property owner, the property owner’s agent, or other person in possession or control of the land. The notice shall, if required, specify a date by which the person shall comply with Article 28 and shall advise that the person may be subject to civil penalties, and if the violation is not corrected within the time specified, may be subject to additional civil penalties, including those provided in any other authorized enforcement action.\nIf the person engaged in the land-disturbing activity has not received a previous notice of violation, under Article 28 or its predecessor, the City shall offer assistance in developing corrective measures. Information on how to obtain assistance in developing corrective measures shall be included in the notice of violation. Assistance may be provided by referral to a technical assistance program on behalf of the approving authority, referral to a cooperative extension program, or by the provision of written materials such as NCDEQ guidance documents.\nThe notice of violation may be served by any means authorized under N.C.G.S. Chapter 1A-1, Rule 4.\nIn determining the measures required and the time for achieving compliance, the Stormwater Administrator shall take into consideration the technology and quantity of work required and shall set reasonable and attainable time limits.\nThe Stormwater Administrator shall use local rainfall data approved by the Stormwater Administrator to determine whether the design storm identified in Article 28 has been exceeded.\n\n\nPenalties\n\nAny person who violates Article 28, or rules or orders adopted or issued pursuant to Article 28, or who initiates or continues a land-disturbing activity for which a plan is required, except in accordance with the terms, conditions, and provisions of an approved plan, is subject to a civil penalty. A civil penalty may be assessed from the date the violation first occurs. No penalty shall be assessed until the person alleged to be in violation has been notified of the violation through a notice of violation that complies with the notice requirements in Section 39.2.A.1, unless the penalty is assessed concurrently with the notice of violation. Refusal to accept the notice or failure to notify the Stormwater Administrator of a change of address shall not relieve the violator’s obligation to comply with Article 28 or to pay such a penalty.\nThe maximum civil penalty for each violation of Article 28 is $5,000. Each day of continuing violation shall constitute a separate violation. When the person has not been assessed any civil penalty under this subsection for any previous violation, and that person abated continuing environmental damage resulting from the violation within 180 days from the date of the notice of violation, the maximum cumulative total civil penalty assessed under this section for all violations associated with the land-disturbing activity for which the erosion and sedimentation control plan is required is $25,000.\nCivil penalties may be assessed concurrently with a notice of violation for any of the following:\n\nFailure to submit a plan.\nPerforming land-disturbing activities without an approved plan and pre-construction conference or permit.\nObstructing, hampering, or interfering with an authorized representative who is in the process of carrying out official duties.\nA repeated violation for which a notice was previously given on the same tract or to the person responsible for the violation. For the purposes of this section (Section 39.2.F), person responsible shall mean:\n\n*(A)*The developer or other person who has or holds himself out as having financial or operational control over the land-disturbing activity.\n*(B)*The landowner or person in possession or control of the land who has directly or indirectly allowed the land-disturbing activity or has benefited from it or has failed to comply with any section of this Article, the North Carolina Sedimentation Pollution Control Act, or any order adopted pursuant to this Article or the North Carolina Sedimentation Pollution Control Act.\n*(C)*The contractor with control over the tract or the contractor conducting the land-disturbing activity.\n\n\nWillful violation of Article 28.\nFailure to install or adequately maintain erosion control measures, structures, or devices per the approved plan and additional measures per Section 28.3.D.4 such that it results in sedimentation in a wetland, lake, or watercourse, or other designated protected areas.\nFailure to install or adequately maintain erosion control measures, structures, or devices per the approved plan and additional measures per Section 28.3.D.4 such that it results in off-site sedimentation.\n\n\nThe amount of the civil penalty shall be assessed pursuant to the following:\n\nViolations Involving Conducting a Land-Disturbing Activity Without an Approved PlanAny person engaged in a land-disturbing activity without a required approved plan and preconstruction conference or permit in accordance with Article 28 or who initiates, directs, or allows a land-disturbing activity without a required, approved plan and preconstruction conference or permit shall be subject to a civil penalty of $5,000 per day, per violation. The penalty may be decreased based on mitigating circumstances located in Section 39.2.F.2.e.\nViolations Resulting in Sediment Entering a Wetland, Lake, or WatercourseViolations resulting in sediment entering a wetland, lake, or watercourse subject the violator to a civil penalty of $3,000 per day, per violation. The penalty may be increased up to $5,000 per day or decreased, based on mitigating circumstances in Section 39.2.F.2.e.\nViolations Resulting in Off-Site Sedimentationiolations that result in off-site sedimentation subject the violator to a civil penalty of $1,000 per day, per violation. The penalty may be increased up to $5,000 per day or decreased, based on mitigating circumstances in Section 39.2.F.2.e. Violations of this type may include, but are not limited to, the following:\n\n*(A)*Conducting land-disturbing activities beyond the limits of an existing permit without approval of an amended plan and permit that result in off-site sedimentation.\n*(B)*Failure to properly install or maintain erosion control measures in accordance with the approved plan or the Charlotte Land Development Standards Manual that results in off-site sedimentation.\n*(C)*Failure to retain sediment from leaving a land-disturbing activity as required by Article 28.\n*(D)*Failure to restore off-site areas affected by sedimentation during the time limitation established in a notice of violation and as prescribed in the City of Charlotte and Mecklenburg County Soil Erosion and Sedimentation Control Policies and Procedures.\n*(E)*Any other violation of Article 28 that results in off-site sedimentation.\n\n\nViolations Not Resulting in Off-Site SedimentationViolations of Article 28 that do not result in off-site sedimentation subject the violator to a civil penalty of $500 per day, per violation. The penalty may be increased up to $5,000 per day or decreased, based on mitigating circumstances in Section 39.2.F.2.e. Violations of this type may include, but are not limited to, the following:\n\n*(A)*Failure to comply with the mandatory standards for land-disturbing activity as specified in Section 28.3.C, except Sections 28.3.C.4 and 28.3.C.5.\n*(B)*Failure to submit to the Stormwater Administrator for approval an acceptable revised erosion and sedimentation control plan after being notified by the Stormwater Administrator of the need to do so.\n*(C)*Failure to maintain adequate erosion control measures, structures, or devices to confine sediment.\n*(D)*Failure to follow the provisions on the approved plan.\n*(E)*Any other action or inaction that constitutes a violation of Article 28 that did not result in off-site sedimentation.\n\n\nThe Stormwater Administrator is authorized to vary the amount of the per diem penalty set out in Section 39.2.F.2 to take into account any relevant mitigating and aggravating factors.\n\n\nIn determining the amount of the civil penalty, the Stormwater Administrator shall consider any relevant mitigating and aggravating factors, including, but not limited to:\n\nThe effect, if any, of the violation.\nThe degree and extent of harm caused by the violation.\nThe cost of rectifying the damage.\nWhether the violator saved money through noncompliance.\nWhether the violator took reasonable measures to comply with Article 28.\nWhether the violation was committed willfully.\nWhether the violator reported the violation to the Stormwater Administrator.\nThe prior record of the violator in complying or failing to comply with Article 28 or any other erosion and sedimentation control regulations or law.\n\n\nRepeat violators may be charged by a multiple of the base penalty determined in Section 39.2.F.2. The penalty for a repeat violator may be doubled for each previous time the person responsible for the violation was notified of a violation of Article 28 or any other soil erosion and sediment control regulation or the North Carolina Sedimentation Pollution Control Act. In no case may the penalty exceed the maximum allowed in Section 39.2.F.2.b.\n\nThe Stormwater Administrator shall determine the amount of the civil penalty and notify the person responsible of the amount of the penalty and the reason for assessing the penalty. The notice of assessment shall be provided in accordance with 39.2.A.1 and shall direct the violator to either pay the assessment, contest the assessment through an appeal as specified in Section 37.8.B, or file with the North Carolina Sedimentation Control Commission for remission. A remission request shall be accompanied by a waiver of the right to a contested case appeal hearing pursuant to N.C.G.S. Chapter 150B and stipulation of the facts on which the assessment was based. If a violator does not pay a civil penalty assessed by the Stormwater Administrator within 30 days after it is due or does not request an appeal hearing as provided in Section 37.8.B, the Stormwater Administrator, with authorization from the City Manager, shall request the City Attorney to institute a civil action in the name of the City to recover the amount of the assessment. The civil action shall be brought in the Mecklenburg County Superior Court.\nA civil action shall be filed within three years of the date the assessment was due. An assessment that is not appealed is due when the violator is served with a notice of assessment. An assessment that is appealed is due at the conclusion of the administrative and judicial review of the assessment.\nThe clear proceeds of civil penalties collected by the City under this subsection shall be remitted to the Civil Penalty and Forfeiture Fund in accordance with N.C.G.S. § 115C-457.2. Clear proceeds include the full amount of all civil penalties and fines collected, diminished only by the actual costs of the collection, not to exceed 20% of the amount collected. The collection cost percentage to be used shall be established and approved by the North Carolina Office of State Budget and Management on an annual basis.\n\n\n\n\nCriminal MisdemeanorsAny person who knowingly or willfully violates any provision of Article 28, or rule or order adopted or issued by the City or the County, or who knowingly or willfully initiates or continues a land-disturbing activity for which a plan is required, except in accordance with the terms, conditions, and provisions of an approved plan, shall be guilty of a Class 2 misdemeanor and may be subject to a fine not to exceed $5,000. This is in addition to any civil penalties that may be charged. Each day of continuing violation shall constitute a separate violation.\nInjunctive Relief\n\nWhenever the Stormwater Administrator has reasonable cause to believe that any person is violating or threatening to violate Article 28 or any term, condition, or provision of an approved plan, the Stormwater Administrator, with the written authorization of the City Manager, may, either before or after the institution of any other action or proceeding authorized by Article 39.2.D, authorize the City Attorney to institute a civil action in the name of the City for injunctive relief to restrain the violation or threatened violation. See Section 39.2.A.5 on injunctions. The action shall be brought pursuant to N.C.G.S. § 160A-175 in the Mecklenburg County Superior Court.\nUpon determination by a court that an alleged violation is occurring or is threatened, the court shall enter such orders or judgments as are necessary to abate the violation or to prevent the threatened violation. See Section 39.2.A.5 for injunctions and orders of abatement. The institution of an action for injunctive relief under this section shall not relieve any party to such proceedings from any civil or criminal penalty prescribed for violations of Article 28.\n\n\nOther Remedies\n\nRestoration of Areas Affected by Failure to ComplyThe Stormwater Administrator may require a person who engaged in any land-disturbing activity and failed to retain sediment generated by the activity to restore the waters and land affected by the failure so as to minimize the detrimental effects of the resulting pollution by sedimentation. This authority is in addition to any other civil penalty or injunctive relief authorized under Sections 39.2.F.2 and 39.3.F.4.\nWithholding Approval of a Certificate of OccupancyWith regard to the development of any tract that is subject to Article 28, no certificate of occupancy shall be issued where any of the following conditions exist:\n\nThere is a violation of Article 28 with respect to the tract.\nIf there remains, due and payable to the City, civil penalties that have been levied against the person conducting the land-disturbing activity for violations of Article 28. If a penalty is under appeal, the Stormwater Administrator may require that the amount of the fine, and any other amount that the person would be required to pay under Article 28, if the person loses the appeal, be placed in a refundable account or surety prior to issuing the certificate of occupancy.\nThe requirements of the plan have not been completed and the building for which a certificate of occupancy is requested is the only building then under construction.\nIn the instance of multiple buildings on a single parcel, the requirements of the plan have not been completed and the building for which a certificate of occupancy is requested is the last building then under construction.\nOn a tract which includes multiple parcels created pursuant to the applicable subdivision regulations, the requirements of the plan have not been completed with respect to the parcel for which the certificate of occupancy is requested.\n\n\n\n\nG. Storm Drainage Violations and Enforcement – Additional Regulations (Article 24)This section supplements Section 39.2.A.\nViolations\n\nFailure to comply with an applicable requirement, prohibition, standard, or limitation imposed by Article 24 or the terms or conditions of any permit or other development or redevelopment approval or authorization granted pursuant to Article 24, is unlawful and shall constitute a violation of Article 24.\nAny person who erects, constructs, reconstructs, alters (whether actively or passively), or fails to erect, construct, reconstruct, alter, repair, or maintain any structure, practice, or condition in violation of Article 24 shall be subject to the remedies, penalties, and/or enforcement actions in accordance in this section. For the purposes of Articles 24 and 39, responsible person(s) shall include but not be limited to:\n\nAny person who participates in, assists, directs, creates, causes, or maintains a condition that constitutes a violation of Article 24, or fails to take appropriate action, so that a violation of Article 24 results or persists.\nThe owner of the land on which the violation occurs, any tenant or occupant of the property, any person who is responsible for stormwater controls or practices pursuant to a private agreement or public document, or any person, who has control over, or responsibility for, the use, development, or redevelopment of the property.\n\n\n\n\nNotice of Violation and Order to CorrectIf, through inspection and/or investigation, it is found that any building, structure, or land is in violation of Article 24, the Stormwater Administrator may issue a written notice of violation to the responsible person/entity, in accordance with Section 39.2.A.1.  The notice shall, if required, specify a date by which the responsible person/entity shall comply with Article 24, and advise that they are subject to remedies and/or penalties or that failure to correct the violation within the time specified will subject the responsible person/entity to remedies and/or penalties as described in this section. In determining the measures required and the time for achieving compliance, the Stormwater Administrator shall take into consideration the technology and quantity of work required, and shall set reasonable and attainable time limits. If a violation is not corrected within a reasonable period of time, as provided in the notification, the Stormwater Administrator may take appropriate action to correct and abate the violation and to ensure compliance with Article 24.\nExtension of TimeA responsible person/entity who receives a notice of violation and correction order, or the owner of the land on which the violation occurs, may submit to the Stormwater Administrator a written request for an extension of time for correction of the violation. Upon determining that the request includes enough information to show that the violation cannot be corrected within the specified time limit for reasons beyond the control of the responsible person/entity requesting the extension, the Stormwater Administrator may extend the time limit as is reasonably necessary to allow timely correction of the violation, up to, but not exceeding 60 days. The Stormwater Administrator may grant 30-day extensions in addition to the foregoing extension if the violation cannot be corrected within the permitted time due to circumstances beyond the control of the responsible person/entity violating this Ordinance. The Stormwater Administrator may grant an extension only by written notice of extension. The notice of extension shall state the date prior to which correction shall be made, after which the violator will be subject to the penalties described in the notice of violation and correction order.\nEmergency EnforcementIf a violation seriously threatens the effective enforcement of Article 24 or poses an immediate danger to the public health, safety, or welfare or the environment, the Stormwater Administrator may order the immediate cessation of a violation. Any person so ordered shall cease any violation immediately. The Stormwater Administrator may seek immediate enforcement, without prior written notice, through any remedy or penalty specified in this section and Section 39.2.A.2 (Stop Work Orders) and Section 39.2.A.3 (Injunctions and Orders of Abatement).\nRemedies and Penalties\n\nCivil PenaltiesAny person who violates any of the provisions of Article 24 or rules or other orders adopted or issued pursuant to Article 24 may be subject to a civil penalty. A civil penalty may be assessed from the date the violation occurs. The Stormwater Administrator shall determine the amount of the civil penalty and shall notify the violator of the amount of the penalty and the reason for assessing the penalty. No penalty shall be assessed until the person alleged to be in violation has been notified of the violation except as provided in this section in which case the penalty is assessed concurrently with a notice of violation. Refusal to accept the notice or failure to notify the Stormwater Administrator of a change of address shall not relieve the violator’s obligation to comply with Article 24 or to pay such a penalty.\nEach Day a Separate OffenseEach day that a violation continues shall constitute a separate and distinct violation or offense.\nPenalties Assessed Concurrent with Notice of ViolationPenalties may be assessed concurrently with a notice of violation for any of the following, in which case the notice of violation shall also contain a statement of the civil penalties to be assessed, the time of their accrual, and the time within which they shall be paid or be subject to collection in the nature of a debt:\n\nFailure to submit a Storm Drainage Plan.\nPerforming activities regulated by Article 24 without an approved Storm Drainage Plan.\nObstructing, hampering, or interfering with an authorized representative who is in the process of carrying out official duties.\nA repeated violation for which a notice was previously given on the same project and to the same responsible person/entity responsible for the violation.\nWillful violation of Article 24.\nFailure to install or maintain storm drainage per the approved plan.\n\n\nAmount of PenaltyThe civil penalty for each violation of Article 24 may be up to the maximum allowed by law, and in accordance with the Stormwater Regulations Administrative Manual. In determining the amount of the civil penalty, the Stormwater Administrator shall consider any relevant mitigating and aggravating factors including, but not limited to\n\nThe effect, if any, of the violation.\nThe degree and extent of harm caused by the violation.\nThe cost of rectifying the damage.\nWhether the violator saved money through noncompliance.\nWhether the violator took reasonable measures to comply with Article 24.\nWhether the violation was committed willfully.\nWhether the violator reported the violation to the Stormwater Administrator.\nThe prior record of the violator in complying or failing to comply with Article 24 or any other erosion and sedimentation control regulations or law.\n\n\nFailure to Pay Civil Penalty AssessmentIf a violator does not pay a civil penalty assessed by the Stormwater Administrator within 30 days after it is due or does not request an appeal hearing in accordance with Section 37.8.B, the Stormwater Administrator shall request the City Attorney to initiate a civil action to recover the amount of the assessment. The civil action shall be brought in Mecklenburg County Superior Court or in any other court of competent jurisdiction. A civil action shall be filed within three years of the date the assessment was due. An assessment that is appealed is due at the conclusion of the administrative and judicial review of the assessment.\nAppeal of Remedy or PenaltyThe issuance of an order of restoration and/or notice of assessment of a civil penalty by the Stormwater Administrator may be appealed by the responsible party or entity before the UDO Board of Adjustment if a written request for an appeal hearing is submitted to the clerk of the UDO Board of Adjustment within 30 days of the receipt of an order of restoration and/or notice of assessment of a civil penalty. The appeal of an order of restoration and/or notice of assessment of a civil penalty shall be initiated and conducted as described in Section 37.8.B.\nAdditional Remedies\n\nWithholding of Certificate of OccupancyThe Stormwater Administrator or other authorized agent may refuse to issue a certificate of occupancy for the building or other improvements constructed or being constructed on the site and served by the stormwater practices in question until the applicant or other responsible person has taken the remedial measures set forth in the notice of violation or has otherwise cured the violations described therein.\nDisapproval of Subsequent Permits and Plan ApprovalsAs long as a violation of Article 24 continues and remains uncorrected, the Stormwater Administrator or other authorized agent may withhold, and the Stormwater Administrator may disapprove, any request for permit or plan approval or authorization provided for by Article 24 or other regulations of the City, as appropriate for the site on which the violation occurs.\nInjunction, Abatements, Etc.The Stormwater Administrator, with the written authorization of the City Manager, may authorize the City Attorney to institute a civil action in the name of the City in a court of competent jurisdiction for a mandatory or prohibitory injunction and order of abatement requiring the correction of a violation of Article 24. Any person violating Article 24 shall be subject to the full range of equitable remedies provided in the North Carolina General Statutes or common law.\nCorrection as Public Health Nuisance, Costs as Lien, Etc.If the violation is deemed dangerous or prejudicial to the public health or public safety and is within the geographic limits prescribed by N.C.G.S. § 160A-193, the Stormwater Administrator, with the written authorization of the City Manager, may request the City Council to cause the violation to be corrected upon a finding that the violation is dangerous or prejudicial to public health or safety, and the costs of the action shall be paid by the person in default.  If the expense is not paid, it is a lien against the property.\nRestoration of Areas Affected by Failure to ComplyBy issuance of an order of restoration, the Stormwater Administrator may require a person who engaged in a land-disturbing activity and failed to comply with Article 24 to restore the waters and land affected by such failure so as to minimize the detrimental effects. This authority is in addition to any other civil penalty or injunctive relief authorized in Article 24.\n\n\n\n\nH. Subdivision, Streets, and Other Infrastructure Violations and Enforcement – Additional Regulations (Articles 29 through 34)This section supplements Section 39.2.A\nSubdivision Plats -ViolationA plat of a subdivision filed or recorded in the Office of the Register of Deeds of the County without the approval of the Planning Department, will be considered null and void.\nSubdivision Penalties\n\nInjunctionThe City, through the City Attorney, or Mecklenburg County, through the County Attorney, may bring an action for injunction of any illegal subdivision, transfer, conveyance, or sale of land by reference to, exhibition of, or any other use of a plat showing a subdivision of the land before the plat has been properly approved. The court shall, upon appropriate findings, issue an injunction and order requiring the offending party to comply with the subdivision regulations.  All administrative actions and activities relating to such land, including the issuance of any grading, construction, building or occupancy permit, shall be suspended. This section will not affect the sale or transfer of any land, a plat of which was recorded prior to January 1, 1966, for Mecklenburg County and February 29, 1956, for the City of Charlotte.\nCivil PenaltyAny person who fails to install or maintain the required stormwater control measure (SCM) in accordance with this article shall be subject to a civil penalty of not more than $500. No penalties shall be assessed until the person alleged to be in violation has been provided a notice of violation in accordance with 39.2.A.1. The notice shall describe the violation with reasonable particularity, specify a reasonable time period within which the violation shall be corrected, and warn that failure to correct the violation within the time period will result in the assessment of a civil penalty or other enforcement action. Each day that the violation continues shall constitute a separate violation.\nOther RemediesIn addition to other remedies, the City may institute any appropriate action or proceedings to prevent the unlawful subdivision of land, to restrain, correct, or abate the violation, or to prevent any illegal act or conduct. Building permits may be denied for lots that have been illegally subdivided. pursuant to N.C.G.S. 160D-1110.\n\n\nStreets and Other Infrastructure Violations and Penalties\n\nEnforcementThe streets and other infrastructure regulations in Articles 29 through 34 may be enforced by any one, all, or a combination of the penalties and remedies authorized and prescribed in Section 39.2.A.1 If a person continues to fail to comply with a particular provision of the regulations after the imposition of any one type of penalty, the person shall continue to remain subject to the remedies prescribed in this section for the continued violation of the particular provision of these regulations.\nCitations and Penalties\n\nThe Subdivision, Streets, and Infrastructure Administrator may issue written citations to any person if there is a reasonable cause to believe that the person has violated any provision of the streets and other infrastructure regulations in Articles 30 through 34, in accordance with Section 39.2.A.1. A violator shall be deemed to be the owner of the premises, the agent of the owner authorized to be responsible for the premises, or the holder of the development approval. Citations may be directly issued or delivered to the occupant, lessee, or person having immediate beneficial use of the property, or the holder of the development approval. If the violator cannot be readily found, then the citation may be mailed to the last known mailing address as shown in the Mecklenburg County tax abstract, or by making other reasonable efforts to communicate the existence of the violation, in accordance with Section 39.2.A.1.\nThe initial citation for each violation shall be $50. The issuance of a second citation for any violation that has not been corrected shall be in an amount up to $200 for the first and second citation, up to $500 for the third citation, and up to $500 thereafter. Any unpaid citations and delinquency charges shall be cumulative and shall subject the violator to a possible civil penalty to be recovered in a civil action in the nature of debt.\n The citation shall direct the violator to make payment to the City of Charlotte within 15 days of the date of the citation, or alternatively pay the citation by mail. If the violator does not make such payment or does not mail the citation and payment within 15 days of the issuance, a delinquency charge of $10 shall be added to the amount shown on the citation. The citation shall inform the violator that a civil complaint may be filed if the citation and delinquency charge is not paid within 15 days from the date of delinquency. Further, the citation shall state that the violation is a continuing violation and additional citations may be issued with escalating amounts for a continuing violation.\n\n\n\n\nI. Surface Water Improvement and Management (SWIM) Buffers Violations and Enforcement – Additional Regulations (Article 26)This section supplements Section 39.2.A.\nNotice of Violation and Civil Penalties\n\nThe civil penalty for each violation of Article 26 may be up to the maximum allowed by law, and in accordance with the Stormwater Regulations Administrative Manual. In determining the amount of the civil penalty, the Stormwater Administrator shall consider any relevant mitigating and aggravating factors including, but not limited to:\n\nThe effect, if any, of the violation.\nThe degree and extent of harm caused by the violation.\nThe cost of rectifying the damage.\nWhether the violator saved money through noncompliance.\nWhether the violator took reasonable measures to comply with Article 26.\nWhether the violation was committed willfully.\nWhether the violator reported the violation to the Stormwater Administrator.\nThe prior record of the violator in complying or failing to comply with Article 26 or any other erosion and sedimentation control regulations or law.\n\n\nEach day that the violation continues shall constitute a separate violation. No penalties shall be assessed until the person alleged to be in violation has been issued a written notice of violation, in in accordance with Section 39.2.A.1.\n\n\nJ. Tree Protection Violations and Enforcement – Additional Regulations (Article 20, Sections 20.12 through 20.18)This section supplements Section 39.2.A.\nNotice of Violation\n\nIf, through inspection, it is determined that a property owner or person in control of the land has violated an applicable development approval, the tree regulations, rules or orders issued pursuant to Article 20, Sections 20.12 through 20.18 , the Chief Urban Forester may issue a written notice of violation in accordance with Section 39.2.A.1. The notice shall also inform the person whether a civil penalty shall be assessed and shall specify a date by which the person shall comply with this Ordinance. The notice shall advise that failure to correct the violation within the time specified will subject that person to the civil penalties as provided in Section 39.2.J.2 below or any other authorized enforcement action.\n\n\nCivil Penalties\n\nCivil penalties for violations of the tree regulations in Article 20, Sections 20.12 through 20.18, shall be assessed pursuant to the following:\n\nFailure to provide approved tree as-built plans within the time frame specified may result in assessment of penalties not to exceed $1,000.\nFailure to plant original or replacement trees in accordance with Article 20 shall be $50 for each tree not planted. No civil penalty shall be assessed until the person alleged to be in violation has been notified of the violation as provided in Section 39.2.A.1. If the site is not brought into compliance within the time specified in the notice of violation, a civil penalty may be assessed from the date the notice of violation is received. The failure to plant each individual tree shall constitute a separate, daily, and continuing violation.\nInjury or damage to, or destruction of, trees and shrubs protected by Article 20, Sections 20.12 through 20.18, that result in the total loss of the tree or shrub shall be assessed in accordance with the tree evaluation formula or other generally accepted industry evaluation methods. However, the maximum civil penalty for each tree injured, damaged, or destroyed shall not exceed $20,000. No notice of violation is needed prior to the assessment of a civil penalty issued pursuant to this subsection\nInjury or damage to, or destruction of, trees and shrubs protected by Article 20, Sections 20.12 through 20.18, that do not result in the total loss of the trees shall be assessed for each tree or shrub in accordance with the tree evaluation formula or other generally accepted industry evaluation methods. However, the maximum amount of the penalty shall not exceed $1,000. No notice of violation is needed prior to the assessment of a civil penalty issued pursuant to this subsection.\nFailure to install or maintain required tree protection measures in accordance with Article 20, Sections 20.13 through 20.18, shall be a penalty of $1,000. No civil penalty shall be assessed until the person has been issued a notice of violation by the Chief Urban Forester, as provided in Section 39.2.A.1. If the site is not brought into compliance within the time specified in the notice of violation, a civil penalty may be assessed from the date the notice of violation is received. The failure to install the required tree protection measures shall constitute a separate, daily, and continuing violation. Injury or damage to, or destruction of, trees in the tree protection zone and tree save area and/or green area resulting from inadequate or omitted tree protection measures constitutes a separate violation which may subject the violator to any other applicable penalty set forth in this section.\nAny other action that constitutes a violation of Article 20, Sections 20.12 through 20.18, may subject the violator to a civil penalty of $50, and each day of continuing violation shall constitute a separate violation. However, the maximum amount of the penalty shall not exceed $1,000.\n\n\nPenalties assessed are in addition to, and not in lieu of, compliance with the requirements of Section Article 20, Sections 20.12 through 20.18.\nA nonmonetary penalty, in the form of increased or additional planting requirements, may be assessed in addition to or in lieu of any monetary penalties prescribed under this section. Civil penalties collected pursuant to Sections 20.13 through 20.18 shall be credited to the general fund as a nontax revenue and shall be used to further the purposes, intent, enforcement and requirements of Sections 20.13 through 20.18. The Charlotte Tree Advisory Commission shall be consulted with regard to use of collected funds.\n\n\nNoticeThe City Chief Urban Forester shall determine the amount of the civil penalty, in accordance with Section 39.2.J.2 for any violations of Article 20, Sections 20.12 through 20.18, and shall notify the responsible person of the amount of the penalty and the reason for assessing the penalty. The notice of violation shall be provided in accordance with Section 39.2.A.1The notice of assessment shall direct the violator to either pay the assessment or file an appeal in accordance with Section 37.8.B. If payment of assessed penalties is not received within 30 days after it is due, or if no request for an appeal hearing has been made in accordance with Section 37.8.B, the assessment shall be considered a debt due and owed to the City, and the matter shall be referred to the City Attorney for institution of a civil action to recover the amount of the debt. The civil action may be brought in the Mecklenburg County Superior Court or in any other court of competent jurisdiction.\nCivil Action for Unpaid AssessmentIf payment of assessed penalties if not received within 30 days after it is due, or if no request for an appeal hearing has been made in accordance with Section 37.8.B, the assessment shall be considered a debt due and owned to the City, and the matter shall be referred to the City Attorney for institution of a civil action to recover the amount of the debt.  A civil action shall be filed within three years of the date the assessment was due. An assessment that is not appealed is due when the violator is served with a notice of assessment. An assessment that is appealed is due at the conclusion of the administrative and judicial review of the assessment.\nInjunctive ReliefSee Section 39.2.A.3 for procedures related to injunctive relief.\n\nUpon determination of a court that an alleged violation is occurring or is threatened, the court shall enter such orders or judgments as are necessary to abate the violation. The institution of an action for injunctive relief under this section shall not relieve any party to such proceedings from any civil penalty prescribed for a violation of Article 20, Sections 20.12 through 20.18.\n\n\nOrder to Take Corrective Action\n\nIf the owner or occupant of a property does not perform the duties set out Sections 20.14, 20.15.J, 20.16.D, and 20.17.B.8 of this Ordinance and Chapter 21 of the Code of Ordinances, the City may order the pruning, removal, or treatment of trees on private property that cause obstructions, present insect, or disease problems, or otherwise present a danger to public health, safety, or welfare. The order shall be in writing and provided by personal delivery, email or first-class mail to the property owner or occupant responsible for such condition and shall be acted upon within 30 days from the time of the receipt of the order. Orders provided by first-class mail are deemed received on the third business day following deposit of the order for mailing with the U.S. Postal Service. The staff person, or person providing the order shall certify to the City that the order was delivered and that certificate shall be deemed conclusive in the absence of fraud.\nIf, after 30 days, the owner or occupant has not responded or acted to prune, remove, or treat the trees, the City shall have the authority to enter upon the property to perform the work necessary to correct the condition and bill the owner or occupant for the actual costs incurred. In situations deemed critical to the public health, safety, or welfare, the City may act without prior notification to the property owner or occupant.\n\n\nK. Water Supply Watersheds – Additional Regulations (Article 23)\nNotice of Violation and Civil Penalties\n\nIf the Stormwater Administrator determines that a person/entity violated the water supply watershed regulations in Article 23, they may issue a written notice of violation to the person/entity in violation, in accordance with 39.2.A.1. The notice shall, if required, specify a date by which the violator shall comply with Article 23, and advise that they are subject to remedies and/or penalties or that failure to correct the violation within the time specified will subject them to remedies or penalties as described in Article 39.\nAny person who fails to install or maintain the required stormwater control measure (SCM) in accordance with Article 23 shall be subject to a civil penalty of not more than $500. No penalties shall be assessed until the person alleged to be in violation has been provided a notice of violation in accordance with Section 39.2.A.1. The notice shall describe the violation with reasonable particularity, specify a reasonable time period within which the violation shall be corrected, and warn that failure to correct the violation within the time period will result in the assessment of a civil penalty or other enforcement action. Each day that the violation continues shall constitute a separate violation.\nThe civil penalty for other and each violation of Article 23 may be up the maximum allowed by law, and in accordance with the Stormwater Regulations Administrative Manual. In determining the amount of the civil penalty, the Stormwater Administrator shall consider any relevant mitigating and aggravating factors including, but not limited to;\n\nThe effect, if any, of the violation.\nThe degree and extent of harm caused by the violation.\nThe cost of rectifying the damage.\nWhether the violator saved money through noncompliance.\nWhether the violator took reasonable measures to comply with Article 23.\nWhether the violation was committed willfully.\nWhether the violator reported the violation to the Stormwater Administrator.\nThe prior record of the violator in complying or failing to comply with Article 23 or any other erosion and sedimentation control regulations or law.\n\n\nRe-Vegetation of Disturbed Water Quality Buffers RequiredShould existing vegetation within the water quality buffer in all watersheds be disturbed except as allowed by Article 23, or should vegetation, which was added to a water quality buffer pursuant to the requirement that existing vegetation in the water quality buffer be enhanced, be disturbed except as allowed by Article 23, Charlotte-Mecklenburg Storm Water Services shall require that any vegetation remaining in the water quality buffer be enhanced in accordance with the most recent version of the “Charlotte-Mecklenburg Water Quality Buffer Implementation Guidelines” so that the buffer can effectively perform its intended functions.\n\n\nL. Zoning Violations and Enforcement – Additional Regulations (Articles 3 through 22)This section supplements Section 39.2.A.\nEnforcement\n\nThe zoning regulations in Articles 3 through 22 may be enforced by any one, all, or a combination of the penalties and remedies authorized and prescribed in Section 39.2.A.  If a person continues to fail to comply with a particular provision of the zoning regulations after the imposition of any one type of penalty, the person shall continue to remain subject to the remedies prescribed in this section for the continued violation of the particular provision of these regulations.\nThe Zoning Administrator shall have the power to impose fines and penalties for violations of the zoning regulations, and may withhold approval for building permits, certificates of occupancy, and certificates of compliance and secure injunctions and abatement orders to further ensure compliance with the zoning regulations. Each day’s continuing violation shall be a separate and distinct offense and may be subject to any one, all, or a combination of the remedies authorized and prescribed in Section 39.2.A and in this section.\n\n\nNotices of ViolationsUpon recognition of a zoning violation, the Zoning Administrator may issue a notice of violation of the zoning regulations, in accordance with Section 39.2.A.1.\nCitations and Penalties\n\nThe Zoning Administrator is authorized to issue written citations to any person if there is a reasonable cause to believe that the person has violated any provision of the zoning regulations in Articles 3 through 22, A violator shall be deemed to be the owner of the premises, the agent of the owner authorized to be responsible for the premises, the occupant of the premises, or holder of the development approval. Citations may be directly issued or delivered to the occupant, lessee, or person having immediate beneficial use of the property, or the holder of the development approval. If the violator cannot be readily found, then the citation may be mailed. to the last known mailing address as shown in the Mecklenburg County tax abstract, or by making other reasonable efforts to communicate the existence of the violation to the owner, agent, or occupant, in accordance with Section 39.2.A.1.\nThe initial citation for each violation shall be $50. The issuance of a second citation for any violation that has not been corrected shall be in an amount up to $200 for the first and second citation, up to $500 for the third citation, and up to $500 thereafter. Any unpaid citations and delinquency charges shall be cumulative and shall subject the violator to a possible civil penalty to be recovered in a civil action in the nature of debt.\nThe citation shall direct the violator to make payment to the City of Charlotte within 15 days of the date of the citation, or alternatively pay the citation by mail. If the violator does not make such payment or does not mail the citation and payment within 15 days of the issuance, a delinquency charge of $10 shall be added to the amount shown on the citation. The citation shall inform the violator that a civil complaint may be filed if the citation and delinquency charge is not paid within 15 days from the date of delinquency. Further, the citation shall state that the violation is a continuing violation and additional citations may be issued with escalating amounts for a continuing violation.\n\n\nCivil Judicial Remedies\n\nThe City may institute any appropriate action or proceedings to prevent any erection, construction, reconstruction, alteration, repair, conversion, maintenance, or use, that is in violation of zoning and City regulations in order to restrain, correct or abate the violation, to prevent occupancy of the building, structure, or land, or to prevent any illegal act, conduct, business or use in or about the premises. The General Court of Justice shall have jurisdiction to issue such orders as may be appropriate.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-39-enforcement/#392-enforcement\"}"}]}