{"title": "Article 20. Landscaping, Screening, & Tree Protection", "metadataJson": "{\"base_url\": \"article-20-landscaping-screening-tree-protecton\"}", "section": [{"title": "20.1 LANDSCAPING AND SCREENING PURPOSE", "text": "The landscape and screening requirements established by this Article are intended to:\nPreserve and enhance the appearance and character of the City.\nIncrease the compatibility of adjacent uses and minimize the potential negative impacts to neighboring uses.\nCreate transitional areas between uses or zoning districts of different intensities.\n", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#201-landscaping-and-screening-purpose\"}"}, {"title": "20.2 SELECTION, INSTALLATION, AND MAINTENANCE", "text": "The following standards apply to the landscape areas per Section 20.5 through 20.12 of this Article.A. Selection\n\n\nOnly shrubs and trees listed on the Approved Plant Species list in the Charlotte Land Development Standards Manual (CLDSM) shall be used for any landscaping required by this Article.\nAll plants shall meet minimum quality requirements and be free of defects, and of normal health, height, leaf density, and spread as defined by the American Standard for Nursery Stock, ANSI Z60.1, latest available edition, American Horticulture Industry Association (AmericanHort).\n\n\nB. InstallationAll landscaping shall be installed according to sound horticultural practices in a manner designed to encourage quick establishment and healthy growth, and consistent with the CLDSM.C. Species DiversityDiversity among required plant material is required for visual interest and to reduce the risk of losing a large population of plants due to disease.\n\n\nThe species diversity requirements of this section apply as follows:\n\nSpecies diversity applies to landscape plantings required by Section 20.2 through 20.12 of this Article.\nSpecies diversity only applies to the installation of new plantings.\n\n\nTable 20-1: Plant Diversity Requirements indicates the percentage of diversity required based on the total quantity of species being used. (For example, if a development requires 45 shade trees, no more than 18 trees (40%) can be of any one species, and there shall be a minimum of five different species within the 45 trees.)\n\n\nD. Maintenance\n\n\nTrees and vegetation, irrigation systems, fences, walls, and other similar items are considered landscape elements of a development.\nAll landscaping shall be free from disease, pests, weeds, and litter. All landscape elements shall be maintained in good repair or replaced periodically as needed to ensure their continued function, structural soundness, and aesthetically pleasing condition.\nAny landscape element that dies or is seriously damaged, shall be removed and replaced within 30 days of the beginning of the subsequent growing season.\nAny ornamental grasses or shrubs planted next to sidewalks shall be planted and maintained so that they do not encroach into sidewalks at maturity.\n\n\nE. Existing PlantingsExisting plantings within the required landscape areas, such as the landscape yard, may be counted toward planting requirements of this Article, with the exception of trees planted pursuant to green area requirements per Section 20.15, frontage tree planting requirements per Section 20.16, and tree planting requirements per Section 20.17, with the approval of the Zoning Administrator in consultation with the Chief Urban Forester.F. Additional Trees and ShrubsAdditional trees and shrubs may be installed in required landscape areas in excess of the requirements of this Article.", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#202-selection,-installation,-and-maintenance\"}"}, {"title": "20.3 LANDSCAPE PLANTINGS", "text": "The following are the planting sizes required for each landscape area per Section 20.5 through 20.12 of this Article. All trees shall be allowed to grow to natural form and height.A. Plantings Sizes for Parking Lot ScreeningShrubs shall be evergreen and shall be at least two feet in height when planted and an average height of three to four feet expected as normal growth within four years. A minimum spread of two feet shall be required at time of planting. However, such shrubs shall not exceed four feet in height at maturity.B. Planting Sizes for Parking Structure Landscape Area\n\n\nAll trees, except for multiple stem small maturing trees, shall have a minimum trunk caliper of two inches and a minimum height of eight feet at planting.\nMultiple stem small maturing trees shall be tree form, with three to a maximum of five trunks, and shall have a minimum height of ten feet at planting.\nShrubs shall be evergreen and shall be at least two feet in height when planted and an average height of five to six feet expected as normal growth within four years. A minimum spread of two feet shall be required at time of planting. Such shrubs shall be a minimum of six feet in height at maturity.\n\n\nC. Planting Sizes for Landscape Yard\n\n\nAll trees, except for multiple stem small maturing trees, shall have a minimum trunk caliper of two inches and a minimum height of eight feet at planting.\nMultiple stem small maturing trees shall be tree form, with three to a maximum of five trunks, and shall have a minimum height of ten feet at planting.\nShrubs shall be evergreen and shall be at least two feet in height when planted and an average height of five to six feet expected as normal growth within four years. A minimum spread of two feet shall be required at time of planting. Such shrubs shall be a minimum of six feet in height at maturity.\n\n\n‍", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#203-landscape-plantings\"}"}, {"title": "20.4 ALTERNATIVE LANDSCAPE REQUIREMENTS", "text": "\nThe Zoning Administrator may alter the screening, landscape area, or landscape yards requirements of Section 20.1through 20.12 of this Article in the event that one or more of the following conditions would make strict adherence to the requirements serve no meaningful purpose or would make it physically impossible to install and maintain the required landscape yard or screening:\n\nThe unusual topography or elevation of a development site.\nThe soil or other sub-surface conditions on the site.\n\n\nSuch an alteration may occur only at the request of the property owner, who shall submit:\n\nA written request for modification describing the required and proposed landscape or screening.\nA plan showing existing site features that would provide alternative landscaping or screening of the proposed use.\nA plan showing the type and location of any additional landscape elements the property owner will plant or construct that would provide alternative landscaping or screening of the proposed use.\n\n\nThe Zoning Administrator shall not alter the screening, landscape area, or landscape yard requirements of Section 20.1 through 20.12 of this Article unless the developer demonstrates that the modified landscape yard or screening will comply with the spirit and intent of this Article and that the existing site features and any additional landscape yard materials will screen the proposed use as effectively as the required landscape yard or screening.\n", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#204-alternative-landscape-requirements\"}"}, {"title": "20.5 REQUIRED SCREENING FOR PARKING LOTS", "text": "A. General RequirementsScreening for parking lots and associated maneuvering areas is required for parking lots of ten or more vehicle spaces at the edge of the parking lot.\n\n\nThe following exceptions apply:\n\nWhen parking areas are shared between properties, parking lot screening is not required along any shared lot line and/or cross-access connection area.\nWhen parking lot screening is required between abutting properties and a landscape yard per Section 20.9 is also required, the requirements of the landscape yard control.\nVehicle dealerships are not required to install parking lot screening in those areas of the parking lot used to display vehicles for sale along a street frontage.\nParking lot screening is not required if the Zoning Administrator determines that adherence to this requirement would serve no meaningful purpose including, but not limited to, the grade on the site and the distance of the parking lot to adjacent properties.\n\n\nParking lot screening shall be installed when:\n\nA new principal building is constructed.\nA new parking lot of ten or more spaces is constructed.\nSpaces are added to an existing parking lot where the total of existing and new spaces is ten or more spaces.\nAt least 50% of the parking lot area is reconstructed. Resealing, repaving, resurfacing, and/or re-striping of an existing parking lot are not considered reconstruction.\n\n\n\n\nB. Design of Screening AreasThe screening area shall be improved as follows:\n\n\nThe screening area shall be at least five feet in width.\nThere shall be an additional minimum linear distance of two feet between the screening area and any wheel stops or bollards to accommodate vehicle bumper overhang. This is not included in the minimum five foot calculation.\nThe parking lot screening area shall be landscaped and designed as one or more of the following installations. Any required tree planting shall comply with the tree planting requirements of Sections 20.16 and 20.17 below, where applicable.\n\nOne shrub shall be planted for every five linear feet of screening area length. However, shrubs shall not be planted within four feet of a tree.\nAs an alternate to the shrub plantings in item a above, for screening along a frontage a low pedestrian wall a minimum of three feet and a maximum of four feet in height constructed of masonry, concrete, or similar permanent material may be installed. In this alternative, the parking lot screening area may be reduced to three feet in width. The requirements of item 2 above shall also apply to this alternative.\n\nShrubs, groundcover, perennials, ornamental grasses, and other planting types of species native or naturalized non-invasive to North Carolina shall be planted in front of such wall, facing toward frontages or adjacent properties, covering a minimum of 40% of the total screening area.\nUp to 30% of the total length of such wall may be designed as a seating wall. Where seating areas are included, the minimum wall height does not apply and plantings are not required in front of the seating wall. Seating areas shall be oriented towards the frontage.\n\n\n\n\nThe following may cover any remaining unplanted area:\n\nShrubs, groundcover, perennials, ornamental grasses, and other planting types of species native or naturalized non-invasive to North Carolina.\nStone, mulch, or other permeable landscape materials.\n\n\n\n\n‍PARKING LOT SCREENING", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#205-required-screening-for-parking-lots\"}"}, {"title": "20.6 PARKING LOT INTERIOR LANDSCAPE", "text": "Interior parking lot landscaping is governed by Section 20.17 below.", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#206-parking-lot-interior-landscape\"}"}, {"title": "20.7 PARKING FACILITY DRIVEWAY AND MANEUVERING AREA LANDSCAPE", "text": "\nThe parking lot screening requirements of Section 20.5 shall apply to all driveway and maneuvering areas that are not adjacent to parking spaces for parking lots of ten or more spaces and for all driveway and maneuvering areas of parking structures.\nWhen such driveway and maneuvering areas described in item A above are located within an established side or rear setback along an adjacent property line, a fence or wall a minimum of six feet to a maximum of eight feet may be used in place of the screening area except within the established setback along a frontage.\n", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#207-parking-facility-driveway-and-maneuvering-area-landscape\"}"}, {"title": "20.8 PARKING STRUCTURE LANDSCAPE AREA", "text": "As required in Section 19.7 for the design of parking structures, when a landscape area is required, it shall be planted as follows:\nOne shrub shall be planted for every five linear feet of perimeter area. Shrubs may be varied in placement, rather than linearly spaced, but the total number of shrubs planted shall equal one shrub per five linear feet. However, shrubs shall not be planted within four feet of a tree.\nA minimum of one large or medium maturing tree shall be provided for every 30 linear feet of the landscape area. Two small maturing trees may be substituted for one large or medium maturing tree. Trees may be spaced linearly on-center or grouped to complement an overall design concept.\nThe remainder of the required landscape area outside of shrub and tree masses shall be planted in groundcover, turf, perennials, ornamental grasses, and other planting types of species native or naturalized non-invasive to North Carolina.\n‍PARKING STRUCTURE LANDSCAPE AREA‍", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#208-parking-structure-landscape-area\"}"}, {"title": "20.9 LANDSCAPE YARD", "text": "\nCertain uses or zoning districts, because of their character and/or intensity, may create adverse impacts when developed abutting other less intensive uses or zoning districts. A landscape yard provides a transition between these uses and/or zoning districts that minimizes adverse impacts.\nWhen a landscape yard is required by this section, and a site does not have a landscape yard or the existing landscape yard on the site does not meet the standards of this section, a landscape yard shall be installed when any of the following actions occur:\n\nNew construction of a principal building.\nAn addition to an existing principal building.\nAn additional principal or accessory use that is conducted primarily outdoors is established on the site.\nA change of use category within the Use Matrix found in Article 15 when abutting a Neighborhood 1 Place Type.\n\n\nUpon an applicant’s request, if the Zoning Administrator determines that the requirement for a landscape yard is unrelated to the proposed construction’s anticipated impacts on adjacent properties, the Zoning Administrator may modify the landscape yard requirement to the extent necessary to relate to the proposed construction’s anticipated impacts and to make the requirement roughly proportional to those anticipated impacts.\nWhen a landscape yard is required by item B above and there is insufficient area on the site for the required landscape yard, such landscape yard may be modified to install only a portion of the required landscape. The applicant is required to show that the landscape yard cannot be accommodated on the site. The Zoning Administrator will make the determination that a portion of required landscape yard does not have to be installed.\nTable 20-2: Landscape Yard Class describes the width and design of each class of landscape yard. Table 20-3: Required Landscape Yards by Zoning District indicates when and which class of landscape yard is required. Where a use has prescribed conditions that require a specific class of landscape yard, those conditions control over the requirements of Table 20-3.\n\nFor the Class A landscape yard, the landscape yard is divided into Zone 1 and Zone 2 as follows:\n\nZone 1 comprises the first 25 feet of the landscape yard, measured perpendicularly from the rear or side lot line.\nZone 2 comprises the remainder of the required landscape yard outside of Zone 1. Within Zone 2, plantings may be grouped to complement an overall design concept. The remainder of the required landscape area in Zone 2 outside of required shrub and tree masses shall be planted in turf, groundcover, perennials, ornamental grasses, and other planting types of species native or naturalized non-invasive species to North Carolina.\n\n\n\n\nCLASS A LANDSCAPE YARD: ZONE 1/ZONE 2\nLandscape yards as required by Table 20-3 shall be located within the established rear setback and within the established side setback but behind the required front setback. The following also apply:\n\nIn certain circumstances in Table 20-3, landscape yards may be specifically required for other setback areas outside the side or rear setback.\nFor a nonresidential use that requires a landscape yard in a side setback because it abuts an existing residential use, and where the front building line of the residential use is located closer to the back of curb, the side setback landscape yard shall be extended to meet the front building line of the residential structure.\n\n\nLOCATION OF LANDSCAPE YARDSLANDSCAPE YARD WITH SIDE SETBACK EXTENSION\nLandscape yards may be located within established setbacks and shall be reserved for the planting of material and installation of screening as required by this section unless other features are allowed by item I below. No parking, principal or accessory structures, outdoor storage, or required on-site open space, shall be located in the landscape yard area.\nWhen a fence or wall is installed, it shall be a minimum of 75% opaque, constructed of wood posts and planks, brick, finished masonry, or stone, and erected within 18 inches of the lot line along 100% of the landscape yard length with the exception of ingress/egress points. The finished side of the fence, as opposed to the side with exposed structural supports, shall face the abutting property.\nThe following shall also be permitted within a landscape yard:\n\nSidewalks and paths no greater than six feet in width designed perpendicular (90 degrees) or to an angle no less than 75 degrees to the landscape yard. A required off-street trail connection shall be permitted to exceed this six-foot dimension but shall be no wider than the rest of the trail on the site.\nWithin Zone 2 of the Class A landscape yard, limited amenities, not associated with any required on-site open space on the site, such as seating areas, walking paths, and picnic tables for the use of the on-site users.\nUtility lines per item J below.\nStormwater facilities per item K below.\nCross-access connections between adjacent parcels.\n\n\nUtility lines, including stormwater and water/sewer, within a landscape yard shall meet the following requirements:\n\nUtility easements are permitted to cross a landscape yard perpendicularly (90 degrees) or to an angle a no less than 75 degrees to the landscape yard.\nThe removal of any tree larger than eight inches in diameter to accommodate utility lines shall require the approval of the Zoning Administrator in consultation with the Chief Urban Forester.\nIf utility easements run at an angle between zero and up to 75 degrees within a landscape yard, the width of the landscape yard shall be increased by the width of the utility easement.\n\n\nCertain elements of a required stormwater facility, designed in accordance with Part IX. Stormwater and other regulations of this Ordinance, may encroach into a required landscape yard for up to 25% of the required landscape yard width. These elements include, but are not limited to, the embankment, inlets, pipes, rip rap, and any stormwater related easement, or similar elements. Such encroachments shall be approved by the Zoning Administrator, in consultation with the Stormwater Administrator. Stormwater related easement, for the purposes of this article includes, but is not limited to, storm drainage easements (SDE), public storm drainage easements (PSDE), and conservation easements.\nAny requirement to install a landscape yard abutting a park or greenway shall be waived in its entirety unless the property is located within the Commercial Place Type or Manufacturing and Logistics Place Type.\nTable 20-2: Landscape Yard Class1 The Charlotte Douglas International Airport is not subject to minimum or maximum fence height requirements.Table 20-3: Required Landscape Yards by Zoning DistrictM. Additional Landscape Yard StandardsThe following may be located within landscape yards required by this article when they meet minimum requirements for this article and the articles listed below:\n\n\n\n\nOpen space per Article 16.\nTree save areas per Article 20 if any trees planted for tree save areas are in addition to any trees required for landscape areas per the requirements of this article.\nWater supply water quality buffers per Article 23.\nPost-construction water quality buffers per Article 25.\nSWIM water quality buffers per Article 26.\nFloodplains per Article 27.\nAreas for greenways or parks per Article 32 offered for dedication and accepted by Mecklenburg County Park and Recreation.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#209-landscape-yard\"}"}, {"title": "20.10 LANDSCAPE YARD FOR RESIDENTIAL SUBDIVISIONS ABUTTING LIMITED ACCESS ROADS", "text": "The following landscape requirements apply to residential subdivisions developed with single-family, duplex, and/or triplex dwellings that abut a Limited Access Road, unless a noise abatement or screening wall is provided.\nA Class B landscape yard per Table 20-2 is required along the lot line that abuts the Limited Access Road. The landscape yard shall be shown on the plat and may be located within common open space or as an easement within lots. The landscape yard shall not be used for any purpose except for plantings, except for the following:\n\nUtility lines per Section 20.9.I.\nStormwater facilities per Section 20.9.J.\n\n\nAny required setback that abuts the landscape yard shall be measured from the inside edge of the landscape yard.\nSETBACK MEASUREMENT FOR RESIDENTIAL SUBDIVISIONS ABUTTING LIMITED ACCESS", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#2010-landscape-yard-for-residential-subdivisions-abutting-limited-access-roads\"}"}, {"title": "20.11 LANDSCAPE YARD FOR RESIDENTIAL THROUGH LOTS AND COMMON OPEN SPACE ALONG AVENUES, BOULEVARDS, AND PARKWAYS", "text": "The following landscape requirements apply to residential subdivisions developed with through lots for single-family, duplex, and/or triplex dwellings, as well as common open space, unless a noise abatement or screening wall is provided. These requirements are applicable along Avenues, Boulevards, and Parkways.\nA Class B landscape yard per Table 20-2 is required along the lot line that abuts the Avenue, Boulevard, or Parkway. The landscape yard shall not be used for any purpose except for plantings. The landscape yard shall be shown on the plat and may be located within common open space or as an easement within lots.\nA berm shall be permitted in the landscape yard in addition to plantings. Berms shall be a minimum of four feet in height. Berms between four feet and six feet in height shall have a maximum slope of 2.5:1 as measured from the exterior property line. Berms over six feet in height shall have a maximum slope of 3.5:1 as measured from the exterior property line.\nFor residential through lots, the side or rear setback shall be measured from the inside edge of the landscape yard.\nSIDE AND REAR SETBACK MEASUREMENT FOR RESIDENTIAL THROUGH LOTS", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#2011-landscape-yard-for-residential-through-lots-and-common-open-space-along-avenues,-boulevards,-and-parkways\"}"}, {"title": "20.12 REQUIRED SCREENING FOR LOADING AND SERVICE AREAS", "text": "\nCertain principal uses, accessory uses, and accessory structures may require screening within their prescribed conditions and standards (Articles 15 and 17).\nThe following areas shall be screened from abutting lots and from view from a public or network-required private street:\n\nLoading AreasScreening of loading areas is not required if a landscape yard per Section 20.9 is provided along any frontage or along any setbacks where loading area screening would be required.\n\nScreening -All Zoning Districts Except ML-1 and ML-2 Zoning DistrictsOutdoor loading areas shall be screened along all frontages and along required side and rear setbacks with a minimum 75% opaque wall or fence that is a minimum of six feet and a maximum of eight feet in height. The wall or fence shall be constructed of wood posts and planks, brick, finished masonry, or stone and erected within 18 inches of the lot line. The finished side of the fence, as opposed to the side with exposed structural supports, shall face abutting properties or frontages. For uses that require only one loading space, and the loading space is located within a surface parking lot, the loading space may use the required screening for the parking lot per Section 20.5.\nScreening -ML-1 and ML-2 Zoning DistrictsOutdoor loading areas to the side or rear of buildings are not required to be screened. Any loading areas visible from a public or network-required street shall install parking lot screening per Section 20.5.\nInternal Loading AreasThe doors for internal loading areas located along a frontage shall remain closed when not in use. This does not apply in the ML-1 and ML-2 Zoning Districts.\n\n\nLarge Waste Containers, Recycling Stations, and Solid Waste Service Areas\n\nScreeningLarge waste containers, recycling stations, and solid waste handling areas located outside of an enclosed structure are subject to the following standards. This does not apply to recycling collection centers as a principal use, which are addressed by Article 15.\n\nLarge waste containers, recycling stations, and solid waste handling areas shall be fully enclosed on three sides by a minimum 75% opaque fence or wall, which shall be constructed of wood posts and planks, brick, finished masonry, or stone, or a wall extension of the principal building, which does not have to be structural, a minimum of one foot above the height of the container to a maximum of two feet above the height of the container in height. A wall extension, which is not required to be structural, shall be constructed as an integral part of the building’s architectural design.\n\nWhen below grade (deep well) refuse collection and recycling systems are used, they shall be screened by a decorative wall, solid fence, or year-round landscaping. The wall, fence, or plantings must be of a height equal to or greater than the above ground height of the refuse collection and recycling equipment being screened.\n\n\nThe enclosure shall be gated. Such gate shall be a minimum 75% opaque and a minimum height to match the height required by item i above. The gate shall be maintained in good working order and shall remain closed except when pick-ups occur.\nWhen not being serviced, large waste containers and recycling stations shall remain in the enclosure with the gate closed.\n\n\nInternal Service AreasThe doors for internal service areas located along a frontage shall remain closed when not in use. This does not apply in the ML-1 and ML-2 Zoning Districts.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#2012-required-screening-for-loading-and-service-areas\"}"}, {"title": "20.13 TREE PROTECTION PURPOSE AND EXEMPTION", "text": "A. The purpose of the tree protection provisions of this Article are to preserve, protect and promote the health, safety, and welfare of the public by providing for the regulation of the planting, maintenance, and removal of trees located on property owned or controlled by the City and on new developments and alterations to previous developments on private property within the City and extraterritorial jurisdiction (ETJ).B. The intent of the tree protection standards of this Article are to:\nProtect, facilitate, and enhance the aesthetic qualities of the community to ensure that tree removal does not reduce property values.\nEmphasize the importance of trees and vegetation as both visual and physical buffers.\nPromote clean air quality by reducing air pollution and carbon dioxide levels in the atmosphere, returning pure oxygen to the atmosphere, and increasing dust filtration.\nReduce the harmful effects of wind and air turbulence, heat and noise, and the glare of motor vehicle lights.\nMinimize increases in temperatures on lands with tree cover.\nMaintain moisture levels in the air of lands with tree cover.\nEmphasize the importance of safeguarding native ecosystems through native tree preservation.\nPreserve underground water reservoirs and facilitate the return of precipitation to the groundwater strata.\nPrevent soil erosion.\nProvide shade and mitigate heat island effects.\nMinimize the cost of construction and maintenance of drainage systems necessitated by the increased flow and diversion of surface waters by facilitating a natural drainage system and amelioration of stormwater drainage problems.\nConserve natural resources, including adequate air and water.\nMaintain and enhance the tree canopy cover across the City.\nC. Exemption for Forestry OperationsAn activity undertaken on forestland for the production and harvesting of timber and timber products and conducted in accordance with standards defined by the Forest Practice Guidelines Related to Water Quality (Best Management Practices), as adopted by the North Carolina Department of Agriculture and Consumer Services shall be exempt from Sections 20.13 through 20.18 of this Article. If the activity undertaken on forestland for the production and harvesting of timber and timber products is not conducted in accordance with standards defined by the Forest Practice Guidelines Related to Water Quality, the provisions of this Article shall apply to such activity and any related activity on the site.", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#2013-tree-protection-purpose-and-exemption\"}"}, {"title": "20.14 HERITAGE TREES", "text": "A. ApplicabilityThe requirements of this section shall apply to development activity, including grading in anticipation of such development, within the corporate limits of the City and the City’s extraterritorial jurisdiction (ETJ), whenever development would result in any of the following:\nNew construction of a principal structure.\nCumulative increase in built-upon area (BUA) or building coverage equal to or greater than 5% or 1,000 square feet, whichever is less.\nApproval of a subdivision as defined by Article 30.3.A.\nB. Heritage trees shall be protected to the greatest extent possible, as specified below :\nHeritage trees may be removed when a City-issued tree work permit is requested and approved, or the standards listed under item 2 below are met. No removal activities shall commence until such permit is issued, any applicable mitigation payments have been received, and a planting plan has been approved, unless removal is permitted per item 2 below. Owners and persons who remove a heritage tree or disturb the critical root zone of a heritage tree without a tree work permit are subject to the civil penalties set forth in Section 4.1 of the UDO Zoning Administration Manual (Charlotte Tree Manual). The critical root zone of a heritage tree shall only include the root area located on the parcel or site where the trunk/main plant stem is rooted in the ground. For purposes of this subsection, a development plan approved by the City constitutes a tree work permit. Tree work permits for the removal of heritage trees shall only be granted in the following instances subject to specified mitigation requirements below:\n\nThe tree and/or critical root zone are located within an area where a structure or improvement may be placed and imposes a documented and confirmed conflict. A documented and confirmed conflict may include but not be limited to the location of structures, site design elements, and required streets as allowed or required by other articles of this Ordinance. Mitigation, per item 3 below, shall be required.\nPreservation of the tree would unreasonably restrict use of the property. An unreasonable restriction per this section shall mean, significant restriction or negative impact to public/private utility service, restriction of property access, restriction of the ability to remedy significant damage to an existing building or structure, or other restrictions of public infrastructure that reasonable maintenance cannot prevent. Mitigation, per item 3 below, shall be required.\nThe tree is sufficiently diseased, injured, dead, in danger of falling, creates an imminent and undue hazard to life and property that reasonable maintenance cannot mitigate, creates unsafe sight distance, or conflicts with other sections of this Ordinance or provisions of other ordinances or regulations. Mitigation shall not be required.\n\n\nHeritage trees that are sufficiently diseased, injured, dead, or are in danger of falling shall not be required to obtain a City-issued tree work permit or mitigate the tree loss prior to removal. Trees removed without a permit due to health or hazard shall be either certified by an ISA-certified arborist or adequately documented through picture, video or other documentation prior to removal. Heritage trees that are in declining health may be removed without a City-issued tree work permit only when certified by an ISA-Certified arborist prior to removal. For the purpose of this section, a “tree in declining health” shall mean a tree that can be expected to fall within a 1-3 year time period per an assessment by an ISA-Certified arborist.\nMitigationOwners and persons authorized by the City to remove a heritage tree, per the conditions stated in this section shall comply with the following mitigation actions:\n\nRequired Tree ReplantingOne tree shall be planted on the property in mitigation pursuant to Section 4.1 of the UDO Zoning Administration Manual. Trees replanted to meet this mitigation requirement shall be in addition to other trees required by this article.\nHeritage Tree Mitigation PaymentA heritage tree mitigation payment shall be required for every heritage tree removed per the fee set by the Charlotte Tree Manual. The required mitigation payment may be reduced or eliminated where trees are replanted on the property in addition to those required by item a above and other tree replanting required by this Article. The rate of reduction shall be subject to Section 4.1 of the UDO Zoning Administration Manual.\nSpecimen Tree PreservationSpecimen trees may be preserved to meet all Heritage Tree mitigation requirements specified above. Only large hardwoods and large softwoods, per the definition of this term in Article 2, shall be used to meet this mitigation option. One specimen tree preserved shall meet the mitigation requirements for the removal of one Heritage Tree approved for removal. The critical root zone of specimen trees preserved shall be identified and protected as a part of the required Tree Compliance Plan per Section 20.18 below, and pursuant to Section 4.1 of the UDO Zoning Administration Manual.\n\nCollected fees from mitigation per this item shall be deposited into the Canopy Care Fund as establish in Section 20.18.D.1.c.\n\n\n\n\nNo tree disturbing activity may impact any heritage tree prior to approval and issuance of applicable tree work permits by the City. Certain impacts to critical root zones shall be permitted subject to Section 4.1 of the UDO Zoning Administration Manual and the CLDSM.\nIt shall be the duty of the property owner to maintain, plant, and/or replace mitigation and heritages trees on private property as required by this section. Trees shall be allowed to grow to their natural height and form. Pruning of these trees may be allowed where a tree work permit has been issued. Topping is prohibited. Property owners will not be held liable for any pruning conducted by utility providers.\n", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#2014-heritage-trees\"}"}, {"title": "20.15 GREEN AREA", "text": "A. Applicability and Exemptions\nApplicabilityThe green area requirements of this section shall apply to all development activity, including grading in anticipation of such development, within the corporate limits of the City and the City’s extraterritorial jurisdiction (ETJ), whenever development would result in any of the following:\n\nNew construction of a principal structure.\nNew construction of a principal structure.\nApproval of a subdivision as defined by Article 30.3.A.\n\n\nExemptionsThe following are exempt from the requirements of this section as specified below:\n\nIncreases in built-upon area (BUA) or building coverage on lots where the existing principal structure is a single-family detached home, duplex, triplex or quadraplex.\nConstruction of a new single-family detached home, duplex, triplex, or quadraplex as a principal structure on a single lot, unless such construction is any of the following:\n\nPart of an approval of a new subdivision as defined by Section 30.3.A,\nConstructed on three or more contiguous/adjacent lots, or\nPart of a multi-dwelling development.\n\n\nPublic projects undertaken by public entities on public property, or public entities and owners of public property unless such projects do any of the following:\n\nIncrease building coverage.\nImpact existing trees required or protected by Section 20.14 through Section 20.17 or Chapter 21 of the City Code of Ordinances.Where public projects are exempt from this section, such projects shall be subject to interdepartmental or interagency agreements and land development standards pursuant to Section 4.1 of the UDO Zoning Administration Manual.\n\n\n\n\nB. Standards by TierGreen area, perimeter planting and internal planting requirements are differentiated by Place Type as designated within the four tiers established within Table 20-4 below:C. Required Green Area15% or more of a development site that is subject to the applicability of this section shall be green area to be credited as provided for in Table 20-5 Green Area Credits.D. Green Area CreditsThe standards and methods for calculating required green area for sites shall be as follows:\nGreen area credits shall be used to achieve the required 15% green area pursuant to item B above. Green area credits are based on the corresponding multipliers for each credit and found in Table 20-5.\nThe process for calculating a property’s green area credit shall be as follows:\n\nThe area of each green area credit is multiplied by its corresponding multiplier.\nThe resulting green area credits are added together.\nThe sum of these green area credits is then divided by the total land area of the development site to determine the green area percentage, which shall constitute at least 15% of the site per item B above.\n\n\nAll Green Area Credits shall comply with technical standards per Section 4.1 of the UDO Zoning Administration Manual.\nGreen Area Method for CalculationSquare footage for existing and dedicated street rights-of-way, railroad rights-of-way and utility easements and for existing ponds and lakes shall be subtracted from the total site area before the required percent of the green area is calculated.\n1 In Tier 3 and Tier 4, as part of the required green area, the removal of existing trees may only be approved by the Chief Urban Forester pursuant to the Charlotte Tree Manual’s Green Area Guideline when the tree and critical root zone are located within the buildable area where a City-required structure or improvement will be placed and there is no other reasonable location, and/or preservation would unreasonably restrict use of and/or access to the property. The area of existing trees removed shall be replanted with trees at 150% of the area removed at 36 trees per acre.2 Only permitted for residential development in N1-A, N1-B, N1-C, N1-D, and N1-E subject to the applicability of this section.3 Payment-in-Lieu and off-site mitigation may not be used in combination to meet the requirements of this section.4 Intermittent and perennial streams within the project boundary shall be delineated by a certified professional using U.S. Army Corps of Engineers and N.C. Division of Water Quality methodology and shall be shown in the Tree Planting and Green Area Plan along with all areas where this green area option is to be used.E. Tree Save StandardsThe following standards shall apply to all tree save areas within the required green area.\nTree save areas shall be free of invasive plant species unless otherwise approved by the Chief Urban Forester. If an area proposed for tree save contains invasive plant species at the time of such proposal, such invasive plant species shall be removed prior to final plat approval for subdivisions. If there is no final plat for a project, the invasive plant species shall be removed prior to the issuance of the final certificate of occupancy. Invasive plant species are considered removed if they are no longer living in or under the tree canopy. Property owners are required to maintain this condition for compliance with this section.\nPursuant to Section 4.1 of the UDO Zoning Administration Manual, any alterations to the tree save area in Tier 3 and Tier 4 Place Types shall be accomplished without mechanized tools and vehicular equipment and made of organic, environmentally friendly materials, unless otherwise approved by the Chief Urban Forester. For sites located in Tier 1 or Tier 2 Place Types, alterations to the tree save area do not have to meet the above standard. However, if alterations are made or amenities are added, these changes shall be made in a manner that is not detrimental to the saved trees or their critical root zone. Alterations and addition of any amenities shall be approved by the Chief Urban Forester.\nAny tree save area less than 30 feet in width shall be delineated on site with boundary and property lines by a licensed surveyor prior to the first submittal of plans.\nNo structure shall be allowed within ten feet of the tree save area. A building restriction note shall be indicated on the record plat pursuant to Section 4.1 of the UDO Zoning Administration Manual. For sites located in Tier 1 or Tier 2 Place Types, the ten foot building restriction may be counted toward the tree save area requirement as long as this area continuously and directly abuts a tree save area and remains pervious. However, regulatory trees may not be planted within this ten foot building restriction area.\nAdditional amenity elements including, but not limited to, benches, trails, gazebos, sheds, fences, may be permitted by the Chief Urban Forester pursuant to Section 4.1 of the UDO Zoning Administration Manual.\nTree save areas may include areas dedicated to Mecklenburg County Park and Recreation for greenways or parks or the City of Charlotte for the Tree Canopy Preservation Program, Urban Arboretum Trail, or other City trail projects. Dedicated tree save areas may include passive use recreation areas and additional amenity elements per Section 20.15.E.5 and per special agreement between the City and Mecklenburg County Park and Recreation. Greenway placement, trail placement, park design, and final location of all amenity elements shall be coordinated with the Chief Urban Forester pursuant to Section 4.1 of the UDO Zoning Administration Manual so that the effective tree save area required is achieved and maintained.\nTree save areas on sites in Tier 1, 2, and 3 Place Types or nonresidential sites in Tier 4 Place Types may include existing tree canopy which overhangs existing underground utility easements based upon adherence to Section 4.1 of the UDO Zoning Administration Manual and approval by the Chief Urban Forester.\nTree save areas may include the planting of small maturing trees in accordance with Duke Energy’s, or its successor’s, approved planting list, within 25 feet of power distribution lines. This allowance shall only be granted where planting is in adherence with Section 4.1 of the UDO Zoning Administration Manual and approved by the Chief Urban Forester.\nIn local historic districts designated by a Historic District Overlay (Section 14.1) and Neighborhood Character Overlay Districts as designated by a Neighborhood Character Overlay (Section 14.2), the requirements of overlay districts apply in addition to the regulations of this section.\nTree Save Standards OverlapThe following may be located within tree save areas when they meet minimum requirements for this article and the articles listed below:\n\n50% of the open space per Article 16 may be tree save areas per Article 20, so long as such tree save area abuts the remaining required open space and includes allowed amenities to provide passive recreation.\nLandscape yards per Article 20 if trees planted or preserved are in addition to minimum tree save requirements.\nWater supply water quality buffers per Article 23.\nPost-construction water quality buffers per Article 25.\nSWIM water quality buffers per Article 26\nFloodplains per Article 27.\nAreas for greenways or parks per Article 32 offered for dedication and accepted by Mecklenburg County Park and Recreation.\n\n\nThe following additional standards apply only to tree save areas for single-family, duplex, triplex, and quadraplex residential development subject to approval of a subdivision per Article 30.3.A.\n\nAdditional Trees-Canopy VoidsIn instances where tree save is used to meet green area requirements, where groups of trees within a tree save area have gaps that are not expected to fill in with time, as determined by the Chief Urban Forester, additional trees shall be planted for the entire area to qualify as tree save area, pursuant to approval by the Chief Urban Forester. If root disturbance or construction activities occur within the drip line of any tree designated as protected in the tree protection plan, only the area being protected shall be included in the calculated tree save area.\nCriteria for New TreesNew trees planted in common open spaces to satisfy the requisite tree save area requirement shall be at least 0.75 inch caliper shade trees. New trees planted within individual lots to satisfy the requirement shall be at least 1.50 inch caliper trees.\n\n\nF. Land Dedication to Mecklenburg County Park and RecreationAs a green area credit option for required green area, the property owner may select one of the following options:\nDedicate 1/3 of land required for green area to Mecklenburg County Park and Recreation (Park and Recreation) for park development, so long as the land meets Park and Recreation standards and is accepted by Park and Recreation.  If selecting this option, and dedicating 1/3 of the land required for green area, a reduction in minimum lot size by 5% would be allowed. This land shall be subject to special agreement between the City and Park and Recreation.\nDedicate all land required for green area to Mecklenburg County Park and Recreation (Park and Recreation) for park development, so long as the land meets Park and Recreation standards and is accepted by Park and Recreation.  If selecting this option, and dedicating all of the land required for green area, a reduction in minimum lot size by 10% would be allowed. This land shall be subject to special agreement between the City and Park and Recreation, which shall preserve 2/3 of the land as on-site tree save. Park land and tree save shall be abutting.\nG. Payment-In-LieuA payment may be made by a developer or a property owner to a City administered tree preservation fund, per item 1 below. The payment shall be a percentage of the tax value of the land being developed pursuant to Section 4.1 of the UDO Zoning Administration Manual. The tax value of the land being developed shall not exceed 90% of the average tax value of land in the City limits and of the ETJ, excluding the land within the boundaries of I-77/I-277 and in accordance with the Charlotte Tree Manual. The City shall update the average tax value of the land for this formula with each County property revaluation. Payment-in-lieu may be used for a portion of the required 15% green area or the entire required green area in accordance with the requirements of this section.\nCollected monies from the green area payment-in-lieu process per this item shall be deposited into the Tree Conservation Fund established in Section 20.18.D.1.a\nH. Off-Site MitigationAn applicant may convey or protect, at no cost to the City, an amount of land equal to the required green area acreage, or a portion thereof, within the City or ETJ, to a land conservation group or the City, for the purpose of preserving off-site tree canopy to meet the requirements of this section, per Table 20-5. Mitigation shall be:\nApproved by the Chief Urban Forester.\nIn compliance with Section 4.1 of the UDO Zoning Administration Manual.\nI. Amenitized Tree AreaAmenitized tree areas shall be subject to the following requirements:\nTrees shall be planted at 36 trees per acre on-site.\nPlanting areas shall be a minimum of ten feet wide.\nNo more than 25 percent of impervious paved areas will be allowed within amenitized tree areas. Gravel pathways in amenitized tree areas will be considered pervious.\nTrees may be planted in alternative locations, such as but not limited to, rooftops, permanent planters, raised or at grade plazas, over parking decks, or other locations approved by the Chief Urban Forester. Greater than 25 percent impervious paved area may be allowed within alternative locations being used to meet the amenitized tree area requirement if minimum soil volume, amended soil, subdrainage, irrigation, planting area, and other applicable design standards per the CLDSM, Charlotte Tree Manual, or as approved by the Chief Urban Forester, are met.\nAmenities may include, but are not limited to, irrigation, landscaping, grass, seating, pathways, and lighting or other items, as approved by the Chief Urban Forester.\nAmenitized Tree Area Standards OverlapThe following may be located within amenitized tree areas when they meet minimum requirements for this article and the articles listed below:\n\nOpen Space per Article 16.\nLandscape yards per Article 20.\nWater supply water quality buffers per Article 23.\nPost-construction water quality buffers per Article 25.\nSWIM water quality buffers per Article 26.\nFloodplains per Article 27.\nAreas for greenways or parks per Article 32 offered for dedication and accepted by Mecklenburg County Park and Recreation.\n\n\nJ. Trees required by this section, or protected as a condition of a previously approved development plan, which die, are missing, or are otherwise deemed unhealthy by the City, shall be removed and replaced by the property owner, normally during the next planting season which is November through March pursuant to the Charlotte Tree Manual.Parcels that are already in compliance shall maintain that compliance with these standards. Trees of the same approved species as those existing may be used to replace dead, missing, or unhealthy trees. The property owner is required to use large maturing shade trees as replacements whenever possible. Nothing in this section is intended to impose a requirement that the property owner maintain more trees than those required for the site even if they have voluntarily done so in the past.K. It shall be the duty of the property owner to maintain, plant, and/or replace trees required by this section. Trees shall be allowed to grow to their natural height and form. Pruning of these trees may be allowed where a tree work permit has been issued. Topping is prohibited. Property owners will not be held liable for any pruning conducted by utility providers.", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#2015-green-area\"}"}, {"title": "20.16 FRONTAGE TREE PLANTING REQUIREMENT", "text": "A. Construction of a new single-family, duplex, triplex or quadraplex structure within the Neighborhood 1 and Neighborhood 2 Zoning Districts, except as part of an approval of a new subdivision as defined by Section 30.3.A or as part of a multi-dwelling development, shall be required to plant a minimum of one large maturing tree for every 40 feet of lot width or one small maturing tree for every 30 feet of lot width between the residential building and the public street right-of-way, pursuant to Section 4.1 of the UDO Zoning Administration Manual. Trees may be planted within the right-of-way to meet the requirements of this section unless the project is adjacent to NCDOT right-of-way. A minimum of one tree per lot shall be required.\nSites with demonstrated constraints including water meters, sewer lines, driveways, and sight triangles may meet this requirement through payment-in-lieu, or planting in alternate locations pursuant to the Charlotte Tree Manual.\nB. Existing large maturing shade trees two-inch caliper or greater preserved between the building and the public street right-of-way may be counted towards this requirement if they are adequately protected during construction.C. Trees planted in the public street right-of-way to meet this requirement shall be a minimum of two-inch caliper. Large maturing trees shall not be planted within 25 feet of overhead power distribution. Small maturing trees may be planted where overhead power distribution lines would interfere with normal growth of large maturing trees. Large and small maturing trees shall not be planted within any electric utility rights-of-way for overhead transmission lines, without documented and confirmed authorization of the corresponding utility provider.D. Trees required by this section or protected as a condition of a previously approved development plan, which die, are missing, or are otherwise deemed unhealthy by the City, shall be removed and replaced by the property owner, normally during the next planting season which is November through March pursuant to the Charlotte Tree Manual.Parcels that are already in compliance shall maintain that compliance with these standards. Trees of the same approved species as those existing may be used to replace dead, missing, or unhealthy trees. The property owner is required to use large maturing shade trees as replacements whenever possible. Nothing in this section is intended to impose a requirement that the property owner maintain more trees than those required for the site even if they have voluntarily done so in the past.E. It shall be the duty of the property owner to maintain, plant, and/or replace trees required by this section. Trees shall be allowed to grow to their natural height and form. Pruning of these trees may be allowed where a tree work permit has been issued. Topping is prohibited. Property owners will not be held liable for any pruning conducted by utility providers.", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#2016-frontage-tree-planting-requirement\"}"}, {"title": "20.17 TREE PLANTING REQUIREMENTS", "text": "A. Applicability and Exemptions\nApplicability. The tree planting requirements of this section shall apply to all development activity, including grading in anticipation of such development, within the corporate limits of the City and the City’s extraterritorial jurisdiction (ETJ), whenever development would result in any of the following:\n\nNew construction of a principal structure.\nCumulative increase in built-upon area (BUA) or building coverage equal to or greater than 5% or 1,000 square feet, whichever is less.\nApproval of a subdivision as defined by Article 30.3.A.\n\n\nExemptions. The following are exempt from the requirements of this section as specified below:\n\nIncreases in built-upon area (BUA) or building coverage on lots where the existing principal structure is a single-family detached home, duplex, triplex or quadraplex.\nConstruction of a new single-family detached home, duplex, triplex, or quadraplex as a principal structure on a single lot, unless such construction is any of the following:\n\nPart of an approval of a new subdivision as defined by Section 30.3.A,\nConstructed on three or more contiguous/adjacent lots, or\nPart of a multi-dwelling development.\n\n\nPublic projects undertaken by public entities or on public property public entities and owners of public property unless such projects do any of the following:\n\nIncrease building coverage.\nImpact existing trees required or protected by Sections 20.14 through Section 20.17 or Chapter 21 of the City Code of Ordinances.Where public projects are exempt from this section, such projects shall be subject to interdepartmental agreements and land development standards pursuant to the Charlotte Tree Manual.\n\n\n\n\nB. General Requirements\nAll trees planted pursuant to this Article shall be planted in amended soils and shall be included as an approved plant species within the CLDSM. All trees shall comply with the latest available edition of the American Standard for Nursery Stock, ANSI Z60.1, American Horticulture Industry Association (AmericanHort).\n\nWhere two-inch minimum caliper trees are specified, the minimum height for single stem trees shall be eight feet and multi-stem trees shall have three to five stems and be a minimum height of eight feet.\nWhere three-inch minimum caliper trees are specified, the minimum height for single stem trees shall be ten feet, and multi-stem trees shall have three to five stems and be a minimum height of ten feet.\n\n\nThe entire planting area for all trees shall contain amended on-site soil or a soil mix and provide the minimum planting area as specified in the Charlotte Tree Manual.\nAt least 75% of new required trees shall be native species. Sites required to plant more than 20 trees shall plant multiple species pursuant to the Charlotte Tree Manual.\nLarge maturing trees shall not be planted within 25 feet of overhead power distribution. Small maturing trees may be planted where overhead power distribution lines would interfere with normal growth of large maturing trees. Large and small maturing trees shall not be planted within any electric utility rights-of-way for overhead transmission lines, without documented and confirmed authorization of the corresponding utility provider.\nRequired trees shall be located at least ten feet from buildings unless otherwise approved by the Chief Urban Forester.\nRequired trees shall be located at least ten feet from on-site underground utilities, where feasible, unless otherwise approved by the Chief Urban Forester. For the purposes of this standard, underground utilities mean primary service lines for water, sewer, City-maintained stormwater, electric, gas, cable TV, and data transmission lines.\nThe required separation between site lighting and trees on a site shall conform to the standards of Table 20­-6: Site Lighting and Tree Separation Requirements below.\nTrees required by this section or protected as a condition of a previously approved development plan, which die, are missing, or are otherwise deemed unhealthy by the City, shall be removed and replaced by the property owner, normally during the next planting season which is November through March pursuant to the Charlotte Tree Manual.Parcels that are already in compliance shall maintain that compliance with these standards. Trees of the same approved species as those existing may be used to replace dead, missing, or unhealthy trees. The property owner is required to use large maturing shade trees as replacements whenever possible. Nothing in this section is intended to impose a requirement that the property owner maintain more trees than those required for the site even if they have voluntarily done so in the past.\nIt shall be the duty of the property owner to maintain, plant, and/or replace trees required by this section. Trees shall be allowed to grow to their natural height and form. Pruning of these trees may be allowed where a tree work permit has been issued. Topping is prohibited. Property owners will not be held liable for any pruning conducted by utility providers.\nC. Perimeter PlantingPerimeter trees are located in planting strips, amenity zones, or planting areas along or otherwise adjacent to public streets and network-required private streets. These trees are intended to provide shade and other environmental benefits along streets for pedestrians and other users of public rights-of-way.\nGeneral Perimeter Planting Requirements\n\nFor all projects subject to the applicability of this Article, large maturing trees per the CLDSM shall comprise 75% of the required perimeter trees planted in locations without overhead power distribution lines that obstruct normal growth. Small maturing trees per the CLDSM shall be planted where overhead power distribution lines obstruct normal growth of large maturing trees.\nAlternative to Perimeter PlantingExisting large maturing trees two-inch caliper or greater within 20 feet of the back of the curb may be counted towards the perimeter planting requirement if they are preserved and adequately protected during construction per the CLDSM, and the Charlotte Tree Manual.\nAdditional Perimeter Planting StandardsThe following may be located within areas designated for perimeter planting when they meet minimum requirements for this article and the articles listed below:\n\nWater supply water quality buffers per Article 23.\nPost-construction water quality buffers per Article 25.\nSWIM water quality buffers per Article 26\nFloodplains per Article 27.\nAreas for greenways or parks per Article 32 offered for dedication and accepted by Mecklenburg County Park and Recreation.\n\n\n\n\nTier 1, 2, and 3 Perimeter Planting Requirements\n\nThe requirements of this section apply to development within the Place Types listed under Tier 1, 2, or 3 per Table 20-4 above. For development subject to this section, large maturing or small maturing trees shall be planted subject to the location and spacing standards below. Trees shall be of a minimum two-inch caliper for Tier 3 sites and a minimum three-inch caliper for Tier 1 and Tier 2 sites.\nPerimeter Planting LocationTrees shall be planted in any planting strip or amenity zone established pursuant to Article 33 unless the project is subject to item 4.c below. Any trees in an established amenity zone may be planted using tree pits or curbed planters as detailed in CLDSM.\nPerimeter Planting Quantity and Spacing\n\nIf large maturing trees are planted:\n\nOne tree shall be planted for every 40 feet of frontage or fraction thereof.\nThe minimum spacing shall be 40 feet.\n\n\nIf small maturing trees are planted:\n\nOne tree shall be planted for every 30 feet of frontage or fraction thereof.\nThe minimum spacing shall be 30 feet.\n\n\n\n\n\n\nTier 4 Perimeter Planting Requirements\n\nApplicabilityThe requirements of this section apply to development within the Place Types listed under Tier 4 per Table 20-4 above. For development subject to this section, large maturing or small maturing trees shall be planted subject to the location and spacing standards below and shall be of a minimum two-inch caliper.\nPerimeter Planting LocationTrees shall be planted in the planting strip or amenity zone pursuant to Article 34 unless the project is subject to item 4.c below. If trees cannot be planted within the planting strip or amenity zone due to an insufficient planting area or soil volume, then trees shall be planted within 20 feet from the back of curb, subject to the requirements of this Article.\nPerimeter Planting Quantity and Spacing\n\nIf large maturing trees are planted:\n\nOne tree shall be planted for every 40 feet of frontage or fraction thereof.\nThe minimum spacing shall be 40 feet.\n\n\nIf small maturing trees are planted:\n\nOne tree shall be planted for every 30 feet of frontage or fraction thereof.\nThe minimum spacing shall be 30 feet.\n\n\n\n\n\n\nSpecial ConditionsModification to perimeter planting requirements for any tier may be granted for the following special circumstances:\n\nSite ConstraintsIf the required number of trees cannot be planted as required above due to site constraints, the alternatives listed below, either individually or in combination, may be used. Site constraints include, but are not limited to, driveway locations, sight triangles, sight lines, and above ground utility locations, as determined by the Chief Urban Forester.\n\nThe minimum spacing between large maturing trees may be reduced from 40 feet to 30 feet. The minimum spacing between small maturing trees may be reduced from 30 feet to 20 feet. For any reduced spacing, only species listed in the Charlotte Tree Manual or approved by the Chief Urban Forester shall be planted.\nIf tree planting in the planting strip or amenity zone is infeasible, alternative locations for tree planting shall be considered. However, in all instances, trees required by this section shall be planted within 20 feet of the back of curb.Where these options are not feasible as determined by the Chief Urban Forester, a payment-in-lieu may be made to the City for perimeter trees that cannot be planted in the planting strip or amenity zone pursuant to the Charlotte Tree Manual. The site may not opt out of all required perimeter trees. Collected fees from City tree mitigation and payment-in-lieu processes per this item shall be deposited into the Street Tree Planting Fund as establish in Section 20.18.D.1.b\n\n\nRailroad, Transit, or Utility Rights-of-WayWhen a railroad, transit, or utility right-of-way separates the perimeter planting strip from a City right-of-way, the perimeter planting strip and tree planting requirements shall still be met.\nNCDOT Maintained Street Rights-of-WayWhen NCDOT planting guidelines or other standards prohibit perimeter tree planting within NCDOT-maintained street rights-of-way, the perimeter tree planting requirement shall still be met as specified below:\n\nIn Tier 1, 2, or 3 Place Types (per Table 20-4), trees shall be planted on-site in alternative locations within 20 feet of the right-of-way, or in locations otherwise approved by the Chief Urban Forester.\nIn Tier 4 Place Types (per Table 20-4) located within Charlotte’s ETJ, all required perimeter trees are allowed to be planted in the required frontage setback.\n\n\n\n\nD. Internal PlantingInternal trees are located on private property outside of public rights-of-way. These trees are intended to provide shade and other environmental benefits in parking lots and other locations internal to sites. 75% of trees planted in parking areas shall be large maturing trees. The remainder of the trees may be either small or large maturing trees. Requirements for internal planting are as follows:\nTier 1 and 2 Internal Planting RequirementsThe requirements of this section apply to development within the Place Types listed under Tier 1 and 2 per Table 20-4 above.\n\nInternal Planting Area and QuantityWhenever the built upon area exceeds 10,000 square feet, a planting area is required as follows:\n\nA planting area equal to 10% of the total built upon area shall be provided. This planting area shall be located on private property and shall be in addition to any perimeter planting and green area requirements. This planting area requirement may be reduced in the following instances:\n\nIn Regional Activity Centers, the planting area may be reduced to 5% of the total built upon area\nIn Tier 1 sites, two trees may be planted for every 10,000 sq ft of built upon area subject to the allowances in item (A) below, subject to the Charlotte Tree Manual and CLDSM.\n\n\nOne large maturing tree shall be planted per 10,000 square feet of built upon area or fraction thereof. Additional trees may also be required to satisfy the locational requirements of Section 20.17.D.1.b, below. A sufficient number of trees shall be planted to satisfy both requirements.\n\n\nInternal Planting Location\n\nTree plantings required by this section may be located anywhere on the site, however, each internal surface parking space shall be no more than 40 feet from a tree trunk.\nIn Tier 1 sites, trees required by this section may be located on rooftops, in permanent planters, on raised or at grade plazas, on the top open-air level of a parking structure, or other locations approved by the Chief Urban Forester.\n\n\n\n\nTier 3 and Tier 4 Internal Planting RequirementsThe requirements of this section apply to development within the Place Types listed under Tier 3 and Tier 4 per Table 20-4 above. This requirement does not apply to residential subdivisions of single-family, duplex, triplex and quadraplex homes in an Neighborhood 1 Place Type.\n\nInternal Planting Area and QuantityWhenever the built upon area of a site exceeds 10,000 square feet, a planting area is required as follows:\n\nA planting area equal to 10% of the total built upon area shall be provided. This planting area shall be located on private property and shall be in addition to any perimeter planting and green area requirements.\nOne large maturing tree shall be planted per 10,000 square feet of built upon area or fraction thereof. Additional trees may also be required in addition to this quantity to satisfy the locational requirements of Section 20.17.D.1.b, below. A sufficient number of trees shall be planted to satisfy both of these requirements.\n\n\nInternal Planting LocationTree plantings required by this section may be located anywhere on the site, however, each internal surface parking space shall be no more than 40 feet from a tree trunk. Modifications of strict adherence to these requirements are granted for the following:\n\nThe distance requirement may increase to 60 feet from a tree trunk if continuous islands, running the length of the parking area, are provided at a minimum width of eight feet.\n\n\n\n\nSpecial ConditionsModification to internal planting requirements may be granted for the following special circumstances:\n\nMulti-Family PlantingFor parking spaces located in driveways for individual multi-family attached dwellings, the required trees may be located elsewhere on the site as approved by the Chief Urban Forester. The number of trees shall equal the quantity required by Section 20.17.D.2.a, above.\nExisting TreesIn meeting these internal planting requirements, credit may be given for existing trees subject to the following:\n\nCredit shall only be granted if the following conditions are met:\n\nThe applicant includes in the tree survey referenced in Section 20.18.A, all existing trees of two-inch DBH or greater which are proposed to satisfy the planting requirements of this section.\nThe applicant provides for the protection of healthy trees identified and proposed to satisfy the planting requirements of this section, during the entire development period, beginning prior to the commencement of site work and continuing through to issuance of the certificate of occupancy pursuant to approved tree protection requirements per CLDSM, the Charlotte Tree Manual, and Section 20.14.\n\n\nThe Chief Urban Forester may deem trees to be ineligible for this credit if the minimum protection standards are not met, or if trees are observed to be injured or threatened.\n\n\nBus and Tractor Trailer LotsBus and tractor-trailer lots are not required to meet the 40-foot distance requirement above when trees are planted 40 feet apart around the edge of the parking area in a minimum ten foot wide planting area. Trees planted pursuant to this requirement may count as trees required per Section 20.6.\n\n\nAdditional Internal Tree StandardsInternal trees may be located within the following areas when they meet minimum requirements for this article and the articles listed below:\n\nOpen Space per Article 16.\nLandscape yards per Section 20.9 if internal trees planted or preserved are in addition to minimum landscape yard requirements.\nWater supply water quality buffers per Article 23.\nPost-construction water quality buffers per Article 25.\nSWIM water quality buffers per Article 26.\nFloodplains per Article 27.\nAreas for greenways or parks per Article 33 offered for dedication and accepted by Mecklenburg County Park and Recreation.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#2017-tree-planting-requirements\"}"}, {"title": "20.18 TREE PROTECTION ADMINISTRATION AND PROCESS", "text": "A. Plan Submittal and Process\nTree Survey for Conditional Zoning Map AmendmentA tree survey shall be required for all conditional zoning map amendments. A tree survey required by this section shall include identification of the following:\n\nAll City trees eight inches DBH or greater and all planted City trees.\nAll existing heritage trees on the property.\nAny existing areas of the site used for credit toward meeting previously approved tree save or green area requirements.\n\n\nTree Compliance PlanAll applications for land development approval subject to the applicability of Section 20.15, Section 20.16, and Section 20.17 shall be required to submit to the Planning Department a tree compliance plan which shall include a tree survey, a tree and critical root zone protection plan, and tree planting and green area plan for all City trees, heritage trees, specimen trees, tree save areas, areas subject to green area requirements, and tree protection zones, as applicable.\n\nTree Survey for Land Development ApprovalA tree survey required by this section shall include identification of the following:\n\nAll City trees of eight inches DBH or greater and all planted City trees.\nAny trees of two-inches caliper or larger being saved for credit toward planting requirements.\nAll existing heritage trees and their critical root zones on the property within 50 feet of proposed land disturbing activity or that are being used for green area credit.\nAll existing specimen trees that are used for tree save, green area credit, or heritage tree mitigation and their critical root zones.\nAny existing areas of the site used for credit toward meeting previously approved tree save or green area requirements\nAny area of the site to be used for credit toward meeting new green area requirements per Section 20.15.B. Green roof and green wall area used for credit toward green area requirements shall be delineated by unique identifiers on the plan from other green area credits used to achieve required on-site green area.\n\n\nTree and Critical Root Zone Protection PlanA tree and critical root zone protection plan pursuant to the Charlotte Tree Manual shall include identification of location and protection plan for the following trees and their critical root zones:\n\nAll City trees of eight inches DBH or greater and all planted City trees.\nAny areas of the site used to meet tree save or green area.\nAny trees of two-inch caliper or larger being saved for credit toward planting requirements per Section 20.16 and 20.17.\nAny existing heritage trees being saved per Section 20.14.\nAny existing specimen trees that will be used for green area credit or heritage tree mitigation.\n\n\nTree Planting and Green Area PlanAll applications for land development approval subject to the applicability of Section 20.14, 20.15, 20.16 and Section 20.17, shall include a tree planting and green area plan, as applicable. The tree planting and green area plan shall include all trees, including the location of each, required to be planted or preserved pursuant to the requirements of Section 20.14, 20.15, 20.16 and Section 20.17 and shall be submitted to the Planning Department in written/design form and shall conform to the provisions of this Article and all specifications set out in the Charlotte Land Development Standards Manual (CLDSM) and Charlotte Tree Manual.\n\n\nSpatial Tree Data PlanTo certify completion of a development project, applicants shall submit “spatial tree data” plans as specified in the CLDSM, and Charlotte Tree Manual for all required perimeter trees, internal trees, mitigation trees, and green area credits. Trees planted pursuant to Section 20.16 shall not require a “spatial tree data” plan. “Spatial tree data” plans shall be submitted to the Planning Department prior to release of permit holds.\nPlatting and Recording of Green AreaPrior to issuance of certificates of occupancy, boundaries for tree save, amenitized tree area, replanted tree save, and any off-site mitigation area used to meet green area requirements shall be required to be surveyed and be described in metes and bounds and be recorded on the final plat.\nB. Tree Work Permits\nPersons requesting to perform any tree disturbing activity to trees subject to Section 20.14, Section 20.15, Section 20.16, or Section 20.17 of this Article, or trees protected as a condition of a previously approved development plan, shall obtain a tree work permit from the General Services Department or the Planning Department before the activities commence, pursuant to the Charlotte Tree Manual. For purposes of this section, a development plan subject to the applicability of this Article that is approved by the City constitutes a tree work permit.\nThe City shall have the authority to review all requests for tree work permits and to grant, deny, or attach reasonable conditions to such permits.\nIndividual tree work permits shall not be required for Charlotte Department of Transportation (CDOT), Charlotte Area Transit System (CATS), and North Carolina Department of Transportation (NCDOT) projects so long as tree preservation and protection requirements are included in the project plans.\nC.  Tree Planting Delay RequestsRequests for a delay in complying with Section 20.14, Section 20.15, Section 20.16 or Section 20.17 of this Article due to poor weather conditions for planting shall be considered following a written request directed to the Planning Department. Permit holds shall be released upon approval of a planting delay. Denied tree planting delay requests shall not change the timeframe during which the planting shall be completed. Failure to comply shall be deemed a willful violation of this article and shall result in penalties as provided for in Article 39.D. Tree Mitigation Funds\nThe City of Charlotte shall maintain the following funds for the purpose of collecting and spending mitigation fees pursuant to the requirements of this Article and the Charlotte Tree Manual. These funds shall include the following:\n\nTree Conservation FundThe City of Charlotte shall establish a Tree Conservation Fund to support the acquisition, protection, management, and long-term conservation of land in the City of Charlotte and its ETJ solely for the purposes of tree canopy conservation. The Tree Conservation Fund shall directly and only fund the City’s Tree Canopy Preservation Program (TCPP). Collected fees will be allocated as designated in Section 4.2 of the UDO Zoning Administration Manual (Tree Canopy Preservation Program Manual). Collected fees and monies from the green area payment-in-lieu process, per Section 20.15.F.1, and any collected fees from mitigation processes specified to support TCPP, any grant funding specified to support TCPP, and all other monies collected with the intent and purpose of supporting TCPP shall be deposited into the Tree Conservation Fund. Fees collected shall only be spent on the following funding areas:\n\nAcquisition of PropertyThe Tree Conservation Fund shall be used to purchase forested property and/or property that may be reforested following the guidance set forth in Section 4.2 of the UDO Zoning Administration Manual. The purchase of property for inclusion into the TCPP shall be authorized by the City Council and explicitly protected and preserved in perpetuity as forested land. All TCPP and Urban Arboretum Trail sites shall be assigned an official conservation designation.\nProperty ManagementThe Tree Conservation Fund shall be used to support TCPP property management needs to ensure properties are maintained adequately to align with the City’s Comprehensive Plan, and as required by the Unified Development Ordinance, applicable conservation easements, management plans and Section 4.2 of the UDO Zoning Administration Manual.\nProgram Management/Staff SupportThe Tree Conservation Fund shall be used to support the salary, benefit costs, and general overhead costs for up to 3 full-time equivalent (FTE) staff positions and 1 intern position to assist in managing TCPP.\nLong-Term StewardshipThe Tree Conservation Fund shall support long-term property management needs in the event annual property management funding level is insufficient to adequately maintain TCPP sites.\nUrban Arboretum Trail (UAT)The Tree Conservation Fund shall be used to support procurement of plant material, design services, site preparation services, installation services and other tree canopy and/or tree-themed program development items for UAT.\n\n\nStreet Tree Planting FundThe City of Charlotte shall establish a Street Tree Planting Fund to support City-managed public tree planting and public tree inventory initiatives in the City of Charlotte’s corporate limits, and tree canopy assessment and policy initiatives. Collected fees and monies from City tree mitigation, planting strip payment-in-lieu processes, tree pit payment-in-lieu processes, and other monies collected specified to support the interests of public tree planting, public tree inventory, and tree canopy assessment and policy initiatives, shall be deposited into the Street Tree Planting Fund.\nCanopy Care FundThe City of Charlotte shall establish a canopy care fund to support the sustainable preservation, maintenance, and/or regeneration of Charlotte’s tree canopy. Canopy Care Funds may also be used to increase awareness of the trees and other tree canopy resources in the City of Charlotte. Collected monies shall be allocated as designated pursuant to the Charlotte Tree Manual (Canopy Care Funding Framework). Collected monies from heritage tree mitigation and payment-in-lieu processes as specified above, and any other collected monies specified to support the fund shall be deposited into the Canopy Care Fund. Funds collected shall be spent in the following funding areas:\n\nLarge Tree Assistance ProgramThe Canopy Care Fund shall be used to support a City-managed assistance program to help residents maintain tree canopy on private property.\nHeritage Tree Mitigation PlantingThe Canopy Care Fund shall be used to support a City-managed assistance program to help residents plant mitigation trees and support general tree planting on private property.\nProgram Management/Staff SupportThe Canopy Care Fund shall be used to support the salary, benefit costs, and general overhead costs for up to one full-time equivalent (FTE) staff position and one intern position to assist in managing Canopy Care Fund supported programs.\nCanopy Care Grant Program EstablishmentThe Canopy Care Fund shall be used to support a City-managed canopy care grant fund targeting tree planting or tree care on private property, cankerworm banding, and other tree canopy management needs pursuant to the Charlotte Tree Manual. All non-profit organizations, places of worship, organized community groups, and neighborhood and homeowners’ associations within the City of Charlotte and its ETJ are eligible.\n\n\n\n\nE. Administrative Adjustments and Emergencies\nAdministrative Adjustments\n\nAdministrative adjustments to quantitative standards may be requested in accordance with Section 37.4.A. Requests for administrative adjustments of quantitative standards shall only be considered for the following standards included within Table 20-7 Tree Protection Adjustments.\n\n\n\nIf strict compliance with the standards of Sections 20.13 through 20.18 conflict with existing federal or state statutory or regulatory requirements the developer may submit a specific alternate plan for planting to the Chief Urban Forester for consideration. This plan shall meet the purposes and standards of this Article but may suggest measures other than those in Section 20.15. In addition, if the developer seeks a modification of planting requirements based upon a contention that the planting required by Sections 20.13 through 20.18 would pose a threat to health and safety due to a conflict with existing federal or state statutory or regulatory requirements, a modification shall only be considered upon receipt of a written explanation of the alleged conflict created by the planting requirement and a copy of the statute or regulation that creates the conflict. The Chief Urban Forester shall review the alternate proposal and advise the applicant of the disposition of the request within 15 working days of submission by the applicant. Any appeals by the applicant shall be in accordance with Article 37.\n2. AppealsAny determinations and decisions pursuant to this section may be appealed to the UDO Board of Adjustment as per Article 37.3. EmergenciesIn an emergency such as a windstorm, ice storm, fire, or other disaster, the requirements of this Section 20.13 through 20.18 may be waived by the City during the emergency period so that the requirements of this Article shall in no way hamper private or public work to restore order in the City. This shall not be interpreted to be a general waiver of the intent of this Article.F. Administration\nAppeals and variances of this Article shall be subject to Article 37.\nInspections and enforcement actions of this Article shall be subject to Article 39.\nG. Chief Urban ForesterThe Chief Urban Forester shall be charged with the following duties:\nTo interpret, administer and enforce the provisions of Sections 20.13 through 20.18 of this Article.\nTo lead and supervise the work and activities of staff, and supervise the tree regulation review, enforcement, and compliance.\nTo lead City-wide and department urban forestry goals and initiatives.\nTo serve as a liaison for the Charlotte Tree Advisory Commission, and interdepartmental committees.\nTo interpret and translate information to the public on regulatory processes, planning initiatives, and land use policies related to urban forestry and tree canopy.\nPrepare and make available to the public a Charlotte Tree Manual which includes guidelines for compliance with this Article.\nTo designate appropriate other person(s) who shall carry out the powers and duties of the Chief Urban Forester.\n", "metadataJson": "{\"section_url\": \"/articles/article-20-landscaping-screening-tree-protecton/#2018-tree-protection-administration-and-process\"}"}]}