{"title": "Article 27. Floodplain Regulations", "metadataJson": "{\"base_url\": \"article-27-floodplain-regulations\"}", "section": [{"title": "27.1 INTRODUCTION, PURPOSE, AND OBJECTIVES", "text": "\n” Statutory AuthorizationThe Legislature of the State of North Carolina has in Part 6, Article 21 of Chapter 143; Articles 7, 9, and 11 of Chapter 160D; Article 6 of Chapter 153A; and Article 8 of Chapter 160A of the North Carolina General Statutes (N.C.G.S.), delegated to local governmental units the authority to adopt regulations designed to promote the public health, safety, and general welfare.\n*B.* Purpose\n\nThe flood hazard areas of Charlotte and Charlotte’s extraterritorial jurisdiction (ETJ) are periodically inundated by the cumulative effect of obstructions in floodplains. This not only results in increases in flood heights and velocities during flooding events but the loss of life, increased health and safety hazards, destruction of public and private property, and disruption of commerce and governmental services. This article promotes public health, safety, and general welfare and minimizes public and private losses due to flood conditions in specific areas by regulations designed to:\n\nRestrict or prohibit uses which are dangerous to health, safety, welfare, and property due to water or erosion hazards and encourage the retention of open land uses located and designed to constitute a harmonious and appropriate part of the physical development of the City as provided in the Comprehensive Plan and subsequent area planning efforts.\n\n\n\nRequire that uses vulnerable to floods, including facilities, both public and private, which serve such uses, be protected against flood damage at the time of initial construction.\n\n\n\nControl the alteration of, and encroachment upon, natural floodplains, stream channels, natural protective barriers, and drainage courses which are involved in the accommodation of flood waters, thus limiting the expenditure of public money for flood-control projects.\n\n\n\nControl filling, grading, dredging, and other development activities which may increase erosion or flood damage.\n\n\n\nPrevent or regulate the construction of flood barriers which shall unnaturally divert flood waters, or which may increase flood hazards to other lands.\n\n\n\nEnsure uses permitted to be located within flood hazard areas are designed in a manner such that they do not impede the flow of flood waters or otherwise cause danger to life and/or property and to minimize the need for rescue and relief efforts associated with flooding.\n\n\n\nSupport sound development practice and a stable tax base by providing for accurate mapping of community flood fringe areas on the flood insurance rate maps (FIRM) and notice for existing and potential property owners of special flood hazard areas, associated flood risks and development restrictions.\n\n\n\nTo minimize future flood losses by depicting future flood fringe areas on the FIRM.\n\n\n\n\n\nIt is the intent that the regulations in this article are used in conjunction with the zoning district regulations for subject properties. Any use not permitted by the zoning district shall not be permitted in the special flood hazard area, and any use permitted by the zoning district shall be permitted only upon meeting conditions and requirements as prescribed in this article.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-27-floodplain-regulations/#271-introduction,-purpose,-and-objectives\"}"}, {"title": "27.2 APPLICABILITY", "text": "\n” General ApplicabilityThis article shall apply to property within the City and the extraterritorial jurisdiction (ETJ) and also within the area shown on the FIRM or any Federal Emergency Management Agency (FEMA) and/or locally approved revisions to data shown on the FIRM, that is located within the community special flood hazard areas or land adjacent to the community special flood hazard areas if affected by work taking place.\n*B.* Basis for Establishing the Special Flood Hazard Areas\n\nAll streams in Mecklenburg County with drainage areas of one square mile or greater have established community and FEMA base flood elevations and community encroachment areas and FEMA floodways.\n\n\n\nThe FEMA and community special flood hazard areas are those identified in the effective flood insurance study (FIS) for Mecklenburg County and the City of Charlotte, dated November 16, 2018, and its accompanying FIRM, and all local or FEMA-approved revisions to the FIRM and/or FIS.\n\n\n\nIn areas where a preliminary FIRM and preliminary FIS exist, community base flood elevations shown on the preliminary FIRM and preliminary FIS shall be used for local regulatory purposes, if they are higher than those shown on the effective FIRM and FIS.\n\n\n\nThe initial FIRM are as follows for the jurisdictional areas at the initial date:\n\nCity of Charlotte dated August 15, 1978.\n\n\n\nMecklenburg County Unincorporated Area, dated June 1, 1981.\n\n\n\n\n*C.* Floodplain Development Permit RequiredA floodplain development permit shall be required in conformance with the provisions of this article prior to the commencement of any development activities. The Floodplain Regulations Technical Guidance Document (Technical Guidance Document) may be used for illustrative purposes to assist in determining the applicable type of floodplain development permit required.\n*D.* ComplianceNo land shall be altered, or any structure shall be located, extended, constructed, converted, or structurally altered without full compliance with the terms of this article and other applicable regulations.\n*E.* Legal Status\n\nEffect on Rights and Liabilities under Existing Floodplain Regulations\n\nThis article in part reenacts some of the provisions of the floodplain regulations effective July 1, 2021, and it is not the intention to repeal but rather to reenact and continue to enforce without interruption such existing provisions, so that all rights and liabilities that have accrued thereunder are reserved and may be enforced. The enactment of this article shall not affect any action, suit or proceeding instituted or pending. All provisions of the floodplain regulations of Charlotte effective July 1, 2021, which are not reenacted herein, are repealed.\n\n\n\nThe date of the initial Flood Damage Prevention Ordinance for the City of Charlotte is November 27, 1972.\n\n\n\nThe date of the initial Flood Damage Prevention Ordinance for Mecklenburg County is December 4, 1972.\n\n\n\n\n\nEffect upon Outstanding Floodplain Development Permits\n\nNothing contained within this article shall require any change in the plans, construction, size, or designated use of any development or any part thereof for which a floodplain development permit has been granted by the Floodplain Administrator before the effective date of this article, June 1, 2023. However, when construction has not commenced under such outstanding permit within a period of two years subsequent to time of effective date of this article, June 1, 2023, or any subsequent revision to this article, such permit shall become null and void and construction or use shall conform with this article.\n\n\n\nAny application(s) for a floodplain development permit received prior to the effective date, June 1, 2023, of this article may be reviewed under the regulations in effect at the time of the initial application or under the adopted regulations.\n\n\n\nAny incomplete application(s) for a floodplain development permit shall be valid only for 90 days after the Floodplain Administrator has requested additional information from the applicant or their agent. If 90 days after the owner or their agent has received the request for additional information the applicant has failed to submit reasonably complete information that demonstrates a good faith effort to provide all the additional information requested, as determined by the Floodplain Administrator, the application shall become null and void. Any subsequent submittals shall be considered as new applications and reviewed under the regulations in effect on the date any such subsequent submittal is received by the Floodplain Administrator.\n\n\n\n\n*F.* Abrogation and Greater RestrictionsThis article does not impair or interfere with any existing provisions of laws or ordinances, or any rules, regulations, or permits previously adopted or issued, or which shall be adopted or issued, in conformity with law, relating to the use of buildings or premises; nor is it intended by this article to interfere with or abrogate or annul any easements, covenants or other agreements between parties. However, where this article imposes a greater restriction upon the use of buildings or premises or requires larger setbacks or other open spaces than are imposed or required by such existing provisions of laws or ordinances, or by such rules, regulations, or permits or by such easements, covenants, or agreements, the provisions of this article control.\n*G.* InterpretationIn the interpretation and application of this article, all provisions shall be:\n\nConsidered minimum requirements.\n\n\n\nLiberally construed to meet the purposes and objectives of this regulation as stated in Sections 27.1.B.\n\n\n\nDeemed neither to limit nor repeal any other powers granted by the N.C.G.S.\n\n\n*H.* Warning and Disclaimer of LiabilityThe degree of flood protection required by this article is considered reasonable for regulatory purposes and is based on scientific and engineering consideration. Larger floods can and shall occur on rare occasions. Flood heights may be increased by manmade or natural causes. This article does not imply that land outside the special flood hazard areas or uses permitted within such areas shall be free from flooding or flood damages. This article shall not create liability on the part of the City, Mecklenburg County, or on any agent, officer, or employee, for any flood damages that result from reliance on this article or by any administrative decision lawfully made hereunder.\n*I.* DefinitionsThe definitions of Section 27.8 only apply to this article. Unless specifically defined in Section 27.8, other words or phrases used in this article are as defined in Article 2 for general definitions or Article 15 for use definitions. In the case of a conflict between a term defined in Article 2 or Article 15 and this article, the definition in Section 27.8 controls.\n", "metadataJson": "{\"section_url\": \"/articles/article-27-floodplain-regulations/#272-applicability\"}"}, {"title": "27.3 GENERAL FLOOD HAZARD REDUCTION STANDARDS", "text": "In all special flood hazard areas, the following apply:\n” All new construction and substantial improvements shall be anchored to prevent flotation, collapse, or lateral movement of the structure.\n*B.* Manufactured homes shall be anchored to prevent flotation, collapse, or lateral movement. Methods of anchoring may include, but are not limited to, the use of over-the-top or frame ties to ground anchors. This standard shall be in addition to and consistent with applicable state requirements for resisting wind forces.\n*C.* All new construction and substantial improvements shall be constructed with materials and utility equipment resistant to flood damage.\n*D.* All new construction or substantial improvements shall be constructed by methods and practices that minimize flood damage.\n*E.* All new electrical, heating, ventilation, plumbing, air-conditioning equipment and other service facilities shall be designed and/or located so as to prevent water from entering or accumulating within the components during conditions of flooding to the Flood Protection Elevation (FPE). These include but are not limited to HVAC equipment, water softener units, bath/kitchen fixtures, ductwork, electric meter panels/boxes, utility/cable boxes, appliances (e.g., washers, dryers, refrigerator, etc.), hot water heaters, electric wiring, and outlets/switches.\n\nReplacements that are part of a substantial improvement, electrical, heating, ventilation, plumbing, air conditioning equipment, and other service equipment shall also meet the above provisions.\n\n\n\nReplacements that are for maintenance and not part of a substantial improvement may be installed at the original location provided the addition and/or improvements only comply with the standards for new construction consistent with the requirements of this article for the original structure.\n\n\n\nThe cost for replacements that are for maintenance, are not part of a substantial improvement, and that are installed at the original location are not included as substantial improvement costs if the replacements are designed and/or located so as to prevent water from entering or accumulating within the components during conditions of flooding to the FPE.\n\n\n*F.* All new and replacement water supply systems shall be designed to minimize or eliminate the infiltration of floodwaters into the system.\n*G.* New and replacement sanitary sewage systems shall be designed to minimize or eliminate the infiltration of floodwaters into the system and discharges from the systems into floodwaters.\n*H.* On-site waste disposal systems shall be located and constructed to avoid impairment to them or contamination from them during flooding.\n*I.* Any alteration, repair, reconstruction, or improvements to a building or structure which is in compliance with the provisions of this article, shall meet the requirements of new construction per this article.\n*J.* Construction of new solid waste disposal facilities, hazardous waste management facilities, salvage yards, and chemical storage facilities shall not be permitted except by variance in special flood hazard area. A structure or tank for chemical or fuel storage incidental to an allowed use or to the operation of a water treatment plant or wastewater treatment facility may be located in a special flood hazard area only if the structure or tank is either elevated above the community base flood elevation or designed to be watertight with walls substantially impermeable to the passage of water and with structural components capable of resisting hydrostatic and hydrodynamic loads and the effects of buoyancy.\n*K.* Any new critical facility shall be located outside of the 500-year (0.2%) flood fringe area and elevated at least one foot above the 500-year (0.2%) flood elevation or the community base flood elevation whichever is greater. The determination of this flood fringe area and elevation shall be provided by the Floodplain Administrator.\n*L.* Subdivisions: All development proposals submitted for review and approval in accordance with Article 30 shall also comply with the following provisions:\n\nLocate and construct public utilities and facilities, such as sewer, gas, electrical, and water systems, to minimize flood damage.\n\n\n\nConstruct all new public and network-required private streets located in a community special flood hazard area in accordance with the applicable provisions of this article.\n\n\n\nDesign and construct adequate drainage to reduce exposure to flood hazards.\n\n\n\nTake such other appropriate measures needed to minimize flood damage.\n\n\n*M.* When a structure is partially located in a community or FEMA special flood hazard area, the entire structure shall meet the requirements for new construction and substantial improvements.\n*N.* When a structure is located in multiple flood hazard zones or in a flood hazard risk zone with multiple base flood elevations, the provisions of the more restrictive flood hazard risk zone and the highest base flood elevation shall apply.\n*O.* The following may be located within the floodplain when they meet the minimum requirements of this article and the articles listed below:\n\nRequired open space per Article 16.\n\n\n\nLandscape yard per Article 20.\n\n\n\nAmenitized tree areas per Article 20\n\n\n\nTree save per Article 20.\n\n\n\nInternal trees per Article 20.\n\n\n\nPerimeter trees per Article 20.\n\n\n\nWater supply water quality buffer per Article 23.\n\n\n\nPost-construction water quality buffer per Article 25.\n\n\n\nSWIM water quality buffer per Article 26.\n\n\n\nAreas for greenways or parks per Article 32 offered for dedication and accepted by Mecklenburg County Park and Recreation.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-27-floodplain-regulations/#273-general-flood-hazard-reduction-standards\"}"}, {"title": "27.4 SPECIFIC FLOOD HAZARD REDUCTION STANDARDS", "text": "In all community and FEMA special flood hazard areas where community and FEMA base flood elevation data have been provided, as set forth above in Section 27.2.B, the following apply:A. Residential and Mixed-Use with Residential Construction\nElevationNew construction or substantial improvement of any residential structure shall have the lowest floor elevated to or above the FPE. Where an area is impacted by FEMA and/or community base flood elevations from both the Catawba River and a stream flowing into the Catawba River, the higher of the FEMA and/or community base flood elevations shall apply.\nCommunity Base Flood Elevation ExemptionSubstantial improvement to existing buildings having the lowest floor located at least one foot above the FEMA base flood elevation, but less than the FPE, are exempt from the requirement to elevate the lowest floor to or above the FPE. However, the property owner shall record the applicable affidavit as provided by Charlotte-Mecklenburg Storm Water Services (hereinafter referred to as “affidavit”) with the Mecklenburg County Register of Deeds Office prior to the issuance of any building permit. The affidavit, provided in the Technical Guidance Document, shall acknowledge that the property owner elected to proceed with the substantial improvement, and was made aware of the community base flood elevations and that in the future there shall be:\n\nPotential for flood losses.\nPotential for mandatory purchase of flood insurance.\nPotential for FEMA substantial improvement rules to apply.\nNo local funds available for flood mitigation assistance (e.g. buyouts, elevations, etc.).\n\n\nNon-Substantial Improvements NoticeRenovations, rehabilitations, repair, reconstruction, or improvements costing between 10% and 50% of the market value of the existing building and said existing building having the lowest floor below the FPE shall require the property owner to record a notice of floodplain improvements, provided in the Technical Guidance Document, with the Mecklenburg County Register of Deeds Office prior to the issuance of any building permit.\nB. Nonresidential Construction\nElevationNew construction or substantial improvement of any nonresidential structure shall meet the requirements for residential construction in item A.1 above, or the structure may be floodproofed in lieu of elevation of the lowest floor, provided that all areas of the structure below the required elevation are watertight with walls substantially impermeable to the passage of water, using structural components having the capability of resisting hydrostatic and hydrodynamic loads and the effects of buoyancy. A North Carolina Professional Engineer or North Carolina Licensed Architect shall certify that the standards of this subsection are satisfied. Such certification shall be provided to the Floodplain Administrator as set forth in Section 27.5. Floodproofing requirements are provided in the Technical Guidance Document.\nCommunity Base Flood Elevation ExemptionSubstantial improvement to existing buildings having the lowest floor located at least one foot above the FEMA base flood elevation, but less than the FPE, are exempt from the requirement to elevate the lowest floor to or above the FPE. However, the property owner shall record an affidavit of floodplain construction below community base flood elevation (“affidavit”) with the Mecklenburg County Register of Deeds Office prior to the issuance of any building permit. The affidavit, provided in the Technical Guidance Document, shall acknowledge that the property owner elected to proceed with the substantial improvement, and was made aware of the community base flood elevations and that in the future there shall be:\n\nPotential for flood losses.\nPotential for mandatory purchase of flood insurance.\nPotential for FEMA substantial improvement rules to apply.\nNo local funds available for flood mitigation assistance (e.g. buyouts, elevations, etc.).\n\n\nNon-Substantial Improvements NoticeRenovations, rehabilitations, repair, reconstruction, or improvements costing between 25% and 50% of the market value of an existing building having the lowest floor below the FPE shall require the property owner to record a notice of floodplain improvements, provided in the Technical Guidance Document, with the Mecklenburg County Register of Deeds Office prior to the issuance of a building permit.\nC. Elevated BuildingsNew construction or substantially improved structures with fully enclosed areas formed by foundation and other exterior walls below the community base flood elevation shall meet the following:\nEnclosed areas shall not be designed for human habitation and shall only be used for parking of vehicles, building access, or limited storage of maintenance equipment used in connection with the premises. The walls shall be designed to allow for the entry and exit of floodwaters to automatically equalize hydrostatic flood forces on exterior walls.\nDesigns for complying with this requirement shall either be certified by a North Carolina Professional Engineer or North Carolina Licensed Architect or meet the following minimum criteria:\n\nProvide a minimum of two openings.\nThe total net area of all openings shall be at least one square inch for every square foot of enclosed area subject to flooding.\nThe bottom of all openings shall be no higher than one foot above adjacent grade at the opening.\nOpenings may be equipped with screens, louvers, or other coverings or devices, provided they permit the automatic flow of floodwaters in both directions.\nOpenings shall be on different sides of the enclosed area if possible.\nIf the building has more than one enclosed area, each shall have openings.\n\n\nFoundation enclosures:\n\nVinyl or sheet metal skirting is not considered an enclosure for regulatory and flood insurance rating purposes. Therefore, such skirting does not require hydrostatic openings as outlined above.\nMasonry or wood underpinning, regardless of structural status, is considered an enclosure and requires hydrostatic openings as outlined above to comply with this article.\n\n\nAccess to the enclosed area shall be the minimum necessary to allow for parking of vehicles (e.g. garage door) or limited storage of maintenance equipment used in connection with the premises (e.g. standard exterior door) or enter to the living area (e.g. stairway or elevator).\nThe interior portion of such enclosed area shall not be partitioned or finished into separate rooms, except to enclose storage areas.\nThe enclosed area shall be constructed entirely of flood resistant materials at least to the FPE.\nThe enclosed area shall not be temperature controlled.\nD. Dryland AccessAccess to habitable buildings during a flood event is extremely hazardous. Dryland access shall be provided to new or substantially improved habitable buildings according to the following:\nDryland access is required if any portion of either the habitable building or vehicular access route, connecting the habitable building to a public street, is within the floodplain.\nPlans and details for the dryland access shall be submitted by a North Carolina Professional Engineer or North Carolina Professional Land Surveyor and approved by the Floodplain Administrator.\nIf dryland access cannot be obtained, a variance to the requirement for dryland access may be granted by the UDO Board of Adjustment per Section 27.6 below.\nExemptions from dryland access requirements are allowed for any of the following conditions:\n\nSubstantial improvement to an existing habitable building where the property does not have dryland access.\nConstruction of a new habitable building where both the habitable building and the access route connecting it to a public street, are located entirely outside the community encroachment area and where the property does not have any access to a dry public street. Under this exemption, access from the habitable building to the public street shall:\n\nConnect at the highest point of the public street adjacent to the property.\nBe constructed of gravel, pavement, or concrete and be at least 12 feet wide.\nBe constructed entirely at or above the elevation of highest point of the public street adjacent to the property.\n\n\nReplacement of an existing habitable building where the lowest floor is below the FPE with a new habitable building with the lowest floor above the FPE. Under this exemption, access from the new habitable building to the public street shall:\n\nConnect at the highest point of the public street adjacent to the property.\nBe constructed of gravel, pavement or concrete and be at least 12 feet wide.\nBe constructed entirely at or above the elevation of highest point of the public street adjacent to the property.\n\n\n\n\nE. FEMA Floodway and Community Encroachment AreaNo encroachments requiring an individual floodplain development permit per Section 27.5, including fill, new construction, substantial improvements, and other development shall be permitted unless the following conditions are met.\nFEMA Floodway\n\nEither of the following conditions shall be met:\n\nA floodway engineering analysis shall be provided by a North Carolina Professional Engineer and performed in accordance with standard engineering practice indicating that the encroachment would not result in any (0.00 feet) increase in the FEMA base flood elevations during the occurrence of a FEMA base flood and approved by the Floodplain Administrator; or\nA conditional letter of map revision (CLOMR) from FEMA shall be required prior to approval for any encroachment which would cause a rise in the FEMA base flood elevation during the occurrence of the FEMA base flood. A letter of map revision (LOMR) from FEMA shall be obtained within six months of completion of the project. Final approval, including certificates of occupancy, shall not be issued until a LOMR is issued.\n\n\nEncroachments into the FEMA floodway shall also meet the requirements of item 2 below.\n\n\nCommunity Encroachment Area\n\nEither of the following conditions shall be met:\n\nA floodway engineering analysis shall be provided by a North Carolina Professional Engineer and performed in accordance with standard engineering practice indicating that the encroachment would not result in increased flood heights of greater than 0.10 feet during the occurrence of a community base flood; or\nA community conditional letter of map revision (CoCLOMR) from the Floodplain Administrator is required for any change which would cause a rise of more than 0.10 foot in the community base flood elevation. Impacted property owners shall be notified prior to approval of a CoCLOMR. If approved and constructed, as-built plans shall be submitted and approved by the Floodplain Administrator and a CoLOMR issued within six months of completion of the project. Final approval, including certificates of occupancy shall not be issued until a CoLOMR has been issued.\n\n\nProjects impacting existing habitable buildings that increase the community base flood elevation more than 0.00 feet shall not be allowed without a variance per Section 27.6.\n\n\nTemporary EncroachmentsCertain temporary encroachments into the community encroachment area and/or the FEMA floodway may be exempt from meeting the requirements of items 1 and 2 above. Examples of temporary encroachments include, but are not limited to, sediment control devices including basins, check dams, diversions, temporary stream crossings, temporary haul roads/construction entrances, storage of equipment, and soil stockpiling. The following conditions shall be met to qualify for exemption:\n\nThe proposed encroachment shall not be in place more than three months and is renewable for up to one year with written approval from the Floodplain Administrator. Temporary sediment control devices may be kept in place longer than one year if required by the appropriate regulatory agency.\nSupporting documentation, including floodway engineering analyses (if required by the Floodplain Administrator) shall be submitted by a North Carolina Professional Engineer indicating that the proposed project shall not impact any existing habitable building or overtop any roadway surfaces.\nThe temporary encroachment shall require an individual floodplain development permit unless it is included in another individual floodplain development permit (IFDP).\n\n\nManufactured HomesA manufactured home shall be permitted in a FEMA Floodway or community encroachment area only in an existing manufactured home park or subdivision. No new manufactured homes, except for a replacement manufactured home, shall be placed in an existing manufactured home park or subdivision. A replacement manufactured home may be placed on a lot in an existing manufactured home park or subdivision provided the anchoring and the elevation standards of item G below are met.\nF. Additions/Improvements\nAdditions and/or improvements to noncompliant portions of pre-FIRM structures where the addition and/or improvements in combination with any interior modifications to the existing structure are:\n\nNot a substantial improvement. The addition or improvement shall:\n\nBe designed to minimize flood damages.\nNot have an enclosed area lower than that of the existing structure.\nNot add additional floodplain noncompliant area.\nBe constructed of flood resistant materials.\n\n\nA substantial improvement. Both the existing structure and the addition and/or improvements shall comply with the standards of both items A and B above.\n\n\nAdditions and/or improvements to post-FIRM structures where the addition and/or improvements in combination with any interior modifications to the existing structure are:\n\nNot a substantial improvement. The addition and/or improvements shall only comply with the standards for new construction.\nA substantial improvement. Both the existing structure and the addition and/or improvements shall comply with the standards of both items A and B above.\n\n\nAdditions to post-FIRM structures with no modifications to the existing structure other than a standard door in the common wall require only the addition to comply with the standards of both items A and B above.\nCustomary maintenance and/or repair are not considered additions and/or improvements.\nG. Manufactured Homes\nNew and replaced manufactured homes shall be elevated such that the lowest floor of the manufactured home is elevated at least to the FPE.\nManufactured homes shall be anchored to prevent flotation, collapse, or lateral movement either by certified engineered foundation system, or in accordance with the regulations for mobile homes and modular housing adopted by the North Carolina Commissioner of Insurance pursuant to N.C.G.S. § 143-143.15. Additionally, when the elevation would be met by raising the chassis at least 36 inches or less above the grade at the site, the chassis shall be supported by reinforced piers or other foundation elements of at least equivalent strength. When the elevation of the chassis is above 36 inches in height an engineering certification is required.\nAn evacuation plan shall be developed for evacuation of all residents of all new, substantially improved or substantially damaged manufactured home parks or subdivisions located within the special flood hazard area. This plan shall be filed with and approved by the Floodplain Administrator and the Charlotte-Mecklenburg Emergency Management Office Director.\nAll enclosures or skirting below the lowest floor shall meet the requirements of item C above.\nH. Recreational VehiclesRecreational vehicles shall either:\nBe on site for fewer than 180 consecutive days and be fully licensed and ready for highway use (a recreational vehicle is ready for highway use if it is on its wheels or jacking system, is attached to the site only by quick disconnect type utilities and has no permanently attached additions).\nMeet all the requirements of this article for new construction.\nI. Temporary StructuresPrior to issuance of a floodplain development permit for a temporary structure the following requirements shall be met.\nAll applicants shall submit to the Floodplain Administrator a plan for removal of such structure(s) in the event of a hurricane or flash flood notification. The plan shall include the following:\n\nA specified time period for which the temporary structure shall be permitted. The time specified may not exceed three months and is renewable up to one year.\nThe name, address, and phone number of the individual responsible for the removal of the structure.\nThe timeframe prior to the storm event by which the structure shall be removed.\nA copy of the contract or other suitable instrument with a trucking company to ensure the availability of removal equipment when needed.\nDesignation, accompanied by documentation, of a location outside the floodplain to which the temporary structure shall be removed.\n\n\nThe above information shall be submitted in writing to the Floodplain Administrator for review and written approval.\nJ. Accessory StructuresWhen accessory structures (e.g. sheds, detached garages, etc.) are to be placed in the community and/or FEMA special flood hazard area the following criteria shall be met.\nAccessory structures shall not be used for human habitation (including working, sleeping, living, cooking or restroom areas).\nAccessory structures shall be designed to have a low flood damage potential.\nAccessory structures shall be firmly anchored in accordance with Section 27.3.A.\nService facilities, including but not limited to electrical and mechanical facilities, shall be elevated in accordance with Section 27.3.E.\nAccessory structures shall have hydrostatic openings per item C above.\nAccessory structures greater than or equal to 150 square feet shall require an elevation or floodproofing certificate.\nAccessory structures shall not be temperature controlled.\nK. Parking SpacesThe lowest level of any parking space for new or substantially improved habitable buildings, excluding a single-family detached house, duplex, triplex, or quadraplex on a single parcel, shall be no more than 0.5 feet below the community base flood elevation. Exemption from the parking requirement is allowed if all of the following are met:\nReplacement of an existing habitable building where the lowest floor is below the FPE with a new habitable building with the lowest floor above the FPE.\nThe owner provides a flood warning system (including controls, flood warning sensors, visual/audio alarms, etc.) designed by a North Carolina Professional Engineer and approved by the Floodplain Administrator.\nThe owner provides a flood warning system maintenance plan that includes annual testing requirements approved by the Floodplain Administrator.\nThe owner provides a cabling system, or other restraint, designed by a North Carolina Professional Engineer to prevent off-site floatation of vehicles during a flood event that is approved by the Floodplain Administrator.\nA flood warning sign is posted with wording approved by the Floodplain Administrator.\nL. TanksWhen gas and liquid storage tanks are to be placed within a special flood hazard area, the following criteria shall be met:\nUnderground TanksUnderground tanks in flood hazard areas shall be anchored to prevent flotation, collapse or lateral movement resulting from hydrodynamic and hydrostatic loads during conditions of the community and/or FEMA base flood, including the effects of buoyancy assuming the tank is empty.\nAbove-Ground Tanks, ElevatedAbove-ground tanks in flood hazard areas shall be elevated to or above the FPE on a supporting structure that is designed to prevent flotation, collapse or lateral movement during conditions of the community and/or FEMA base flood. Tank-supporting structures shall meet the foundation requirements of the applicable flood hazard area.\nAbove-Ground Tanks, Not ElevatedAbove-ground tanks that do not meet the elevation requirements of item B above shall be permitted in flood hazard areas provided the tanks are designed, constructed, installed, and anchored to resist all flood-related and other loads, including the effects of buoyancy, during conditions of the community and/or FEMA base flood and without release of contents in the floodwaters or infiltration by floodwaters into the tanks. Tanks shall be designed, constructed, installed, and anchored to resist the potential buoyant and other flood forces acting on an empty tank during design flood conditions.\nTank Inlets and VentsTank inlets, fill openings, outlets and vents shall be:\n\nAt or above the FPE or fitted with covers designed to prevent the inflow of floodwater or outflow of the contents of the tanks during conditions of the community and/or FEMA base flood.\nAnchored to prevent lateral movement resulting from hydrodynamic and hydrostatic loads, including the effects of buoyancy, during conditions of the community and/or FEMA base flood.\n\n\nM. LeveesLevees shall be treated as development in the floodplain and are subject to all applicable sections of this article. Additionally, the following standards apply to levees:\nLevees shall not be constructed solely to protect vacant property from flooding.\nWith the exception of a levee that protects a building or feature that has to be located in the vicinity of a stream to be functional such as a stream monitor, water/sewer facility, or other uses approved by the Floodplain Administrator, proposed levees require the approval of the Director of Mecklenburg County Storm Water Services (hereinafter referred to as “Director”) regardless of their location within the floodplain.\nAn open house forum shall be held prior to consideration of approval of a proposed levee. The open house forum shall initiate a 30-day comment period for the Director to receive comments from the public. The open house forum shall be conducted by the owner of the proposed levee and the Director of Mecklenburg County Storm Water Services.\nOwners of land adjacent to a proposed levee shall be notified of the open house forum and be provided an opportunity to submit written comments during the 30 day comment period. Notification is to occur through regular mail, as well as a sign placed at a conspicuous place at the creek and along the public and private road(s) of the properties that would be protected by the proposed levee.\nAfter the end of the 30 day comment period, but no more than 60 days from the end of the comment period, the Director shall approve or disapprove the application or request more information from the owner of the levee. If the Director determines that the additional information is sufficiently significant, the Director may offer an additional 30 day comment period to all parties involved. Consistent with Section 27.6, the decision may be appealed to the UDO Board of Adjustment.\nRegardless of whether the proposed levee would meet FEMA certification requirements, floodplain lines and flood elevations shall not be modified on the landward side of the levee based on the location, performance and/or any other aspects of the levee.\nAn instrument shall be recorded in the chain of title for all parcels protected by a levee indicating the level of protection provided by the levee and the maintenance requirements as described in item 8.g below.\nLevee permitting requirements: Prior to the issuance of a floodplain development permit for construction of a proposed levee, the applicant shall submit the following information in writing to the Floodplain Administrator for review and written approval:\n\nPlans and/or specifications showing the location of the proposed levee is as far away from the adjacent creek as reasonably possible.\nA copy of the written approval for the levee received from the Director.\nVerification of notification to owners of land within 500 feet of the property lines of the parcel on which the proposed levee is to be located or within a distance equal to the length of the proposed levee, whichever is greater. Notification is also to include properties that are in the community special flood hazard area and within the hydraulic modeling limits as described by item e. below.\nCopies of all written comments received from property owners referenced above.\nIf the levee is proposed to be located within the community encroachment area, a floodway engineering analysis shall be provided by a North Carolina Professional Engineer and performed in accordance with standard engineering practice. In addition to the requirements of item E above the analysis shall also:\n\nShow no increase in water surface elevations on any existing habitable building using the current and future discharges for the 10-, 25-, 50-, and 100-year storm frequency flows.\nAccount for all feasible future levees in the area as deemed appropriate by the Floodplain Administrator.\n\n\nA copy of the contract with the entity responsible for construction of the proposed levee.\nA copy of the maintenance plan for the levee which has been certified by a North Carolina Professional Engineer includes a description of the process by which the levee shall be inspected annually, and provides for updated plans to be provided annually to property owners and residents intended to benefit from the levee.\n\n\nLevees constructed on a single parcel developed only with a single-family detached house are exempt from the requirements of items 2, 3, 4, 5, 7 and 8 above.\nN. FillProposed placement of fill within the special flood hazard area requires demonstration of compliance with Sections 9 and 10 of the Federal Endangered Species Act (ESA). The demonstration of compliance shall be provided to the Floodplain Administrator.O. Non-Conversion AgreementProperty owners shall be required to execute and record a non-conversion agreement prior to issuance of any building permit declaring that the area below the lowest floor shall not be improved, finished or otherwise converted to habitable space. The Floodplain Administrator shall have the right to inspect the enclosed area. The Floodplain Administrator may conduct annual inspections. This agreement shall be recorded with the Mecklenburg County Register of Deeds and shall transfer with the property in perpetuity. If a property which is bound by a non-conversion agreement is modified to remove enclosed areas below the FEMA base flood elevation (BFE), then the owner may request release of the restrictive covenant after staff inspection and submittal of confirming documentation.", "metadataJson": "{\"section_url\": \"/articles/article-27-floodplain-regulations/#274-specific-flood-hazard-reduction-standards\"}"}, {"title": "27.5 FLOODPLAIN DEVELOPMENT PERMITS AND CERTIFICATION REQUIREMENTS", "text": "A. Floodplain Regulations Technical Guidance DocumentThe Floodplain Administrator is authorized to create, and amend from time to time as necessary, a technical guidance document to help explain the application of the provisions of this article, specifically the floodplain development permit provisions, through the use of charts and related written materials. The Floodplain Regulations Technical Guidance Document (hereinafter referred to as “Technical Guidance Document”) shall not be a part of this article and shall be solely for illustrative and educational purposes. If there is any discrepancy between the Technical Guidance Document and this article, the provisions of this article shall control.B. Floodplain Development Permit RequiredA floodplain development permit shall be required for any development within the community special flood hazard area and is subject to the conditions below.C. Floodplain Development Permit TypesFloodplain development permits fall into one of two types: general floodplain development permits (GFDP), and individual floodplain development permits (IFDP). If the proposed development activities meet the requirements of the GFDP, an IFDP shall not be required.\nGeneral Floodplain Development PermitThe intent of the GFDP is to allow uses or activities in the community special flood hazard area, including the FEMA floodway and community encroachment area, which inherently shall not increase FEMA and/or community base flood elevations. The following uses and activities are permitted under a GFDP, without the need for an IFDP, Floodway Engineering Analysis, or variance, as long as they result in no technically measurable increases (as defined herein) in FEMA and/or Community Base Flood Elevations. A No-Rise Certification may be required by the Floodplain Administrator to demonstrate no technically measurable increases. Process for submittal are available in the Technical Guidance Document.\n\nGeneral farming, pasture, horticulture, forestry, wildlife sanctuaries, gardens, lawns, landscaping, mulch 12 inches or less in depth, and other similar activities.\nUtility infrastructure (poles, sewer manholes, vent pipes, underground utilities, etc.), sign poles, non-solid fences, and other similar activities.\nOn-grade driveways, trails, sidewalks, bicycle infrastructure (including, but not limited to, bicycle lanes, bicycle paths, cycletracks, multi-use paths, greenways, bicycle parking/corrals, and bicycle share stations), boardwalks, roads and road maintenance, storm drainage system construction (including repairs and maintenance to either major or minor systems), and other similar activities. The Floodplain Administrator shall be notified in writing, including a project description and sketch plan, prior to commencement of these activities.\nInterior renovations with a value of less than $10,000 to a structure with its lowest floor below the FPE. The renovations shall meet the requirements of Section 27.4.F.\nInterior renovations of any value, to a structure with its lowest floor at or above the FPE. The renovations shall meet the requirements of Section 27.4.F.\n\n\nIndividual Floodplain Development PermitsIFDPs are required for all projects that do not meet the requirements of a GFDP. Application for an IFDP shall be made by a person with a property interest in the property or with a contract to purchase the property (or their agent) to the Floodplain Administrator on the necessary forms prior to any development activities proposed to be located within the community special flood hazard area. Requirements for submittal are available in the Technical Guidance Document.\nD. Certification Requirements\nA Final As-Built Elevation Certificate (FEMA Form 086-0-33), for both residential or nonresidential buildings, is required after construction is completed and prior to Certificate of Occupancy or Temporary Certificate of Occupancy (CO or TCO).  It shall be the duty of the permit holder to submit to the Floodplain Administrator a certification of final as-built construction of the elevation of the reference level and all attendant utilities. Said certification shall be prepared by or under the direct supervision of a North Carolina Professional Land Surveyor or North Carolina Professional Engineer and certified by same. The Floodplain Administrator shall review the certificate data submitted. Deficiencies detected by such review shall be corrected by the permit holder immediately and prior to CO or TCO issuance. In some instances, another certification may be required to certify corrected as-built construction. Failure to submit the certification or failure to make required corrections shall be cause to withhold the issuance of a CO or TCO.\nA Floodproofing Certificate (FEMA Form 086-0-34) (for nonresidential buildings when utilized) with supporting data, an operational plan, and an inspection and maintenance plan is required after construction is completed and prior to the issuance of a Certificate of Occupancy or a Temporary Certificate of Occupancy (CO or TCO).  It shall be the duty of the permit holder to submit to the Floodplain Administrator a certification of the floodproofed elevation of the reference level and all attendant utilities. When floodproofing is utilized, said certification, operational plan, and inspection and maintenance plan shall be prepared by or under the direct supervision of a North Carolina Professional Engineer or North Carolina Licensed Architect and certified by same. The Floodplain Administrator shall review the certificate data, operational plan, and inspection and maintenance plan submitted. Deficiencies detected by such review shall be corrected by the permit holder immediately and prior to the issuance of a CO or TCO.  In some instances, another certification may be required to certify corrected as-built construction. Failure to submit the certification or failure to make said corrections required shall be cause to withhold the issuance of a CO or TCO.\nFor proposed development in the community or FEMA special flood hazard area but outside of the community encroachment area and the FEMA floodway, a certification from a North Carolina Professional Land Surveyor or North Carolina Professional Engineer that states that no fill material or other development was placed within the FEMA floodway or community encroachment area of any watercourse shall be required prior to issuance of a CO or TCO.\nFor proposed development within the community encroachment area or the FEMA Floodway, an as-built topographic map prepared by a North Carolina Professional Land Surveyor or North Carolina Professional Engineer shall be required prior to issuance of a CO or TCO. This is in addition to a Floodway Engineering Analysis or CLOMR that may be required as specified in Section 27.4.E.\nIf a manufactured home is placed within the floodplain and the elevation of the chassis is 36 inches or higher above adjacent grade, an engineered foundation certification is required.\nCertification exemptions: The following structures, if located within the floodplain, are exempt from the elevation/floodproofing certification requirements specified in items A and B above:\n\nRecreational vehicles meeting requirements of Section 27.4.H.\nRecreational vehicles meeting requirements of Section 27.4.H.\nAccessory structures less than 150 square feet meeting requirements of Section 27.4.J.\n\n\nE. Permit Application Requirements\nA plot plan drawn to scale which shall include, but is not limited to, the following specific details of the proposed floodplain development:\n\nThe nature, location, dimensions, and elevations of the area of development/disturbance; existing and proposed structures, utility systems, grading/pavement areas, fill materials, storage areas, drainage facilities, and other development.\nThe location of the community flood fringe line, community encroachment line, FEMA flood fringe line and FEMA floodway line as shown on the FIRM or other flood map, or a statement that the entire lot is within the special flood hazard area.\nFlood zone(s) designation of the proposed development area as determined on the FIRM or other flood map.\nThe FEMA base flood elevation, community base flood elevation, and FPE.\nThe existing and proposed location of any watercourse that will be altered or relocated as a result of proposed development.\nCertification of the plot plan by a North Carolina Professional Land Surveyor or North Carolina Professional Engineer as deemed necessary by the Floodplain Administrator.\n\n\nProposed elevations of all development within a community or FEMA special flood hazard area shall be submitted, including but not limited to:\n\nElevation in relation to North American Vertical Datum as Corrected in 1988 (NAVD 88) of the proposed reference level, including basement, of all structures.\nElevation in relation to NAVD 88 to which any nonresidential structure in Zone AE as shown on the FIRM, shall be floodproofed.\nElevation in relation to NAVD 88 to which any proposed utility systems shall be elevated or floodproofed.\n\n\nIf floodproofing, a floodproofing certificate (FEMA Form 086-0-34) with supporting data and an inspection and operational plan that includes, but is not limited to, installation, exercise, and maintenance of floodproofing measures.\nA foundation plan, drawn to scale, which shall include details of the proposed foundation system to ensure all provisions of Article 27 are met. These details include but are not limited to:\n\nThe proposed method of elevation, if applicable (i.e., fill, solid foundation perimeter wall, solid backfilled foundation, open foundation on columns/posts/piers/piles/shear walls).\nOpenings to facilitate automatic equalization of hydrostatic flood forces on walls when solid foundation perimeter walls are used in community special flood hazard area per Section 27.4.C.\nUsage details of any enclosed areas below the lowest floor.\nPlans and/or details for the protection of public utilities and facilities such as sewer, gas, electrical, and water systems to be located and constructed to minimize flood damage.\nCertification that all other federal, state, and local permits required prior to floodplain development permit issuance have been received.\nDocumentation for proper placement of recreational vehicles and/or temporary structures, when applicable, to ensure that the provisions of Sections 27.4.H and 27.4.I are met.\nA description of proposed alteration of a watercourse, when applicable, including an engineering report on the effects of the proposed project on the flood-carrying capacity of the watercourse and the effects to properties located both upstream and downstream; and a map, if not shown on plot plan, showing the location of the proposed alteration of the watercourse.\n\n\nIf placing fill within the special flood hazard area, a demonstration of compliance with Sections 9 and 10 of the Federal Endangered Species Act (ESA) is required.  The demonstration of compliance shall be provided to the Floodplain Administrator.\nF. Permit RequirementsThe IFDP shall include, but not be limited to:\nA description of the development to be permitted under the floodplain development permit.\nThe special flood hazard area determination for the proposed development.\nThe FPE required for the reference level and all attendant utilities.\nThe FPE required for the protection of all public utilities.\nAll certification submittal requirements with timelines.\nA statement that no fill material or other development shall encroach into the community encroachment area or FEMA floodway of any watercourse unless the requirements of Section 27.4.E are met.\nThe flood openings requirements per Section 27.4.C.\nA statement that all construction materials below the FPE shall be constructed entirely of flood-resistant materials.\nG. Expiration of Individual Floodplain Develop PermitsIndividual floodplain development permits expire two years after the date of issuance unless:\nThe work has commenced within two years after the date of issuance, or\nThe issuance of the permit is legally challenged, in which case the permit is valid for two years after the challenge has been resolved, or\n", "metadataJson": "{\"section_url\": \"/articles/article-27-floodplain-regulations/#275-floodplain-development-permits-and-certification-requirements\"}"}, {"title": "27.6 ADMINISTRATION", "text": "\nAppeals and variances of this article shall be subject to Article 37.\nInspections and enforcement actions of this article shall be subject to Article 39.\n", "metadataJson": "{\"section_url\": \"/articles/article-27-floodplain-regulations/#276-administration\"}"}, {"title": "27.7 FLOODPLAIN ADMINISTRATOR", "text": "A. DesignationThe Stormwater Administrator is hereby designated as the Floodplain Administrator. If designated to Mecklenburg County, the administration, implementation, and the enforcement of the provisions of this article shall be allocated through a properly executed, legally binding interlocal agreement.B. Duties and ResponsibilitiesThe Floodplain Administrator is authorized to and shall perform, but not be limited to, the following duties:\nReviewing, approving, and issuing all floodplain development permits in a timely manner to assure that the permit requirements of this article have been satisfied.\nReviewing, approving, and issuing all documents applicable to letters of map change.\nAdvising the permittee that additional federal or state permits may be required. If specific federal or state permits are known, requiring that copies of such permits be provided and maintained on file with the floodplain development permit.\nNotifying adjacent communities and the State Department of Crime Control and Public Safety, Division of Emergency Management, State Coordinator for the National Flood Insurance Program prior to any alteration of a watercourse and submitting evidence of such notification to the Federal Emergency Management Agency.\nAssuring that within available resources, maintenance is provided within the altered or relocated portion of any altered watercourse so that the flood-carrying capacity is maintained.\nNot issuing a floodplain development permit for encroachments within the community encroachment area and/or the FEMA floodway unless the certification and flood hazard reduction provisions of Sections 27.3 and 27.4 are met.\nReviewing and recording the actual elevation (in relation to NAVD 88) of the reference level (including basement) of all new or substantially improved structures, in accordance with Section 27.5.\nReviewing and recording the actual elevation (in relation to NAVD 88) to which the new or substantially improved nonresidential structures have been floodproofed, in accordance with Section 27.5.\nObtaining certifications from a North Carolina Professional Engineer or North Carolina Licensed Architect in accordance with Section 27.4.B when floodproofing is utilized for a particular nonresidential structure.\nMaking the interpretation of the exact location of boundaries within the FEMA special flood hazard area or the community special flood hazard area when, for example, where there appears to be conflict between a mapped boundary and actual field conditions. The person contesting the location of the boundary shall be given a reasonable opportunity to appeal the interpretation. Procedures for changing flood hazard area boundaries and lines depicted on the flood insurance rate maps are identified in the national flood insurance program regulations (44 CFR Parts 59-78).\nPermanently maintaining all records that pertain to the administration of Article 27 and making these records available for public inspection, recognizing that such information may be subject to the Privacy Act of 1974, as amended.\nMaking on-site inspections of projects and areas not open to the public within the territorial jurisdiction of the Storm Water Services Department pursuant to Article 39.\nServing notices of violation, issuing stop work orders, revoking permits, and taking corrective actions.\nMaintaining a copy of the letter of map amendment issued from FEMA when a property owner has received a letter of map amendment (LOMA). A LOMA is typically applied for and approved when the exact location of boundaries of the FEMA special flood hazard area conflicts with the current, natural topography information at the site.\nDetermining the required information to be submitted with an application for approval of an IFDP.\nReviewing information provided by a property owner or their agent for the purpose of making a determination of the total cost of repairs as it relates to a substantial improvement, including a determination of whether a series of repairs, reconstructions or improvements constitute one single alteration such that the total cost of the repairs, reconstructions, or improvements shall be the cumulative cost from the first alteration.\nReviewing information provided by a property owner or their agent for the purpose of making a determination of whether the proposed construction activities constitute new construction for purposes of Article 27.\nReviewing and acknowledging FEMA conditional letters of map revision and FEMA letters of map revision.\nReviewing and approving community conditional letters of map revision and community letters of map revision.\nMaking on-site inspections of work in progress. As the work pursuant to a floodplain development permit progresses, the Floodplain Administrator shall make as many inspections of the work as may be necessary to ensure that the work is being done according to the provisions of the floodplain regulations and the terms of the permit.\nOrdering work to be immediately stopped, pursuant to Article 39, whenever a building or part thereof is being constructed, reconstructed, altered or repaired in violation of this chapter. The stop-work orders shall be issued and enforced pursuant to Section 39.2.\nRevoking and requiring the return of the floodplain development permit by notifying the permit holder in writing stating the reason for the revocation. Permits shall be revoked for any substantial departure from the approved application, plans or specifications; for refusal or failure to comply with the requirements of state or local laws; or for false statements or misrepresentation made in securing the permit. Any permit mistakenly issued in violation of an applicable state or local law may also be revoked. Revoked permits may be resubmitted for approval using the requirements of the floodplain regulations in effect at the time of the original submittal unless they were revoked because of the intentional submission of incorrect information by the permittee or their agent, or under other circumstances where allowing resubmittal using the requirement of this article in effect at the time of the original submittal would not be equitable or consistent with public policy. However, base flood elevations that govern the elevation to which the structure is built shall comply with the regulations and flood elevations in effect at the time of application for the building permit.\nProviding owners of structures in the floodplain with information concerning their flood risk, and (for structures with the lowest floor below the FPE) inform potential buyers of substantial improvement restrictions through the recordation of a notice in the property chain of title filed with the Register of Deeds for Mecklenburg County or other similar notice including a notice of Substantial Damage. Should the conditions that gave rise to the recordation of a notice of substantial improvement restrictions or a notice of Substantial Damage cease to exist, the administrator shall have the right, and upon receipt of a written request from the property owner the duty, to record a notice to that effect.\nObtaining actual elevation (in relation to NAVD 88) of the reference level (including basement) and all attendant utilities of all new and substantially improved structures, in accordance with the provisions of Section 27.5.\nObtaining actual elevation (in relation to NAVD 88) of all public utilities in accordance with the provisions of Section 27.5.\nMaintaining a current map repository to include, but not limited to, historical and effective FIS report, historical and effective FIRM and other official flood maps and studies adopted in accordance with the provisions of this article, including any revisions thereto including Letters of Map Change, issued by FEMA.\nNotify state and FEMA of mapping needs.\n", "metadataJson": "{\"section_url\": \"/articles/article-27-floodplain-regulations/#277-floodplain-administrator\"}"}, {"title": "27.8 DEFINITIONS", "text": "The definitions of this section apply only to this article. Unless specifically defined in this section, other words or phrases used in this article are as defined in Article 2 for general definitions or Article 15 for use definitions. In the case of a conflict between a term defined in Article 2 or Article 15 and this article, the definition in this section controls.\nAccessory Structure. A structure which is located on the same parcel of property as the principal structure and the use of which is incidental to the use of the principal structure. Garages, carports, and storage sheds are common urban accessory structures. Pole barns, hay sheds, and similar qualify as accessory structures on farms and may or may not be located on the same parcel as the farm dwelling or shop building.\nAddition (to an Existing Building). An extension or increase in the floor area or height of a building or structure.\nBasement. Any area of the building having its floor subgrade (below ground level) on all sides where the next higher floor is more than five feet above the subgrade floor or the subgrade floor is more than two feet below ground level.\nBuilding. Any structure built for support, shelter, or enclosure for any occupancy or storage.\nChemical Storage Facility. A building, portion of a building, or exterior area adjacent to a building used for the storage of any chemical or chemically reactive products.\nCommunity Base Flood. The flood, determined using future land use conditions, having a 1% chance of being equaled or exceeded in any given year.\nCommunity Base Flood Elevation. The water surface elevation shown on the flood insurance rate map and in the flood insurance study, having a 1% chance of being equaled or exceeded in any given year, determined using future land use conditions.\nCommunity Conditional Letter of Map Revisions (CoCLOMR). A letter from the Floodplain Administrator that provides conditional approval of a study that proposes to change the location of the community encroachment lines, and/or the location of the community flood fringe line, and/or community base flood elevations.\nCommunity Encroachment Area or Community Floodway. The channel of a stream or other watercourse and the adjacent land areas that shall be reserved in order to discharge the FEMA base flood without cumulatively increasing the water surface elevation more than 0.1 foot.\nCommunity Encroachment Lines. The lateral limits of the community encroachment area, within which, in the direction of the stream or other body of water, no structure or fill may be added, unless specifically permitted by this article.\nCommunity Flood Fringe Area. The land area located between the community encroachment line and the community flood fringe line.\nCommunity Flood Fringe Line. The line that depicts the outer limits of the community flood fringe area (outer limits of the community special flood hazard area).\nCommunity Letter of Map Revision (CoLOMR). A letter from the Floodplain Administrator that provides final approval of a study, based on as-built conditions, that changes the location of the community encroachment lines and/or the community flood fringe lines.\nCommunity Special Flood Hazard Area or Community Floodplain. The land subject to a 1% or greater chance of flooding in any given year from a community base flood. It includes the FEMA floodway, community encroachment area, FEMA flood fringe area, and the community flood fringe area.\nConditional Letter of Map Revision (CLOMR). A formal review and comment as to whether a proposed project complies with the minimum National Flood Insurance Program (NFIP) requirements for such projects with respect to delineation of special flood hazard areas. A CLOMR does not revise the effective Flood Insurance Rate Map or Flood Insurance Study; upon submission and approval of certified as-built documentation, a Letter of Map Revision may be issued by FEMA to revise the effective FIRM.\nCritical Facility. A building used to house a function that is vulnerable or essential to the community. Uses include, but are not limited to, child and adult daycare facilities, nursing homes, schools, hospitals, fire, police, and medic facilities, and other uses as deemed by the Floodplain Administrator.\nDevelopment. Any manmade change to improved and unimproved real estate, including, but not limited to, buildings or other structures, mining, dredging, filling, grading, paving, excavating, drilling operations, or storage of equipment or materials.\nDisposal. As defined in N.C.G.S. § 130A-290(a)(6), the discharge, deposit, injection, dumping, spilling, leaking, or placing of any solid waste into or on any land or water so that the solid waste or any constituent part of the solid waste may enter the environment or be emitted into the air or discharged into any waters, including groundwaters.\nDry Public Street. A public street at the intersection of an existing or proposed driveway where the surface of the pavement is at an elevation above the community base flood elevation.\nDryland Access. A gravel, paved, or concrete access route, at least 12 feet wide, which is above the community base flood elevation and connects a habitable building to a dry public street.\nEffective Date. The date flood insurance rate maps and flood insurance studies for a community are officially approved by FEMA and are to be used for local regulation and for compliance with NFIP sanctions.\nElevated Building. A non-basement building built to have the lowest floor elevated above the ground level by solid foundation perimeter walls, pilings, columns (posts and piers), or shear walls.\nEncroachment. The advance or infringement of uses, fill, excavation, buildings, permanent structures, or development into a floodplain, which may impede or alter the flow capacity of a floodplain. Building renovations contained within the existing building footprint area are not considered an encroachment.\nExisting Building and Existing Structure. Any building and/or structure for which the “start of construction” commenced before the effective date of the initial Flood Insurance Rate Map.\nExisting Manufactured Home Park or Manufactured Home Subdivision. A parcel or contiguous parcels of land divided into two or more manufactured home lots for rent or sale for which the construction of facilities for servicing the lot on which the manufactured home is to be affixed including, at a minimum, the installation of utilities, either final site grading or the pouring of concrete pads and the construction of streets, was completed before November 27, 1972.\nFEMA. The Federal Emergency Management Agency.\nFEMA Base Flood. The flood, determined using land use conditions at the time of the study, having a 1% chance of being equaled or exceeded in any given year.\nFEMA Base Flood Elevation (BFE). The water surface elevation shown on the flood insurance rate map and in the flood insurance study. Having a 1% chance of being equaled or exceeded in any given year, determined using land use conditions present at the time of the study.\nFEMA Flood Fringe Area. The land area located between the FEMA floodway lines and the line depicting the maximum elevation subject to inundation by the FEMA base flood as defined herein.\nFEMA Flood Fringe Line. The line on a map that depicts the outer limits of the FEMA flood fringe area.\nFEMA Floodway. The channel of a river or other watercourse and the adjacent land areas that shall be reserved in order to discharge the FEMA base flood, without cumulatively increasing the water surface elevation more than 0.5 foot. On the Catawba River, the FEMA floodway means the channel of a stream or other watercourse and the adjacent land areas that shall be reserved in order to discharge the FEMA base flood, without cumulatively increasing the water surface elevation more than 1.0 feet.\nFEMA Floodway Lines. The lateral limits of the FEMA floodway.\nFEMA Special Flood Hazard Area or FEMA Floodplain. The land subject to a 1% or greater chance of flooding in any given year from a FEMA base flood. It includes the FEMA floodway, community encroachment area, and the FEMA flood fringe area.\nFlood or Flooding. A general and temporary condition of partial or complete inundation of normally dry land areas from:\n\nThe overflow of inland or tidal waters; and/or\nThe unusual and rapid accumulation of run-off of surface waters from any source.\n\nFlood Insurance. The insurance coverage provided under the National Flood Insurance Program (NFIP).\nFlood Insurance Rate Map (FIRM). An official map of a community, in both digital and printed format, on which the Federal Emergency Management Agency has delineated the special flood hazard area and the risk premium zones applicable to the community. The date of Charlotte’s original FIRM is August 15, 1978 and this date should be used to determine whether a structure is pre-FIRM or post-FIRM.\nFlood Insurance Study. An examination, evaluation, and determination of special flood hazard areas, corresponding water surface elevations, flood insurance risk zones, and other flood data in a community. The study includes a flood insurance study report, and/or flood insurance rate map (FIRM).\nFlood-Resistant Material. Any building product [material, component or system] capable of withstanding direct and prolonged contact (minimum 72 hours) with floodwaters without sustaining damage that requires more than low-cost cosmetic repair. Any material that is water-soluble or is not resistant to alkali or acid in water, including normal adhesives for above-grade use, is not flood-resistant. Pressure-treated lumber or naturally decay-resistant lumbers are acceptable flooring materials. Sheet-type flooring coverings that restrict evaporation from below and materials that are impervious, but dimensionally unstable are not acceptable. Materials that absorb or retain water excessively after submergence are not flood-resistant. Please refer to Technical Bulletin 2, Flood Damage-Resistant Materials Requirements, and available from the FEMA. Class 4 and 5 materials, referenced therein, are acceptable flood-resistant materials.\nFloodplain Development Permit. Either an individual floodplain development permit or a general floodplain development permit issued for development in the floodplain.\nFloodplain Management. The operation of an overall program of corrective and preventive measures for reducing flood damage and preserving and enhancing, where possible, natural resources in the floodplain.\nFloodplain Regulations Technical Guidance Document or Technical Guidance Document. A document developed by Charlotte-Mecklenburg Storm Water Services Staff to more clearly explain the application of the provisions of this article, specifically the floodplain development permit provisions, through the use of charts and related written materials. The technical guidance document shall not be a part of this article, and shall be solely for illustrative and educational purposes. If there is any discrepancy between the technical guidance document and this article, the provisions of this article control.\nFloodproofing. Any combination of structural and nonstructural additions, changes, or adjustments to structures, which reduce or eliminate risk of flood damage to real estate or improved real property, water and sanitation facilities, or structures with their contents.\nFlood Protection Elevation or FPE. The elevation to which all structures located within the community special flood hazard area FEMA special flood hazard area shall be elevated or floodproofed if nonresidential. This elevation is the community base flood elevation plus two feet of freeboard until such time as the Community Special Flood Hazard Area is mapped using new future conditions criteria. When new maps are issued, the elevation shall be the Community Base Flood Elevation plus one foot, except along the Catawba River, including Lake Wylie and Mountain Island Lake where it is the FEMA base flood elevation plus two feet of freeboard.\nFloodwall. A wall built along a shore or bank to protect an area from flooding.\nFloodway. Either the FEMA floodway or the community encroachment area, including the area above a bridge or culvert when applicable.\nFloodway Engineering Analysis. An engineering analysis of the impact that a proposed encroachment into a floodway is expected to have on the floodway boundaries and flood levels during the occurrence of the base flood discharge. This analysis shall include all proposed fill within the special flood hazard area. The evaluation shall be prepared by a North Carolina Professional Engineer using standard engineering methods and models.‍\nFlood Zone. A geographical area shown on a flood insurance rate map that reflects the severity or type of flooding in the area.‍\nFloor. See Lowest Floor.‍\nFreeboard. The height added to the community base flood elevation (BFE) or FEMA BFE on the Catawba River to account for the many unknown factors that could contribute to flood heights greater that the height calculated for a selected size flood and floodway conditions, such as wave action, blockage of bridge openings, and the hydrological effect of urbanization of the watershed.\nFunctionally Dependent Facility. A facility that cannot be used for its intended purpose, unless it is located or carried out in close proximity to water, limited to a docking or port facility necessary for the loading and unloading of cargo or passengers, shipbuilding, ship repair, or seafood processing facilities. The term does not include long-term storage, manufacture, sales, or service facilities.\n‍General Floodplain Development Permit (GFDP). A permit issued for certain types of development in the floodplain.\nHabitable Building. A structure designed primarily for, or used for, human habitation. This includes, but is not limited to, houses, condominiums, townhouses, restaurants, retail establishments, manufacturing buildings, commercial buildings, office buildings, manufactured homes, and similar uses. It does not include accessory structures, as defined in this section.\nHazardous Waste Management Facility. A facility for the collection, storage, processing, treatment, recycling, recovery, or disposal of hazardous waste as defined in N.C.G.S. Chapter 130A, Art. 9.\nHighest Adjacent Grade. The highest natural elevation of the ground surface, prior to construction, next to the proposed walls of the structure.\nHistoric Structure. Any structure that is one of the following:\n\nListed individually in the National Register of Historic Places (a listing maintained by the US Department of Interior) or preliminarily determined by the secretary of interior as meeting the requirements for individual listing on the national register.\nCertified or preliminarily determined by the secretary of interior as contributing to the historical significance of a registered historic district or a district preliminarily determined by the secretary to qualify as a registered historic district.\nIndividually listed on a local inventory of historic landmarks in communities with a certified local government (CLG) program.\nCertified as contributing to the historical significance of a historic district designated by a community with a “Certified Local Government (CLG) Program.” Certified local government (CLG) programs are approved by the US Department of the Interior in cooperation with the North Carolina Department of Cultural Resources through the state Historic Preservation Officer as having met the requirements of the National Historic Preservation Act of 1966 as amended in 1980.\n\nIndividual Floodplain Development Permit (IFDP). A permit for development in the floodplain that involves activities not listed in Section 27.5 and may not qualify for a GFDP.‍\nLetter of Map Revision (LOMR). An official revision to the current effective FEMA FIRM based on as-built conditions and/or more accurate data. It is issued by FEMA and may change FEMA base flood elevations, the location of the FEMA floodway lines and/or the location of the FEMA flood fringe line.‍\nLetter of Map Amendment (LOMA). A letter from FEMA that officially removes a property or building from the FEMA special flood hazard area (SFHA) that was inadvertently shown in the SFHA on the FIRM.‍\nLetter of Map Revision Based on Fill (LOMR-F). A determination that a structure or parcel of land has been elevated by fill above the BFE and is, therefore, no longer located within the special flood hazard area. In order to qualify for this determination, the fill shall have been permitted and placed in accordance with the community’s floodplain management regulations.‍\nLevee. A manmade structure, usually an earthen embankment, floodwall, or a combination of both that is designed and constructed to contain, control, or divert the flow of water so as to provide protection from temporary flooding.\nLevee System. A flood protection system which consists of levee(s) and/or floodwall(s) and associated structures, such as closure and drainage devices.‍\nLight Duty Truck. Any motor vehicle rated at 8,500 pounds Gross Vehicular Weight Rating or less which has a vehicular curb weight of 6,000 pounds or less and which has a basic vehicle frontal area of 45 square feet or less as defined in 40 CFR 86.082-2 and is:\n\nDesigned primarily for purposes of transportation of property or is a derivation of such a vehicle; or\nDesigned primarily for transportation of persons and has a capacity of more than 12 persons; or\nAvailable with special features enabling off-street or off-highway operation and use.\n\nLowest Adjacent Grade (LAG). The elevation of the ground, sidewalk, or patio slab immediately next to the building, or deck support, after completion of the building.\nLowest Floor. The lowest floor of the lowest enclosed area, including the basement. An unfinished (no encapsulated walls or temperature-controlled areas) or flood-resistant enclosure, usable solely for parking of vehicles, building access, or storage in an area other than a basement area, is not considered a building’s lowest floor provided that such enclosure is not built so as to render the structure in violation of the applicable non-elevation design requirements of this article.\nManufactured Home. A structure, transportable in one or more sections, which is built on a permanent chassis and designed to be used with or without permanent foundation when connected to the required utilities. Manufactured home does not include a recreational vehicle\nMarket Value. The value of a building, excluding land value, that is determined by an appraiser certified in North Carolina using the cost approach method. Use of the “income capitalization approach” is not acceptable. Market value shall be determined based on the building condition prior to “start of construction” for proposed improvements or before damage occurred for damage repair. The value of the land and site improvements (landscaping, driveways, detached accessory structures, etc.) is not included. The values of the use and occupancy (business income) are not included. The Floodplain Administrator may use the tax value of the building in lieu of other methods described herein.\nMarket value also means the actual cash value (ACV) of a building minus depreciation. Actual cash value is the cost to replace a building on the same parcel with a new building of like-kind quality, minus depreciation due to age, use, and neglect. ACV does not consider loss in value mainly due to outmoded design or location factors. Depreciation accounts for the physical condition of a structure. Depreciation does not take into account functional obsolescence or factors that are external to the structure.\nNational Flood Insurance Program (NFIP). A federal program that provides insurance coverage for flood damage to qualified buildings in communities that agree to adopt and enforce regulations that meet or exceed FEMA requirements to reduce the risk of flooding.\nNew Construction. Construction of a replacement structure commenced after total demolition, or renovation/rehabilitation of an existing structure that results in the partial or complete removal of two external walls and has a total cost equal to or exceeding 50% of the market value of the structure before the “start of construction” of the improvement.\nFor flood insurance purposes, new construction also means structures for which the “start of construction” commenced on or after August 15, 1978, and includes subsequent improvements to such structures. See Flood Insurance Rate Map as defined in this section.\nNew Manufactured Home Park or Subdivision. A manufactured home park or subdivision for which the construction of facilities for servicing the lots on which the manufactured homes are to be affixed, including at a minimum, the installation of utilities, the construction of streets, and either final site grading or the pouring of concrete slab, is completed on or after November 27, 1972.\nNFIP. National Flood Insurance Program.\nNoncompliant Building or Use. Any legally existing building or use which fails to comply with the provisions of this article.\nNon-Conversion Agreement. An instrument stating that the owner shall not convert or alter what has been constructed and approved. Violation of the agreement is considered a willful violation of the floodplain regulations and, therefore, subject to the same enforcement procedures and penalties. The agreement shall be filed with the recorded deed for the property. The agreement shall show the clerk’s or recorder’s stamps and/or notations that the filing has been completed.\nNon-Solid Fence. A fence with at least 75% open area and with vertical supports each no more than 25 square inches in cross-sectional area.\nNo-Rise Certification. A certification statement signed by a North Carolina Professional Engineer licensed to practice in the State of North Carolina certifying that a proposed Project shall not impact the FEMA Base Flood Elevations or the Community Base Flood Elevations at modeled cross-sections in the vicinity of the proposed Project.\nNorth American Vertical Datum as Corrected in 1988 (NAVD 88). A vertical control used as a reference for establishing varying elevations within the floodplain. If a datum other than NAVD 88 is used then use the datum listed as the reference datum on the applicable FIRM panel for use on elevation certificate completion. See Flood Insurance Administration (FIA)-20 parts 1, 8.\nOpen House Forum. A public meeting held by the owner of the proposed levee and the Director of Mecklenburg County Storm Water Services. The purpose of the open house forum is to provide an opportunity for discussion between the owner that has submitted an application for the construction of a levee, nearby property owners, and other interested parties.\nPlot Plan. A scaled drawing of a parcel of land showing the location of significant natural features and existing and proposed manmade features.\nPost-FIRM. Construction or other development for which the “start of construction” occurred on or after the effective date of the initial flood insurance rate map.\nPre-FIRM. Construction or other development for which the “start of construction” occurred before the effective date of the initial flood insurance rate map.\nPreliminary Flood Insurance Rate Map (PFIRM). A map(s) released by the Federal Emergency Management Agency (FEMA) for public comment prior to the effective date of the FIRM as established by FEMA. The map may be in both digital and printed format and shows the community and FEMA special flood hazard areas, community encroachment areas and FEMA floodways, FEMA and community base flood elevations, flood insurance risk premium zones, and other data. The data and maps are subject to change prior to the effective date.\nPreliminary Flood Insurance Study (PFIS). A narrative report released by the Federal Emergency Management Agency for public comment prior to the effective date. Information contained in the PFIS includes a description of past flooding and studies, the study area, engineering methods, community, and FEMA base flood elevations, other community and FEMA flood data. The flood insurance rate maps are also included as part of the flood insurance study. The data and maps are subject to change prior to the effective date.\nPrincipally Above Ground. At least 51% of the actual cash value (ACV) of the structure is above ground.\nProject. A development activity that is physically separate, functionally independent, and not constructed at the same time as another development activity.\nPublic Safety and/or Nuisance. Anything which is injurious to the safety or health of an entire community or neighborhood, or any considerable number of persons, or unlawfully obstructs the free passage or use, in the customary manner, of any navigable lake, river, bay, stream, canal, or basin.\nRecreational Vehicle. A vehicle which is:\n\nBuilt on a single chassis.\nFour hundred square feet or less when measured at the largest horizontal projection.\nDesigned to be self-propelled or permanently towable by a car or light duty truck.\nDesigned primarily not for use as a permanent dwelling, but as temporarily living quarters for recreational, camping, travel, or seasonable use.\nFully licensed and ready for highway use.\n\nReference Level. The top of the lowest floor, for regulatory purposes, of structures in the FEMA and/or community special flood hazard area.\nRemedy a Violation. To bring the structure or other development into compliance with this article or, if this is not possible, to reduce the impacts of its noncompliance. Ways that impact may be reduced include protecting the structure or other affected development from flood damages, implementing the enforcement provisions of this article or otherwise deterring future similar violations, or reducing federal financial exposure with regard to the structure or other development.\nRepetitive Loss. Flood-related damages sustained by a structure during any ten year period for which the total cost of repairs equals or exceeds 50% of the market value of the structure before the damage occurred. Repetitive loss damages include flood-related damages sustained prior to November 16, 2018 for which the cost of repairs equaled or exceeded 25% of the market value of the structure before the damage occurred if within the relevant ten year period.\nRiverine. Relating to, formed by, or resembling a river (including tributaries), stream, brook, etc.\nSalvage Yard. Any nonresidential property used for the storage, collection, and/or recycling of any type of equipment, and including but not limited to vehicles, appliances and related machinery.\nSolid Waste Disposal Facility. Any facility involved in the disposal of solid waste, as defined in N.C.G.S. § 130A-290(a)(35).\nSolid Waste Disposal Site. As defined in N.C.G.S. § 130A-290(a)(36), any place at which solid wastes are disposed of by incineration, sanitary landfill, or any other method.\nSpecial Flood Hazard Area. The FEMA special flood hazard area.\nStart of Construction. The date the building permit was issued, provided the actual start of construction, repair, reconstruction, rehabilitation, addition, or improvement was within 180 days of the permit date. The actual start means the first placement of permanent construction of a structure, including a manufactured home, on a site, such as pouring a slab or footing, installation of piles, construction of columns, or any work beyond the state of excavation or the placement of a manufactured home on a foundation.\nPermanent construction does not include the installation of streets and/or walkways; nor does it include excavation for a basement, footings, piers, or foundations, or the erection of temporary forms; nor does it include the installation on the property of accessory buildings, such as garages or sheds not occupied as dwelling units or not parts of the main structure.\nFor substantial improvement, the actual start of construction means the first alteration of any wall, ceiling, floor, or other structural part of the building, whether or not that alteration affects the external dimensions of the building.\nStructure. For floodplain management purposes, a walled and roofed building, a manufactured home, a gas or liquid storage tank, that are principally above ground.\nSubstantial Damage. Damage of any origin sustained by a structure over a ten-year period whereby the cost of restoring the structure to the condition before damage occurred would equal or exceed 50% of the market value of the structure before the damages occurred.\nSubstantial damage includes flood-related damages sustained by a structure prior to November 16, 2018 for which the cost of repairs at the time of the flood event equaled or exceeded 25% of the market value of the structure before the damage occurred if within the relevant ten year period. See substantial improvement as defined in this section.\nSubstantial Improvement. Any repairs, reconstruction, rehabilitation, addition, or other improvement of a structure, or combination thereof, where the total cost over a ten-year period equals or exceeds 50% of the market value of the structure before the “start of construction” of the improvement. This term includes structures which have incurred substantial damage, regardless of the actual repair work performed.\nSubstantial improvement includes any repairs, reconstruction, rehabilitation, addition, or other improvement of a structure, or combination thereof prior to November 16, 2018 for which the cost of repairs at the time of the flood event equaled or exceeded 25% of the market value of the structure before the damage occurred or the substantial improvement began if within the relevant ten year period. The term does not, however, include either:\n\nAny correction of existing violations of state or community health, sanitary, or safety code specifications which have been identified by the community code enforcement official and which are the minimum necessary to assure safe living conditions; or\nAny alteration of a historic structure, provided that the alteration shall not preclude the structure’s continued designation as a historic structure; or\nAny replacement subject to the requirements of Section 27.3.E.\n\nFor the purposes of this definition, Substantial improvement is considered to occur when the first alteration of any wall, ceiling, floor, or other structural part of the building commences, whether or not that alteration affects the external dimensions of the structure.\nSubstantially Improved Existing Manufactured Home Park or Subdivision. Where the repair, reconstruction, rehabilitation, or improvement of the streets, utilities, and pads over a ten-year period equals or exceeds 50% of the value of the streets, utilities, and pads before the repair, reconstruction, or improvement commenced.\nTechnically Measurable. An activity and/or condition that can be modeled within the stated or commonly known accuracy of a Floodway Engineering Analysis or other engineering computations and may have an impact on base flood elevations.\nThe Floodplain Administrator may require a No-Rise Certification by a North Carolina Professional Engineer to if a proposed activity and/or condition meets the technically measurable definition.\nTemperature Controlled. Having the temperature regulated by a heating and/or cooling system built-in and/or by appliance.\nViolation. The failure of a structure or other development to be fully compliant with this article. A structure or other development without the elevation certificate, other certifications, or other evidence of compliance required in Section 27.5 and Section 27.6 is presumed to be in violation, until such time as the required documentation is provided.\nWatercourse. A lake, river, creek, stream, channel or other topographic feature on or over which waters flow at least periodically. Watercourse includes specifically designated areas in which substantial flood damage may occur.\nWater Surface Elevation (WSE). The height, in relation to NAVD 88, of floods of various magnitudes and frequencies in the floodplains of riverine areas.\n", "metadataJson": "{\"section_url\": \"/articles/article-27-floodplain-regulations/#278-definitions\"}"}]}