{"title": "Article 4. Neighborhood 1 Zoning Districts", "metadataJson": "{\"base_url\": \"article-4-neighborhood-1-zoning-districts\"}", "section": [{"title": "4.1 PURPOSE", "text": "The Neighborhood 1 Zoning Districts respect the character and development patterns of Charlotte’s established residential neighborhoods and promote new residential neighborhood development in a manner that implements the City’s vision for the future. The N1-A through N1-E Zoning Districts allow for the development of single -family, duplex, and triplex dwellings on all lots. Additionally, quadraplex dwellings are allowed on arterial streets in these zoning districts when an affordable housing unit is provided within the dwelling. The N1-F Zoning District allows all dwelling types allowed in N1-A through N1-E Zoning Districts, as well as small-scale multi-family dwellings, and is intended for application typically on arterial streets within Neighborhood 1 Place Type.Specific standards within each of the zoning districts address building form and promote context-sensitive, compatible neighborhood development. The Neighborhood 1 Zoning Districts also allow for select nonresidential uses, such as places of worship and educational facilities, and for the reuse of existing neighborhood commercial establishments under prescribed conditions.\nN1-A Neighborhood 1 Zoning DistrictThe N1-A Zoning District allows for the development of residential dwellings on lots of 10,000 square feet or greater.The N1-A Zoning District is typically applied to established neighborhoods.\nN1-B Neighborhood 1 Zoning DistrictThe N1-B Zoning District allows for the development of residential dwellings on lots of 8,000 square feet or greater.The N1-B Zoning District is typically applied to established neighborhoods.\nN1-C Neighborhood 1 Zoning DistrictThe N1-C Zoning District allows for the development of residential dwellings on lots of 6,000 square feet or greater.The N1-C Zoning District is typically applied to established neighborhoods.\nN1-D Neighborhood 1 Zoning DistrictThe N1-D Zoning District allows for the development of residential dwellings on lots of 3,500 square feet or greater.\nN1-E Neighborhood 1 Zoning DistrictThe N1-E Zoning District allows for the development of residential dwellings on lots of 3,000 square feet or greater.\nN1-F Neighborhood 1 Zoning DistrictThe N1-F Zoning District allows for the development of residential dwellings on lots of 3,000 square feet or greater and is intended to be applied predominantly along arterials.\n", "metadataJson": "{\"section_url\": \"/articles/article-4-neighborhood-1-zoning-districts/#41-purpose\"}"}, {"title": "4.2 USES", "text": "Article 15 lists permitted, temporary, and accessory uses for the Neighborhood 1 Zoning Districts. Use definitions are found in Article 15.", "metadataJson": "{\"section_url\": \"/articles/article-4-neighborhood-1-zoning-districts/#42-uses\"}"}, {"title": "4.3 DIMENSIONAL AND DESIGN STANDARDS", "text": "\nGeneral\n\nThe tables below include the dimensional and design standards for the Neighborhood 1 Zoning Districts. Abbreviation included shall be interpreted as follows: MF = Multi-Family. (Additional abbreviations are described in Section 2.2.)\nWhere this Ordinance refers to frontages in general, a transit station, off-street public path, or public park shall not be considered a frontage within the Neighborhood 1 Zoning Districts.\nIn the tables below, where a cell contains a standard or a “.” the standard shall be applicable. Where a cell is blank and shaded, the standard shall not apply.\n\n\nLotLot standards govern the basic dimensions of lots, including but not limited to minimum area, width, and coverage as applicable. These standards are intended to provide a rational basis for the division, organization, and development of land within the City of Charlotte.\nTable 4-1: Neighborhood 1 Zoning Districts Lot Standards\nBuilding SitingBuilding siting standards govern the placement of buildings on lots and are intended to ensure that development maintains compatibility with its surrounding context and the intent of the applicable zoning district.\nTable 4-2: Neighborhood 1 Zoning Districts Building Siting Standards\n1 Front setbacks shown on a plat recorded at the Register of Deeds shall supersede required zoning district front setbacks.\n2 The following alternative setback standards may be used for an established blockface that is at least 25% developed or has at least four existing dwellings:\n\nA single-family, duplex, or triplex dwelling in an established blockface may be located no closer to the street than the two closest residential buildings on the same blockface.\nIn no case shall the minimum setback be less than ten feet or intrude into a required clear sight triangle at an intersection (Section 16.1).\n\n3 In the case of a lot abutting both a local or collector street and a parallel arterial street (through lot), buildings shall orient toward the local or collector street.\n4 In no case shall any building entry be located closer than six feet to an existing or proposed off-street public path or shared use path.\n5 When the corner side setback is located along an arterial street, the corner side setback shall be subject to the minimum front setback dimension for the zoning district.\n6 Street includes public and network-required private streets. For network-required private streets, front setback is measured from the back of curb, and shall be as indicated for the zoning district, plus an additional 14 feet.\n\nBuilding HeightBuilding height standards govern the maximum heights of buildings, as applicable, and are intended to provide flexibility while maintaining appropriate transitions to adjacent areas.\n1 The height and location of structures may be restricted by the limitations set forth in the Code of Federal Regulations (CFR) Title 14 Part 77: Safe, Efficient Use, and Preservation of the Navigable Airspace. A notice of proposed construction FAA Form 7460-1 must be filed with the FAA for construction or alteration that impacts any of the imaginary surfaces as defined in 14 CFR Part 77 or is more than 200 feet in height above the ground at its site at least 45 days prior to construction. The Aviation Department Planning Division may serve as a point of contact for information regarding building notification requirements and obstruction evaluation.‍2 Building height may be increased by one foot for each additional one foot of building setback from required side and rear setbacks to a maximum height of 65 feet. The maximum building height of any structure within 200 feet of residential uses or vacant land in a Neighborhood 1 Place Type is limited as follows: That portion of a structure within the first 100 feet is limited to a maximum of 50 feet in height, and each portion of the building may be measured independently, from the average grade of the portion being measured to the highest point of the same portion.‍\n\n\nBuilding Height Setback Plane for Duplexes and TriplexesIn addition to the maximum building height requirement, all duplex and triplex buildings within the Neighborhood 1 Zoning Districts shall meet the building height setback plane regulations below.\n\nAll duplex and triplex buildings are limited to a sidewall height at the required minimum side setback of 20 feet or the average height of the residential building sidewalls on both sides of the lot, whichever is greater. Sidewalls shall be measured from the finished floor elevation of the main floor to the eave or, if no eave is present on the residential building, to the bottom of the finished roof plane. For a corner lot, the closest residential building on the same blockface and the residential building closest to such are used for averaging. If a sidewall height of greater than 20 feet is proposed, a height survey of the closest residential building sidewalls is required at the time of permitting.\nIf no residential buildings exist on the same blockface as a new residential building under development, the maximum building height for the zoning district controls.\nAdditional building height is granted at a ratio of one foot of additional side setback to one foot of height, establishing a building height setback plane at 45 degrees. Buildings may not exceed the maximum building heights of the zoning district.\nDormers and gable ends may extend into and through the 45 degree building height setback plane but shall comply with the maximum building height.\n\n\n\n\nBUILDING HEIGHT SETBACK PLANE (DUPLEX AND TRIPLEX)‍\nBuilding ArticulationBuilding articulation standards govern the dimensions of building facade elements and entry features and are intended to facilitate the enhancement of a pedestrian-oriented environment. The following standards apply only to building façades facing a frontage, except for Limited Access. The standards below apply to all uses unless a use has a specific standard. When only specific uses are cited, then the standard applies only to those uses.\nTable 4-4: Neighborhood 1 Zoning Districts Building Articulation Standards1   Does not apply to Multi-Family Attached When Units on Sublots.‍\nTransparencyTransparency standards govern the required amount of ground floor and upper floor transparency and are intended to facilitate the enhancement of a pedestrian-oriented environment. The following standards apply only to building façades facing a frontage, except for Limited Access. These standards do not apply to multi-family attached development on sublots. The standards below apply to all uses unless a use has a specific standard. When only specific uses are cited, then the standard applies only to those uses.\n‍\nSite Layout Standards\n\nResidential Site Layout Standards                  \n\nIn the N1-F Zoning District, multi-family attached developments and multi-dwelling developments are limited to two principal structures on a lot. In the N1-F Zoning District, multi-family stacked developments are limited to one principal structure on a lot.\nThe table below establishes site layout standards for multi-family attached, multi-family stacked, and triplex and quadraplex development both when located on and when not located on sublots. Multi-dwelling developments are also subject to the prescribed conditions in Article 15.\n\n\n\n\nRESIDENTIAL SITE LAYOUT STANDARDSTable 4-6: Neighborhood 1 Zoning Districts Residential Site Layout Standards\nBuilding Design Standards\n\nResidential Building Design StandardsThe table below establishes building design standards for multi-family stacked, and multi-family attached, triplexand quadraplex development when not on sublots within the Neighborhood 1 Zoning Districts.\n\n\n RESIDENTIAL BUILDING DESIGN STANDARDS(MULTI-FAMILY STACKED, AND MULTI-FAMILY ATTACHED, TRIPLEX AND QUADRAPLEX DEVELOPMENT WHEN NOT ON SUB LOTS)Table 4-7: Neighborhood 1 Zoning Districts Residential Building Design Standards1  Zoning Administrator may allow adjustments to standards if adjacent average sidewalk grade is greater than 10% or to comply with federal and state law.\n\n\nNonresidential and Mixed-Use Building Design StandardsThe following design standards apply to nonresidential and mixed-use buildings in the Neighborhood 1 Zoning Districts.\n\n\n‍NONRESIDENTIAL AND MIXED-USE BUILDING DESIGN STANDARDS\n\n\n\n\nA frontage shall have a minimum of one prominent entrance, as defined in this Ordinance. This does not apply to Limited Access roads.\n\nIn the case of a building with two frontages located on a corner, one prominent entrance located on the corner may satisfy this requirement for both frontages, subject to the following:\n\n Each frontage shall not require more than one prominent entry.\n A prominent corner entry shall include design features that reinforce intersections as key locations for pedestrian activity. Two of the following shall be included:\n\n A chamfered or rounded corner design.\n\n\n\n Awnings, canopies, or other covered entry features.\n\n\n\n Special paving, landscape, or lighting features.\n\n\n\n Unique architectural detailing that emphasizes the corner entry.\n\n\n\n\n\n\nOne prominent entrance on the ground floor is required per building on a site.\nA minimum of one ground floor entrance along each frontage facing façade, except for a Limited Access frontage, shall include a pedestrian connection between doors and adjacent pedestrian facilities, where such facilities are present or are required by this Ordinance. The Zoning Administrator may waive this requirement if they determine that the nature of the use does not require such pedestrian connections, for example warehouse and distribution centers, airports, truck and rail freight terminals, and other similar uses.\nPedestrian-oriented ground-floor designs are encouraged, including arcades, galleries, colonnades, outdoor dining areas, and outdoor plazas.\n\n\n\n\nBuilding Material RestrictionsThe building material restrictions apply to the following development in the Neighborhood 1 Zoning Districts: nonresidential development, mixed-use buildings, multi-family stacked, and triplex, quadraplex, and multi-family attached when not on sublots.\n\nThe following building materials are limited to 25% of each façade along a frontage. They may also be used as a component of construction when not a surface finish material without limitation.\n\nCorrugated metal siding; however, the reuse of pre-fabricated shipping containers is permitted and is not subject to this limitation, subject to compliance with the building code and other applicable codes\nExterior insulation finishing systems (EIFS) is prohibited on the ground floor of a multi-family dwelling (the 25% permission in item 1 above does not apply)\nPlain concrete masonry units (CMU)\nPlastic\nT-111 composite plywood siding\nVinyl\n\n\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-4-neighborhood-1-zoning-districts/#43-dimensional-and-design-standards\"}"}, {"title": "4.4 OPEN SPACE REQUIREMENTS", "text": "New development and expansion of buildings by 5,000 square feet or 20% of the building area, whichever is less, is required to provide open space as specified in this section.\nResidential On-Site Open SpaceOn-site open space is required in the N1-F Zoning District for all multi-family development in accordance with the following:\n\nFor multi-family stacked developments, a minimum of 10% of the lot area shall be designed as on-site open space. Such open space may be private open space, common open space, public open space, or any combination thereof.\nMulti-family attached development shall provide a minimum of 250 square feet of open space per dwelling unit. Such open space may be private open space, common open space, public open space, or any combination thereof.\nResidential on-site open space shall meet the design requirements of Section 16.5.\nResidential on-site open space may be provided as land dedicated to Mecklenburg County Park and Recreation, a fee-in-lieu provided to Mecklenburg County Park and Recreation, or a combination thereof in accordance with the requirements of Section 16.5.\n\n\nNonresidential and Mixed-Use On-Site Open Space\n\nNonresidential and mixed-use development in the Neighborhood 1 Zoning Districts is required to provide on-site open space, except for developments on sites of one-half acre or less in size.\nDevelopment shall provide a minimum of 10% of the total lot area in on-site open space. Such open space may be common open space, public open space, or any combination thereof.\nNonresidential and mixed-use on-site open space shall meet the design requirements of Section 16.5.\nNonresidential and mixed-use on-site open space may be provided as land dedicated to Mecklenburg County Park and Recreation, a fee-in-lieu provided to Mecklenburg County Park and Recreation, or a combination thereof in accordance with the requirements of Section 16.5.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-4-neighborhood-1-zoning-districts/#44-open-space-requirements\"}"}, {"title": "4.5 ALTERNATIVE RESIDENTIAL DEVELOPMENT OPTIONS", "text": "\nConservation Residential DevelopmentA conservation residential development permits a reduction in lot size in exchange for the provision of open space beyond the requirements of this Ordinance, allowing for efficient use of land and preservation of natural resources.\n\nApplicabilityConservation residential development is permitted in the N1-A, N1-B, N1-C, and N1-D Zoning Districts. A conservation residential development shall be a minimum of two acres in area.\nDevelopment Standards\n\nSite Layout\n\nAll lots within a conservation residential development shall front on a street or a common open space.\nThe maximum number of lots permitted within a conservation development is determined by the gross acreage of the site divided by the minimum lot area of the zoning district.\nLots within the conservation development shall meet the requirements of the underlying zoning district with the exception of the following:\n\n Minimum lot area and minimum lot width may be reduced by 50%.\n Maximum building coverage does not apply to lots of 5,000 square feet or less in lot area.\n\n\nMinimum setbacks apply as follows:\n\n A minimum side setback of five feet applies to all lots within a conservation residential development.\n A minimum corner side setback of ten feet applies to all corner lots within a conservation residential development.\n Front and rear setbacks may be reduced by 50% for all lots within the conservation residential development, unless otherwise specified below.\n When a lot within a conservation residential development fronts on a common open space, the front setback shall be measured from the  property line abutting the common open space.\n Where a lot within the conservation residential development abuts adjacent property, minimum side and rear setbacks are required in accordance with zoning district standards.\n Where a lot within the conservation residential development abuts a street at the perimeter of the conservation residential development, minimum front setback and minimum lot width is required in accordance with zoning district standards.\n\n\nAll buildings within a conservation residential development shall front on a street or a common open space. When a conservation residential development is developed as buildings on individual lots that front on a common open space, such frontage is considered to meet any requirement for frontage on a street. However, all applicable emergency access requirements must be met.\n\n\nCommon Open Space\n\nIn addition to any open space or tree save otherwise required by this Ordinance, 10% of the site area of a conservation residential development shall comprise common open space, and at least 50% of the common open space shall be tree save per the requirements and allowances of Article 20. Common open space shall be designed as follows:\n\nThe required common open space, excluding any designated tree save area, shall have a minimum width of at least 30 feet in all dimensions. Dimensions of designated tree save area are subject to the requirements of Article 20.\nCommon open space, excluding any tree save, may be improved for recreational use or left in a natural state. No more than 50% of common open space shall be covered by water. Areas of common open space designated as tree save shall not be covered by water.\nStructures located within any common open space shall be accessory to any recreational use of the space. Structures located in designated tree save areas are subject to the requirements of Article 20.\n\n\nCommon open space may be conveyed as follows:\n\nTo Mecklenburg County in support of the Mecklenburg County Park and Recreation Department, if accepted by the County.\nTo a conservation organization approved by the City, if accepted by the designated organization.\nTo one or more homeowner’s associations.\n\n\nCommon open space cannot be sold and has no future development rights.\n\n\n\n\n\n\nVoluntary Mixed-Income Residential DevelopmentA voluntary mixed-income residential development allows for an increase in development intensity in exchange for the provision of a mixture of affordable and market-rate housing units, expanding housing options and opportunities within the City.\n\nApplicabilityVoluntary mixed-income residential development is permitted in the N1-A, N1-B, N1-C, and N1-D Zoning Districts.\nDevelopment BonusIn exchange for setting aside affordable housing units, voluntary mixed-income residential developments may receive a bonus allowing for the development of property in accordance with the standards of a zoning district of greater intensity as follows:\n\nProperty zoned the N1-A Zoning District may be developed in accordance with the standards of the N1-B Zoning District.\nProperty zoned the N1-B Zoning District may be developed in accordance with the standards of the N1-C Zoning District.\nProperty zoned the N1-C Zoning District may be developed in accordance with the standards of the N1-D Zoning District.\nProperty zoned the N1-D Zoning District may be developed in accordance with the standards of the N1-E Zoning District.\n\n\n\n\nAn example of a calculation of bonus lots is as follows: If the N1-A Zoning District allows 100 lots and the N1-B Zoning District allows 128 lots, then there are 28 bonus lots. (128 lots minus 100 lots).\n\n\nAffordability Set-Aside\n\nAll units constructed on 50% of the bonus lots accommodated through the development bonus shall be developed as affordable units set aside for households earning 80% Area Median Income (AMI) or less. The period of affordability shall be 15 years for rental properties and the City or a nonprofit shall have first right of refusal for for-sale properties.\nAMI averaging is permitted; however, no unit designated as affordable shall be set aside for households earning more than 100% AMI.\nFor lots on arterial streets, any affordable units required for a quadraplex dwelling are in addition to the required number of affordable units in item a above.\n\n\nDevelopment Standards\n\nA minimum contiguous development site of one acre is required for a voluntary mixed-income residential development. No fewer than two affordable units may be developed as part of a voluntary mixed-income development receiving a development bonus.\nDevelopment standards applicable to a voluntary mixed-income development shall be those of the zoning district achieved through the development bonus.\nAffordable housing units provided as a component of the voluntary mixed-income residential development shall be distributed throughout the development, not concentrated in any one structure or area of the site, unless the total affordable housing units in the development is five or fewer.\n\n\nCompliance and MonitoringVoluntary mixed-income residential developments are subject to monitoring to ensure continued compliance with the standards of this section, and in accordance with Section 2.1 of the UDO Zoning Administration Manual.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-4-neighborhood-1-zoning-districts/#45-alternative-residential-development-options\"}"}, {"title": "4.6 ON-SITE PEDESTRIAN CONNECTIVITY REQUIREMENTS", "text": "Standards for required on-site pedestrian connectivity are found in Section 16.6.", "metadataJson": "{\"section_url\": \"/articles/article-4-neighborhood-1-zoning-districts/#46-on-site-pedestrian-connectivity-requirements\"}"}, {"title": "4.7 GENERAL DEVELOPMENT STANDARDS", "text": "\nGeneral Development StandardsGeneral development standards are found in Article 16.\nAccessory StructuresStandards for accessory structures are found in Article 17.\nArchitectural FeaturesStandards for architectural features are found in Article 18.\nOff-Street ParkingStandards for off-street parking and bicycle parking are found in Article 19.\nLandscaping and ScreeningLandscaping and screening standards are found in Article 20.\nLoading and ServiceStandards for loading spaces and service areas are found in Article 21.\nSignsStandards for signs are found in Article 22.\nDrainageStandards for drainage are found in Article 24.\n‍", "metadataJson": "{\"section_url\": \"/articles/article-4-neighborhood-1-zoning-districts/#47-general-development-standards\"}"}]}