{"title": "Article 11. Community Activity Center Zoning Districts", "metadataJson": "{\"base_url\": \"article-11-community-activity-center-zoning-districts\"}", "section": [{"title": "11.1 PURPOSE", "text": "\nCAC-1 Community Activity Center 1 Zoning DistrictThe CAC-1 Community Activity Center 1 Zoning District is intended to accommodate those areas of the City that are transitioning from a more automobile-centric orientation toward a more walkable, well-connected, moderate intensity mix of retail, restaurant, entertainment, office, and personal service uses, including some residential uses. CAC-1 Zoning District standards allow for greater flexibility in design and site elements, such as parking amount and location, while accommodating multiple modes of transportation including walking, bicycling, and automobile.\nCAC-2 Community Activity Center 2 Zoning DistrictThe CAC-2 Community Activity Center 2 Zoning District is intended to accommodate a moderate intensity mix of retail, restaurant, entertainment, office, and personal service uses, as well as residential uses, in a comfortable pedestrian environment that is easily accessible and well-connected to surrounding neighborhoods. Such a mixture may serve the daily needs of nearby residents within walking distance, as well as surrounding neighborhoods via multiple modes of transportation. The CAC-2 Zoning District’s multi-modal orientation accommodates all modes, and zoning district standards require high quality design and a walkable and bikeable mixed-use development form.\n", "metadataJson": "{\"section_url\": \"/articles/article-11-community-activity-center-zoning-districts/#111-purpose\"}"}, {"title": "11.2 USES", "text": "Article 15 lists permitted, temporary, and accessory uses for the Community Activity Center Zoning Districts. Use definitions are found in Article 15.", "metadataJson": "{\"section_url\": \"/articles/article-11-community-activity-center-zoning-districts/#112-uses\"}"}, {"title": "11.3 DIMENSIONAL AND DESIGN STANDARDS", "text": "The tables below include the dimensional and design standards for the Community Activity Center Zoning Districts. Standards within the tables below may contain specific regulations organized by frontage type (Section 3.5). In the tables below, where a cell contains a standard or a “.” the standard is applicable. Where a cell is blank and shaded, the standard does not apply.\nBuilding SitingBuilding siting standards govern the placement of buildings on lots, and are intended to ensure that development maintains compatibility with its surrounding context and the intent of the applicable zoning district.\n‍Table 11-1: Community Activity Center Zoning Districts Building Siting Standards1 On local and collector streets, measured from the curb location for Office/Commercial Wide Local Street Cross Section in CLDSM or the existing back of curb, whichever is farthest from the centerline. If SSI standards require the relocation of the back of curb or the back of curb is voluntarily relocated, that shall be considered the existing back of curb location.2 In no case shall any building entry be located closer than six feet to an existing or proposed off-street public path or shared use path.3 For the transit station, off-street public path, public park frontage, shall be measured from a property line or right-of-way line. If there is an easement in place for any frontage, then the measurement shall be taken from such easement. For any frontage abutting a reservation for a future frontage, the frontage setback line shall be measured from the edge of the reservation area.4 If there is an existing Charlotte Water easement, other utility easement, or overhead utility clearance requirement that conflicts with the build-to zone requirement, a build-to line shall be established at the edge of the easement or edge of the overhead utility clearance requirement closest to the build-to zone.5 Where a lot has more than two frontages that require a build-to zone, the build-to zone shall be increased by 100% for those frontages that exceed two. Such an increase should be applied to those frontages that are lowest in the established hierarchy of frontages (Section 3.5.D).\nBuilding HeightBuilding height standards govern the minimum and maximum heights of buildings as applicable and are intended to provide flexibility while maintaining appropriate transitions to adjacent areas.\n1 Lots of one-half acre in area or less are exempt from any applicable minimum building height requirements. Buildings of 2,000sf or less of gross floor area are exempt from any applicable minimum building height requirements.2 The height and location of structures may be restricted by the limitations set forth in the Code of Federal Regulations (CFR) Title 14 Part 77: Safe, Efficient Use, and Preservation of the Navigable Airspace. A notice of proposed construction FAA Form 7460-1 must be filed with the FAA for construction or alteration that impacts any of the imaginary surfaces as defined in 14 CFR Part 77, or is more than 200 feet in height above the ground at its site at least 45 days prior to construction.  The Aviation Department Planning Division may serve as a point of contact for information regarding building notification requirements and obstruction evaluation3 The maximum building height of any structure within 200 feet of residential uses or vacant land in a Neighborhood 1 Place Type is limited as follows: That portion of a structure within the first 100 feet is limited to a maximum of 50 feet in height; that portion of a structure within 100 to 200 feet is limited to a maximum of 65 feet in height. These standards apply only to that part of a structure within the 200 foot distance, and each portion of the building may be measured independently, from the average grade of the portion being measured to the highest point of the same portion. This limitation does not apply to public parks of three acres or greater within a Neighborhood 1 Place Type, nor to an area of two or fewer parcels totaling no more than three acres within a Neighborhood 1 Place Type.‍\nBuilding ArticulationBuilding articulation standards govern the dimensions of building facade elements and entry features, and are intended to facilitate the enhancement of a pedestrian-oriented environment.\nTable 11-3: Community Activity Center Zoning Districts Building Articulation Standards\n1 Where a minimum building length as a percentage of lot width applies to multiple frontages, the highest frontage classification in the hierarchy (per Section 3.5.D) shall meet the established standard. In the case of a lot with two frontages, the second frontage shall only meet a standard of 40%. If there are more than two frontages subject to the standard, there is no minimum requirement for any frontage beyond the two highest frontages in the hierarchy. This requirement does not apply to Parkway or Limited Access frontages.2 Maximum building length along a frontage does not apply to any frontage located along a Limited Access road. If any applicable minimum building length exceeds a maximum building length requirement, the maximum building length shall control.3 To achieve maximum building length with additional design elements, the following is required:\n\nWhere a building abuts two parallel frontages with pedestrian facilities, or one frontage with pedestrian facilities and a parking lot, public park or other publicly owned open space on the side of the building opposite the frontage, a pedestrian passage is required. Such passage shall meet the following criteria:\n\nGeneral Requirements\n\nPassages shall be designed to accommodate pedestrians. Vehicular access and circulation shall not be allowed as a component of a passage.\nPassages shall be a minimum of 30 feet in width and 20 feet in height, and shall be located within the middle third of the building, measured along the frontage.\nPassages shall be designed to maintain views from one end through to the other.\nInclusion of decorative elements such as lighting installations or public art within passages is encouraged.\nPassages shall align with the street grid or other points of access to sidewalks, public paths, parking lots, public parks or other publicly owned open space where feasible.\nFor the purposes of any build-to zone requirement, a building passage is considered part of the building façade that meets such requirement.\n\n\nPassages in nonresidential and mixed-use buildings.\n\nGround floor uses shall be oriented toward the passage, including public entrances.\nGround floor façades facing into building passages in nonresidential and mixed-use buildings shall maintain a minimum transparency of 35% of the wall area of the passage.\n\n\nPassages in residential buildings.\n\nPassages in residential buildings may be closed off to the public with gates and/or fencing but shall be of open design to allow for a clear view through the passage.\nPassages in residential buildings shall be designed with elements for use by residents, such as seating areas.\nGround floor façades facing into building passages in residential buildings shall maintain a minimum transparency of 25% of the wall area of the passage.\n\n\n\n\nWhere a building does not abut two parallel frontages with pedestrian facilities, a break in the building massing is required as follows:\n\nBuilding mass shall be recessed a minimum of 20 feet in depth for no less than 30 linear feet along the façade. Such recess shall extend the full height of the building, and shall meet the following criteria:\n\nThe recess shall be located within the middle third of the building, measured along the frontage.\nFor nonresidential and mixed-use buildings, ground floor uses shall be oriented toward the recessed area, including public entrances.\nThe recessed area is subject to all transparency requirements.\nThe recessed area shall be designed as public or common space including amenities such as seating areas,landscaping, lighting, decorative elements, and public art.\n\n\n\n\n\n4 Does not apply to multi-family attached units when on sublots.5 The ground floor of residential developments is still considered residential when leasing or management offices and/or tenant facilities, such as gyms and community/party rooms associated with the development are located on the ground floor.6 Applies only if non-convertible residential; for convertible residential, nonresidential standard applies.7 At least 70% of the total ground floor for nonresidential uses and 30% for residential uses, measured as a percentage of the interior space, shall meet the minimum ground floor height requirement.8 Minimum ground floor heights can be reduced by the Zoning Administrator if there are site constraints that would cause practical difficulty.\n\nTransparencyTransparency standards govern the required amount of ground floor and upper floor transparency, and are intended to facilitate the enhancement of a pedestrian-oriented environment. These standards do not apply to multi-family attached development when units are on sublots.\nTable 11-4: Community Activity Center Zoning Districts Transparency Standards1 The ground floor of residential developments is still considered residential when leasing or management offices and/or tenant facilities, such as gyms and community/party rooms associated with the development are located on the ground floor.2 Applies only if non-convertible residential; for convertible residential, nonresidential standard applies.\nSite Layout Standards\n\nResidential Site Layout StandardsThe standards below establish site layout requirements for multi-family attached and multi-family stacked development within the Community Activity Center Zoning Districts. Where standards below refer to a frontage, such standards apply to all frontages except parkways or limited access roads.\n\n\nTable 11-5: Community Activity Center Zoning Districts Residential Site Layout Standards\nBuilding Design Standards\n\nNonresidential and Mixed-Use Building Design StandardsThe following design standards apply to nonresidential and mixed-use buildings in the Community Activity Center Zoning Districts.\n\n\n‍Table 11-6: Community Activity Center Zoning Districts Nonresidential and Mixed-Use Building Design Standards1 The Zoning Administrator may waive this requirement if they determine that the nature of the use does not require such pedestrian connections, for example warehouse and distribution centers, airports, truck and rail freight terminals, and other similar uses.\n\n\nResidential Building Design StandardsThe following design standards apply to multi-family attached when units not on sublots and multi-family stacked development in the Community Activity Center Zoning Districts.\n\n\nTable 11-7: Community Activity Center Zoning Districts Residential Building Design Standards1 Zoning Administrator may allow adjustments to standards if adjacent average sidewalk grade is greater than 10% or to comply with federal and state law.\nBuilding MaterialsThe following building materials are limited to 25% of each façade along a frontage. They may also be used as a component of construction when not a surface finish material without limitation. These restrictions do not apply to multi-family attached dwellings when units are on sublots.\n\nCorrugated metal siding; however, the reuse of pre-fabricated shipping containers is permitted and is not subject to this limitation, subject to compliance with the building code and other applicable code\nExterior insulation finishing systems (EIFS) is prohibited on the ground floor of a multi-family dwelling (the 25% permission in item 1 above does not apply). This does not apply to multi-family attached dwellings when units on sublots.\nPlain concrete masonry units (CMU)\nPlastic\nT-111 composite plywood siding\nVinyl\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-11-community-activity-center-zoning-districts/#113-dimensional-and-design-standards\"}"}, {"title": "11.4 OPEN SPACE REQUIREMENTS", "text": "\nNew construction of a principal building and expansion of a principal building by 5,000 square feet or 20% of the building area, whichever is less, is required to provide on-site open space, except for development on sites of one-half acre or less in size.\nThe design of open space shall meet the design requirements of Section 16.5.\nDevelopment shall provide a minimum of on-site open space as follows:\n1 For the purposes of required public on-site open space a development shall be considered mixed-use when no more than 25% of the ground floor area is nonresidential.\nResidential on-site open space may be provided as land dedicated to Mecklenburg County Park and Recreation, a fee-in-lieu provided to Mecklenburg County Park and Recreation, or a combination thereof in accordance with the requirements of Section 16.5.\nNonresidential and Mixed-Use on-site open space may be provided as land dedicated to Mecklenburg County Park and Recreation, a fee-in-lieu provided to Mecklenburg County Park and Recreation, or a combination thereof in accordance with the requirements of Section 16.5.\n", "metadataJson": "{\"section_url\": \"/articles/article-11-community-activity-center-zoning-districts/#114-open-space-requirements\"}"}, {"title": "11.5 ON-SITE PEDESTRIAN CONNECTIVITY REQUIREMENTS", "text": "Standards for required on-site pedestrian connectivity are found in Section 16.6.", "metadataJson": "{\"section_url\": \"/articles/article-11-community-activity-center-zoning-districts/#115-on-site-pedestrian-connectivity-requirements\"}"}, {"title": "11.6 GENERAL DEVELOPMENT STANDARDS", "text": "A. General Development StandardsGeneral development standards are found in Article 16.B. Accessory StructuresStandards for accessory structures are found in Article 17.C. Architectural FeaturesStandards for architectural features are found in Article 18.D. Off-Street ParkingStandards for off-street parking and bicycle parking are found in Article 19.E. Landscaping and ScreeningLandscaping and screening standards are found in Article 20.F. Loading and ServiceStandards for loading spaces and service areas are found in Article 21.G. SignsStandards for signs are found in Article 22.H. DrainageStandards for drainage are found in Article 24.", "metadataJson": "{\"section_url\": \"/articles/article-11-community-activity-center-zoning-districts/#116-general-development-standards\"}"}]}