{"title": "Article 3. Zoning Districts, Zoning Maps, & Frontages", "metadataJson": "{\"base_url\": \"article-3-zoning-districts-zoning-maps-frontages\"}", "section": [{"title": "3.1 PURPOSE AND APPLICABILITY", "text": "Zoning regulations control the use, physical development, and placement of structures on land within the City of Charlotte and its extraterritorial jurisdiction (ETJ). Regulations are intended to protect the health, safety, and welfare of all Charlotte residents and those that provide vital services to the community, and to provide for the orderly development of land in alignment with the City’s established land use policies as articulated within the adopted Comprehensive Plan and other development related policies adopted by the Charlotte City Council.", "metadataJson": "{\"section_url\": \"/articles/article-3-zoning-districts-zoning-maps-frontages/#31-purpose-and-applicability\"}"}, {"title": "3.2 ZONING DISTRICT TRANSLATION", "text": "The conventional zoning district classifications in effect before the effective date of June 1, 2023 of this Ordinance are translated as shown in Table 3-1: Zoning Districts Translation to the zoning districts of this Ordinance. The new standards set forth in this Ordinance for these zoning districts shall apply to all properties within such zoning districts.Table 3-1: Zoning Districts Translation", "metadataJson": "{\"section_url\": \"/articles/article-3-zoning-districts-zoning-maps-frontages/#32-zoning-district-translation\"}"}, {"title": "3.3 UDO ZONING DISTRICTS", "text": "To carry out the purpose and intent of this Ordinance, land within the City of Charlotte has been classified into zoning districts as established below. In most cases these zoning districts correspond to the City’s adopted Place Types, and are intended to be applied in areas of the City designated as such on the City’s most recently adopted Policy Map. Specific zoning district standards may also reference Place Types as shown on the most recently adopted Policy Map.\nNeighborhood 1 Zoning Districts\n\nN1-A Neighborhood 1 Zoning District\nN1-B Neighborhood 1 Zoning District\nN1-C Neighborhood 1 Zoning District\nN1-D Neighborhood 1 Zoning District\nN1-E Neighborhood 1 Zoning District\nN1-F Neighborhood 1 Zoning District\n\n\nNeighborhood 2 Zoning Districts\n\nN2-A Neighborhood 2 Zoning District\nN2-B Neighborhood 2 Zoning District\nN2-C Neighborhood 2 Zoning District\n\n\nCommercial Zoning Districts\n\nCG General Commercial Zoning District\nCR Regional Commercial Zoning District\n\n\nCampus Zoning Districts\n\nIC-1 Institutional Campus Zoning District\nIC-2 Institutional Campus Zoning District\nOFC Office Flex Campus Zoning District\nRC Research Campus Zoning District\n\n\nManufacturing and Logistics Zoning Districts\n\nML-1 Manufacturing and Logistics Zoning District\nML-2 Manufacturing and Logistics Zoning District\n\n\nInnovation Mixed-Use Zoning Districts\n\nIMU Innovation Mixed-Use Zoning District\n\n\nNeighborhood Center Zoning Districts\n\nNC Neighborhood Center Zoning District\n\n\nCommunity Activity Center Zoning Districts\n\nCAC-1 Community Activity Center Zoning District\nCAC-2 Community Activity Center Zoning District\n\n\nRegional Activity Center Zoning Districts\n\nRAC Regional Activity Center Zoning District\nUE Uptown Edge Zoning District\nUC Uptown Core Zoning District\n\n\nTransit-Oriented Development Zoning Districts\n\nTOD-UC Transit Urban Center Zoning District\nTOD-NC Transit Neighborhood Center Zoning District\nTOD-CC Transit Community Center Zoning District\nTOD-TR Transit Transition Zoning District\n\n\nSpecial Purpose and Overlay Zoning Districts\n\nHDO Historic District Overlay\nHDO-S Streetside Historic District Overlay\nNCO Neighborhood Character Overlay District\nRIO Residential Infill Overlay District\nCCO Cottage Court Overlay District\nMHO Manufactured Home Overlay\nMHP Manufactured Home Park District\nANDO Airport Noise Disclosure Overlay\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-3-zoning-districts-zoning-maps-frontages/#33-udo-zoning-districts\"}"}, {"title": "3.4 OFFICIAL ZONING MAP", "text": "\nLocation of Zoning DistrictsThe location and boundaries of the base and overlay zoning districts established by this Ordinance are set forth in the Official Zoning Map (“Zoning Map”), as periodically amended. The Zoning Map maintained by the Planning Department, and all the notations, references, and other information shown thereon are incorporated into, and made part of, this Ordinance.\nInterpretation of Zoning MapWhere uncertainty exists with respect to the boundaries of the zoning districts shown on the Zoning Map, the following rules shall be used to interpret the Zoning Map:\n\nWhere the Zoning Map shows a boundary line located within a street or alley right-of-way, railroad, or utility line right-of-way, easement, navigable or non-navigable waterway, or other planimetric feature, it shall be considered to be in the center of the right-of-way, easement, waterway, or other planimetric feature. If the actual location of such right-of-way, easement, waterway, or planimetric feature varies slightly from the location as shown on the Zoning Map, then the actual location shall control.\nWhere a map shows a boundary line as being located a specific distance from a street or alley right-of-way, railroad or utility line right-of-way, easement, navigable or non-navigable waterway, or other planimetric feature, this distance shall control.\nWhere a map shows a zoning district boundary to approximately coincide with a property line or city, town, county or state border, the property line or city, town, county, or state border shall be the zoning district boundary, unless otherwise indicated.\nIn instances when an approved rezoning petition included detailed information regarding a boundary line, such information shall be used as the correct boundary line location.\nWhere detailed information regarding a boundary line is not available, and where a map shows a zoning district boundary to not coincide or approximately coincide with any street or alley right-of-way, railroad or utility line right­of-way, easement, navigable or non-navigable waterway, other planimetric feature, or municipal border, and no dimensions are shown, the location of the boundary shall be determined by use of the scale appearing on the map.\nIf, because of error or omission in the Zoning Map, any property within the jurisdiction of this Ordinance is not shown as being in a zoning district, a zoning district classification of N1-A shall be established for the property.\nIn instances where none of the above methods are sufficient to resolve the boundary location, the Zoning Administrator may interpret the reasonable maintenance of a regular boundary to establish the boundary location.\nInterpretation of information on the Zoning Map will be made by the Zoning Administrator. Appeals of the Zoning Administrator’s interpretation may be made to the UDO Board of Adjustment. The Zoning Administrator will evaluate any alleged Zoning Map error using all available materials and records for the subject and adjacent properties. These materials include, but are not limited to, the following:\n\nThe tax map, current or historic.\nLegal descriptions of properties or boundaries.\nHistorical zoning maps.\nApproved rezoning petition information.\nTax records, current or historic.\nZoning and special use permit case files.\nOfficial maps from other jurisdictions.\nTopographic and planimetric maps and aerial photos.\nOther documentable information from sources whose accuracy cannot reasonably be questioned.\n\n\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-3-zoning-districts-zoning-maps-frontages/#34-official-zoning-map\"}"}, {"title": "3.5 APPLICABILITY OF FRONTAGES", "text": "Dimensional regulations, design regulations, and other aspects of the zoning districts within this Ordinance are frequently controlled by frontages. Where regulations within this Ordinance contain frontage designations, the following rules of determination apply.\nFrontages EstablishedThe regulations of this Ordinance address a series of 13 frontage types. These frontage types apply whether shown on Charlotte Streets Map or established through the development process.\n\nUptown SignatureAn Uptown Signature frontage includes those streets classified on the Charlotte Streets Map as Uptown Signature Streets. This frontage type applies only to Uptown Streets.\nMain StreetA Main Street frontage includes those streets on the Charlotte Streets Map classified as Main Streets.\nLinear Park‍A Linear Park frontage includes those streets classified on the Charlotte Streets Map as Linear Parks. This frontage type applies only to Uptown Streets.\n4-5 Lane Avenue/BoulevardA 4-5 Lane Avenue/Boulevard includes those streets on the Charlotte Streets Map classified as:\n\n4 Lane Avenue\n4+ Lane Avenue\n5 Lane Avenue\n5+ Lane Avenue\n4+ Lane Boulevard\n5+ Lane Boulevard\n\n\n6 or More Lane Avenue/BoulevardA 6 or more Lane Avenue/Boulevard includes those streets on the Charlotte Streets Map classified as:\n\n6 Lane Avenue\n6+ Lane Avenue\n6+ Lane Boulevard\nGreater than 6+ Lane Boulevard\n\n\n2-3 Lane AvenueA 2-3 Lane Avenue includes those streets on the Charlotte Streets Map classified as:\n\n2 Lane Avenue\n2+ Lane Avenue\n3 Lane Avenue\n\n\nParkwayA Parkway includes those streets on the Charlotte Streets Map classified as such.\nLimited AccessLimited Access includes those streets on the Charlotte Streets Map classified as such.\nTransit Station, Off-Street Public Path, Public ParkA transit station, off-street public path, or public park frontage includes the following:‍\n\nA transit station (Including 100 linear feet to either side of a station platform) as shown on an adopted Metropolitan Transit Commission alignment station location.\nAn off-street public path as required by this Ordinance or shown on a publicly adopted plan.\nA public park or other publicly owned open space.\n\n\nUptown PrimaryAn Uptown Primary frontage includes those streets classified on the Charlotte Streets Map as Uptown Primary Streets. This frontage type applies only to Uptown Streets.\nOther – PrimaryAn Other – Primary frontage includes the following:\n\nCollector streets, as shown on the Charlotte Streets Map or as designated through the development process.\nThe segment of a public or network-required private local street abutting a Neighborhood 1 Place Type.\n\n\nUptown SecondaryAn Uptown Secondary frontage includes those streets classified on the Charlotte Streets Map as Uptown Secondary Streets. This frontage type applies only to Uptown Streets.\nSecondaryA Secondary frontage includes any public or network-required private local street not classified as a frontage as established in items 1 through 8 above.\n\n\nAdditional Frontage DeterminationIn addition to item A above, and in the case of a conflict, the following rules of determination shall apply.\n\nWhere a lot has only one street frontage, and such frontage is not a Main Street, 4-5 Lane Avenue/Boulevard, 6 or more Lane Avenue/Boulevard, 2-3 Lane Avenue, or Other – Primary as established per item A above, it shall be established as an Other-Primary frontage. This does not apply to Parkways or Limited Access roads.\nWhere a lot located in Uptown has only one street frontage, and such frontage is not an Uptown Signature or Linear Park, as established per item A above, it shall be established as an Uptown Primary frontage. This only applies to Uptown Streets.\nWhere a collector street is addressed specifically within a regulation, it shall not be considered an Other – Primary frontage for the purpose of such regulation.\nWhere regulations within this Ordinance reference a Primary Frontage, such designation includes the following categories:\n\nMain Street\n4-5 Lane Avenue/Boulevard\n6 or more Lane Avenue/Boulevard\n2-3 Lane Avenue/Boulevard\nTransit station, off-street public path, public park\nOther – Primary\nUptown Signature\nUptown Primary\nLinear Park\n\n\nFor the application of zoning district standards and zoning development standards (Articles 4 through 22), an Uptown Signature or Linear Park frontage shall be considered a Main Street frontage for all standards other than the frontage setback line.\nFor the application of zoning district standards and zoning development standards (Articles 4 through 22), an Uptown Primary frontage shall be considered an Other-Primary frontage for all standards other than the frontage setback line.\nFor the application of zoning district standards and zoning development standards (Articles 4 through 22), an Uptown Secondary frontage shall be considered a Secondary frontage for all standards other than the frontage setback line.\n\n\nLots with Multiple Frontages\n\nWhen a lot has two frontages, at least one frontage shall be a primary frontage type. If neither frontage meets the criteria listed for a primary frontage type the longer of the two frontages shall be designated as an Other – Primary frontage type. If both frontages are of equal length, then either of the two shall be designated as an Other – Primary frontage type. Parkway and Limited Access frontages shall not be designated as Other ­Primary. If both frontages are Parkway or Limited Access Frontages, neither shall be designed Other – Primary. If both frontages meet the criteria for primary frontages, they shall both be designated as primary frontages.\nFor Uptown Streets, when a lot has two frontages, at least one frontage shall be a primary frontage type. If neither frontage meets the criteria listed for a primary frontage type, the longer of the two frontages shall be designated as an Uptown Primary frontage type. If both frontages are of equal length, then either of the two shall be designated as an Uptown Primary frontage type. Parkway and Limited Access frontages shall not be designated as Uptown Primary. If both frontages meet the criteria for primary frontages, they shall both be designated as primary frontages.\nWhen a lot has three frontages, at least one frontage shall be designated as a primary frontage type. If no frontage meets the criteria listed for a primary frontage type, the longest frontage shall be designated as an Other – Primary frontage. Parkway and Limited Access frontages shall not be designated as Other -Primary. If all frontages are Parkway or Limited Access frontages, none shall be designed Other – Primary. All frontages that meet the criteria for primary frontages shall be designated as primary frontages.\nFor Uptown Streets, when a lot has three frontages, at least one frontage shall be designated as a primary frontage type. If no frontage meets the criteria listed for a primary frontage type, the longest frontage shall be designated as an Uptown Primary frontage. Parkway and Limited Access frontages shall not be designated as Uptown Primary. All frontages that meet the criteria for primary frontages shall be designated as primary frontages.\nWhen a lot has four or more frontages, at least two frontages shall be designated as primary frontage types. If less than two frontages meet the criteria for a primary frontage type, the longest of those not meeting the criteria shall be designated as an Other – Primary frontage to meet this minimum. Parkway and Limited Access frontages shall not be designated as Other -Primary. If all frontages are Parkway or Limited Access frontages, none shall be designed Other – Primary. All frontages that meet the criteria for primary frontages shall be designated as primary frontages.\nFor Uptown Streets, when a lot has four or more frontages, at least two frontages shall be designated as primary frontage types. If less than two frontages meet the criteria for a primary frontage type, the longest of those not meeting the criteria shall be designated as an Uptown Primary frontage to meet this minimum. Parkway and Limited Access frontages shall not be designated as Uptown Primary. All frontages that meet the criteria for primary frontages shall be designated as primary frontages.\n\n\nHierarchy of Frontage TypesWhere regulations within this Ordinance refer to a hierarchy of frontages, the following rules apply:\n\nThe established hierarchy of frontages is as follows, listed from highest to lowest:\n\nUptown Signature\nMain Street\nLinear Park\n4-5 Lane Avenue/Boulevard\n2-3 Lane Avenue\nTransit station, off-street public path, public park\nUptown Primary\nOther – Primary\n6 or more Lane Avenue/Boulevard\nUptown Secondary\nSecondary\nParkway\nLimited Access\n\n\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-3-zoning-districts-zoning-maps-frontages/#35-applicability-of-frontages\"}"}]}