{"title": "Article 1. Title, Purpose, & Applicability", "metadataJson": "{\"base_url\": \"article-1-title-purpose-applicability\"}", "section": [{"title": "1.1 TITLE", "text": "The official title of this document is Unified Development Ordinance for the City of Charlotte, North Carolina and is known, cited, and referred to throughout this document as the “City of Charlotte Unified Development Ordinance,” “Unified Development Ordinance,” “Ordinance,” or “UDO.”", "metadataJson": "{\"section_url\": \"/articles/article-1-title-purpose-applicability/#11-title\"}"}, {"title": "1.2 AUTHORITY", "text": "\nThe development regulations contained in this Ordinance have been adopted pursuant to the authority conferred by the North Carolina General Statutes, and through special legislation enacted by the North Carolina General Assembly for the City of Charlotte.\nWhenever any provision of this Ordinance refers to or cites a section of the North Carolina General Statues (N.C.G.S.) and that section is later amended or superseded, this Ordinance shall be deemed to refer to the amended section or the section that most nearly corresponds to the superseded section.\n", "metadataJson": "{\"section_url\": \"/articles/article-1-title-purpose-applicability/#12-authority\"}"}, {"title": "1.3 PURPOSE AND INTENT", "text": "The purpose and intent of this Unified Development Ordinance is to establish regulations to serve the City of Charlotte, North Carolina, and its extraterritorial jurisdiction to:\nPromote the public health, safety, and general welfare of the community.\nPromote orderly development in accordance with the Comprehensive Plan and other City Council adopted development related policies.\nAssign zoning districts to land within the City and the extra-territorial jurisdiction according to use of land and structures, mass and height of structures, intensity of the use of the lot, or other classification, as deemed best suited to carry out the purposes of this Ordinance.\nPreserve and enhance the character of structures and communities that constitute the distinct places within the City.\nPromote economic development that balances the needs of the current and future economy with a high quality of life standard.\nProvide for preservation, protection, and conservation of natural resources and historic resources.\nPromote principles of sustainability and resiliency to climate change.\nMaintain, develop, and plan for public facilities and utilities in an economical and environmentally responsible manner.\nProvide a diversity of housing choices for all income levels and groups with an emphasis on affordability.\nProvide for the protection of public investment in transportation, water, stormwater management systems, sewage treatment and disposal, solid waste treatment and disposal, schools, recreation, public facilities, open space, and other public requirements.\nFocus growth to support the principles of the City Council adopted Comprehensive Plan by preserving open space and natural areas, reducing traffic congestion, utilizing existing infrastructure and resources, and preserving quality of life.\nPlan, construct, and maintain an accessible, efficient, multi-modal transportation system that meets the needs of the public and commerce, and creates safe and equitable mobility.\nProvide for procedures for the administration of the Ordinance and efficient review of development proposals.\n", "metadataJson": "{\"section_url\": \"/articles/article-1-title-purpose-applicability/#13-purpose-and-intent\"}"}, {"title": "1.4 JURISDICTION AND APPLICABILITY", "text": "\nJurisdictionAll provisions of this Ordinance shall apply within the corporate limits of the City of Charlotte, North Carolina, and within the City’s extraterritorial jurisdiction.\nApplicability of Place TypesThe Council adopted Policy Map is structured by Place Types. Within this Ordinance, certain standards and requirements are based upon such Place Type designations at the time of plan submittal.\nApplicability of Conditional Zoning Districts\n\nA conditional zoning district in place prior to the effective date of June 1, 2023 of this UDO, with the exception of conditional zoning districts located in the special flood hazard area as specified below, shall meet the regulations of all development ordinances in effect on the date of such conditional zoning district approval as well as the conditional zoning site plan and site-specific conditions. Conditional Zoning Districts located within the special flood hazard area shall be subject to floodplain regulations standards and Flood Insurance Rate Maps (FIRMs) maps in effect at the time of the floodplain development permit application submission. These sites shall be subject to all other regulations of all other development ordinances in effect on the date of such conditional zoning district approval as well as the conditional zoning site plan and site-specific conditions.\nA conditional zoning district approved after the effective date of June 1, 2023 of this UDO but under the regulations of the prior Zoning Ordinance shall meet the regulations of all development ordinances in effect prior to the effective date of June 1, 2023 of this UDO as well as the conditional zoning site plan and site-specific conditions.\nA conditional zoning district approved after the effective date of June 1, 2023 of this UDO and under the regulations of this UDO shall meet the regulations of this UDO as well as the conditional zoning site plan and site-specific conditions.\nThe above shall include any optional and EX zoning districts.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-1-title-purpose-applicability/#14-jurisdiction-and-applicability\"}"}, {"title": "1.5 TRANSITION RULES", "text": "The following transition rules shall apply to various development and use-related activities, actions, and other matters pending or occurring as of the effective date of June 1, 2023 of this Ordinance.A. Violations ContinueAny violation of any development ordinances incorporated into this Ordinance shall continue to be a violation under this Ordinance and shall be subject to the penalties set forth at the time of the violation, unless the use, development, construction, or other activity is now in compliance with the standards and regulations of this Ordinance.B. Previously Granted ApprovalsAny project for which a permit was issued or development approval was granted pursuant to any development ordinance incorporated into this Ordinance, prior to the effective date of June 1, 2023 of this Ordinance or any amendment thereto, may be completed in conformance with the issued permit or development approval.C. Existing UsesTable 1-1: Use Transitions describes how existing uses shall be allowed if a use permission has changed. This does not apply to conditional zoning map amendments.Table 1-1: Use Transitions\nIllegal Structures or UsesExisting structures or uses that have been deemed illegal per any development ordinance incorporated into this Ordinance shall be subject to the following:\n\nAny structure or use that was illegal prior to adoption of this Ordinance, but is subsequently made legal by this Ordinance, is deemed legal as of the effective date of June 1, 2023 of this Ordinance.\nAny structure or use that was illegal prior to adoption of this Ordinance and does not conform to all requirements of this Ordinance, remains illegal. Illegal structures and uses are not considered nonconforming structures or uses.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-1-title-purpose-applicability/#15-transition-rules\"}"}, {"title": "1.6 RELATIONSHIP TO OTHER REGULATIONS", "text": "\nWhere conditions, standards, or requirements imposed by any provision of this Ordinance are inconsistent with any standard imposed by any other federal, state, or local statute, law, ordinance, regulation, license, or permit, the most restrictive shall control, to the extent permitted by law.\nWhere multiple standards or requirements regulate an element of development within this Ordinance, the most restrictive standard or requirement shall control. However, where a more specific standard or requirement of an element of development conflicts with a general standard or requirement, the more specific standard or requirement shall apply.\nThis Ordinance does not nullify any private easements, covenants, or other agreements between parties. The City will not enforce any private agreement or covenant.\nNotwithstanding the provisions of this Ordinance, the North Carolina State Building Code and the North Carolina State Fire Prevention Code, and their accompanying appendices, are applicable and control at all times.\n", "metadataJson": "{\"section_url\": \"/articles/article-1-title-purpose-applicability/#16-relationship-to-other-regulations\"}"}, {"title": "1.7 CURRENT VERSIONS AND CITATIONS", "text": "\nAll references to other regulations, documents, maps, or manuals in this Ordinance refer to the most current version and citation for those regulations, documents, maps, or manuals, unless expressly indicated otherwise.\nIf the referenced regulations or documents have been repealed and not replaced by other regulations or manuals, Ordinance requirements for compliance are no longer in effect.\nWhenever a provision of this Ordinance refers to any other part of the City Code or to any other law, the reference applies to any subsequent amendment of that law.\n", "metadataJson": "{\"section_url\": \"/articles/article-1-title-purpose-applicability/#17-current-versions-and-citations\"}"}, {"title": "1.8 STATE OF EMERGENCY", "text": "\nThis Ordinance, in whole or in part, may be temporarily suspended during federal disaster “State of Emergency” declarations by the Executive Office of the President and/or Federal Emergency Management Administration (FEMA) and/or during “Imminent Threat Alert” declared by the U.S. Department of Homeland Security by resolution adopted by the City Council during a regular, continued, special, or emergency meeting of the City Council. The Planning Director may suspend the application of all or part of these rules during a state of emergency declared by the Governor of the State of North Carolina, resolution of the North Carolina General Assembly, or local governing body or mayor.\nUpon the conclusion, lifting, and/or rescinding of the declared “State of Emergency” by the authorized federal and/or state official, these rules are reinstated without further action by the City and shall be in full force and effect.\n", "metadataJson": "{\"section_url\": \"/articles/article-1-title-purpose-applicability/#18-state-of-emergency\"}"}, {"title": "1.9 SEVERABILITY", "text": "If any article, section, or specific provision or regulation or any zoning district boundary in this Ordinance that now exists or may exist in the future is found by a court to be invalid for any reason, the decision of the court shall not affect the validity of any other article, section, provision, regulation, standard, or zoning district boundary of these regulations, except the provision in question. The other portions of these regulations not affected by the decision of the court shall remain in full force and effect.", "metadataJson": "{\"section_url\": \"/articles/article-1-title-purpose-applicability/#19-severability\"}"}, {"title": "1.10 EFFECTIVE DATE", "text": "This Ordinance shall become effective on June 1, 2023.", "metadataJson": "{\"section_url\": \"/articles/article-1-title-purpose-applicability/#110-effective-date\"}"}]}