{"title": "Article 15. Uses Regulations", "metadataJson": "{\"base_url\": \"article-15-use-regulations\"}", "section": [{"title": "15.1 GENERAL USE REGULATIONS", "text": "\nNo structure or land may be used or occupied unless allowed as a permitted, temporary, or accessory use within the zoning district. These use regulations apply to the use of private property, including City-owned property, but exclude the right-of-way.\nAll uses shall comply with any applicable federal and state requirements, and any additional federal, state, county, and/or city ordinances.\nPrincipal uses are defined to be inclusive of specific uses. The following regulations apply:\n\nWhen a use meets a specific definition, it is regulated as such and cannot be regulated as part of a more inclusive use category.\nA use that is not explicitly listed in the use matrix will be evaluated by the Zoning Administrator to determine if the use is part of a use listed.\nA use that is not listed in the use matrix and cannot be interpreted as part of a use listed in the use matrix is prohibited.\n\nTest should be lowercase a\nb\n\ni.\n\n(A)\n\n(1)\n\n(i)\n\n\n\n\n\n\n\n\n\n\n\n\nAll uses shall comply with any prescribed conditions as applicable. Prescribed conditions apply to certain uses within the use matrix to address additional impacts, apply specific design or siting standards, and/or link to additional regulations outside this Ordinance.\n", "metadataJson": "{\"section_url\": \"/articles/article-15-use-regulations/#151-general-use-regulations\"}"}, {"title": "15.2 GLOBAL USE MATRIX", "text": "\n” Table 15-1: Use Matrix identifies the permitted, temporary, and accessory uses allowed within each zoning district. Uses are defined in Section 15.3.\n*B.* Table 15-1 shall be applied as follows:\n\nAn “X” indicates that the use is permitted by-right in the zoning district.\n\n\n\nA “PC” indicates that the use is allowed in the zoning district and shall comply with the prescribed conditions of this Article (Sections 15.4 through 15.6).\n\n\n\nA “C” indicates that the use shall require a conditional zoning (Section 37.2).\n\n\n\nA “C/PC” indicates that the use shall comply with the prescribed conditions of this Article (Sections 15.4 through 15.6) and also shall require a conditional zoning (Section 37.2).\n\n\n\nA shaded blank cell indicates the use is not allowed in the zoning district.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-15-use-regulations/#152-global-use-matrix\"}"}, {"title": "15.3 USE DEFINITIONS", "text": "The principal, temporary, and accessory uses in Table 15-1 are defined as follows:\nAccessory Shelter. A housing shelter in an accessory building located on the same site as a principal building, or located on a site owned, and operated by religious, civic, fraternal, social, institutional, or governmental agency providing free accessory lodging for indigent individuals and/or families with no regular home or residential address.\nAddiction Treatment Facility, Residential. A licensed care facility that provides 24 hour medical and/or non­-medical/therapeutic care of persons seeking rehabilitation and treatment of addiction. Such facilities may include medical detoxification.\nAdult Care Center. A facility where an individual, agency, or organization provides supervision or care for more than six adults in a place other than their usual place of abode.  \nAdult Care Home. A facility run by an individual residing in a single-family dwelling where housing management provides 24 hour scheduled and unscheduled personal care services care for no more than six adults.\nAdult Electronic Gaming Establishment. An establishment where patrons utilize electronic machines, including, but not limited to, computers, gaming tables, and gaming terminals to play games dependent on skill or dexterity in exchange, through redemption and/or other distribution, for cash, merchandise, or other items of value. This definition includes, but is not limited to, arcade, fish arcade, fish game(s), fish table(s), skill arcade, and skilled arcade. This definition does not include any lottery endorsed, approved, or sponsored by the State of North Carolina, or any electronic machines that test a patron’s skill or dexterity but do not provide the patron an award of cash, merchandise, or other items of value based on their skill or dexterity.\nAdult Use. Any businesses or enterprises that have as one of their principal business purposes or as a significant portion of their business an emphasis on matter and conduct depicting, describing, or related to anatomical areas and sexual activities as specified below and as may be further specified in North Carolina General Statute 14-202.10. An adult use may also be called an “adult establishment.”\n\nAdult Bookstore. A bookstore:\n\nWhich receives a majority of its gross income during any calendar month from the sale or rental of publications (including books, magazines, other periodicals, videotapes, compact discs, other photographic, electronic, magnetic, digital, or other imaging medium) which are distinguished or characterized by their emphasis on matter depicting, describing, or relating to specified sexual activities or specified anatomical areas, as defined in this section; or\nHaving as a preponderance (either in terms of the weight and importance of the material or in terms of greater volume of materials) of its publications (including books, magazines, other periodicals, videotapes, compact discs, other photographic, electronic, magnetic, digital, or other imaging medium) which are distinguished or characterized by their emphasis on matter depicting, describing, or relating to specified sexual activities or specified anatomical areas, as defined in this section.\n\n\nAdult Live Entertainment. Any performance of or involving the actual presence of real people which exhibits specified sexual activities or specified anatomical areas, as defined in this section.\nAdult Live Entertainment Business. Any establishment or business wherein adult live entertainment is shown for observation by patrons.\nAdult Motion Picture Theatre. An enclosed building or premises used for presenting motion pictures, a preponderance of which are distinguished or characterized by an emphasis on matter depicting, describing, or relating to specified sexual activities or specified anatomical areas, as defined in this section, for observation by patrons therein. Adult motion picture theatre does not include any adult mini motion picture theatre, as defined in this section.\nAdult Mini Motion Picture Theatre. An enclosed building with viewing booths designed to hold patrons which is used for presenting motion pictures, a preponderance of which are distinguished or characterized by an emphasis on matter depicting, describing or relating to specified sexual activities or specified anatomical areas as defined in this section, for observation by patrons therein.\nSex Club. An establishment that allows members to engage in specified sexual activities with other patrons, or the exposure of specified anatomical areas. Sex clubs may include, but are not limited to, rooms for the use of members, provision of sexually oriented devices, and organization of sex-related activities.\nSexually-Oriented Devices. Without limitation, any artificial or simulated specified anatomical area or other device or paraphernalia that is designed principally for specified sexual activities but shall not mean any contraceptive device.\nSpecified Anatomical Areas.\n\nLess than completely and opaquely covered: 1) human genitals, pubic region; 2) buttock; or 3) female breast below a point immediately above the top of the areola; or\nHuman male genitals in a discernibly turgid state, even if completely and opaquely covered.\n\n\nSpecified Sexual Activities.\n\nHuman genitals in a state of sexual stimulation or arousal.\nActs of human masturbation, sexual intercourse or sodomy.\nFondling or other erotic touchings of human genitals, pubic regions, buttocks, or female breasts.\n\n\n\nAgriculture -Industrial Processes. A use that involves a variety of operations on crops and/or livestock which typically generate significant dust, noise, odors, pollutants, and/or visual impacts that can adversely affect adjacent properties. This includes, but is not limited to, concentrated animal feeding operations (CAFO), slaughterhouses, mills, dairy farms, and commercial composting.\nAirport. Facilities for the takeoff and landing of aircraft, including but not limited to runways, aircraft storage buildings, cargo storage buildings, helicopter pads, air traffic control facilities, informational facilities and devices, terminal buildings, on airport parking products, and airport auxiliary facilities, including fueling, fences, lighting, and antennae systems, on-premise signs, driveways, and access roads. Airport includes aircraft maintenance facilities, aviation instruction facilities, and heliports when part of a larger airport facility. Airport also includes facilities for the aid and comfort of the traveling public.\nAirstrip. A runway or landing area designed, used, or intended to be used for the landing and taking off of aircraft.\nAlternative Correctional Facility. A residential facility for adults or minors that is court ordered as an alternative to incarceration.\nAmusement Facility -Indoor. A facility for spectator and participatory uses conducted within an enclosed building including, but not limited to, movie theaters, arcades, bowling alleys, skating centers, escape room/physical adventure game facilities, and pool halls. An indoor amusement facility may include additional uses as part of the principal use such as, but not limited to, concession stands, restaurants, and retail sales. Indoor amusement facility does not include stadiums.\nAmusement Facility -Outdoor. A facility for spectator and participatory uses conducted outdoors or within partially enclosed structures, such as amusement parks, fairgrounds, batting cages, and miniature golf courses. An outdoor amusement facility may include additional uses as part of the principal use such as, but not limited to, concession stands, restaurants, and retail sales. Outdoor amusement facility does not include stadiums.\nAnimal Care Facility. An establishment which provides care for domestic animals, including veterinary offices for the treatment of animals, where animals may be boarded during their convalescence, pet grooming facilities, animal training centers and clubs, and pet boarding facilities, where animals are boarded during the day and/or for short-term stays by their owners.\nAnimal Shelter. A facility used to house or contain stray, homeless, abandoned, or unwanted animals and that is owned, operated, or maintained by a public body, an established humane society, animal welfare society, society for the prevention of cruelty to animals, or other nonprofit organization devoted to the welfare, protection, and humane treatment of animals. Animal shelters do not include public facilities that shelter and train canine and/or equine units of public safety agencies.\nArt Gallery. An establishment that sells, loans, and/or displays paintings, sculpture, photographs, video art, or other works of art.\nArt or Fitness Studio. An establishment where an art or activity is taught, studied, or practiced such as dance, martial arts, photography, pottery, jewelry-making, music, painting, gymnastics, pilates, or yoga. An art or fitness studio also includes private exercise studios for private sessions with trainers and/or private classes.\nBed and Breakfast. A single-family detached dwelling where a permanent resident/property owner provides lodging for a daily fee in guest rooms with no in-room cooking facilities (excluding microwaves and mini-refrigerators) and prepares meals for guests.\nBeneficial Fill Site. A site operated to recontour land for the purpose of improving land use potential or for other beneficial reuse as defined by the North Carolina Solid Waste Management Rules, 15A NCAC 13B and by N.C.G.S. Chapter 130A. It involves no excavation and accepts only fill material consisting of inert debris or used asphalt or a combination of inert debris and used asphalt. Excavation, grading, and fill activity shall not be considered a beneficial fill site if such activity is confined within the boundaries of a parcel of property or development project and involves uncontaminated soil, gravel, or rock originating on such property or development project.\nBoarding Stables, Commercial. A building, or multiple buildings, designed for the keeping and maintenance of horses for a fee or other compensation.\nBroadcasting Facility -No Antennae. Communications facilities for radio, internet, television broadcasting and receiving stations, and studios. Broadcasting facility -no antennae does not include facilities with freestanding radio and television towers, but may include dish antennas.\nBroadcasting Facility -With Antennae. Communications facilities, including radio, internet, television broadcasting and receiving stations, and studios, and including freestanding antenna towers located outdoors.\nCampground. Land used for transient occupancy by camping in tents and recreational vehicles, such as camp trailers, travel trailers, motor homes, or similar movable temporary sleeping quarters.\nCar Wash. An establishment for the washing, cleaning, and detailing of motor vehicles or other light duty equipment, whether automatic, by hand, or self-service. The car wash facility may be within an enclosed structure, an open bay structure, or other configurations.\nCemetery. Land and structures, such as columbaria, reserved for the interring of human remains or the interring of animal remains. Cemeteries may include structures for performing religious ceremonies related to the entombment of the deceased, mortuaries, including the sales of items related to the internment of remains, and related accessory structures, such as sheds for the storage of maintenance equipment. Cemeteries may also include crematoriums and embalming facilities.\nChildcare Center. An individual, agency, or organization, licensed by the North Carolina Department of Health and Human Services, providing supervision or care on a regular basis to between 13 and 79 children who are not related by blood or marriage to, and who are not the legal wards or foster children of, the supervising adult.\nChildcare Center, Accessory to Employment. An individual, agency, or organization, licensed by the North Carolina Department of Health and Human Services, providing supervision or care on a regular basis to children who are not related by blood or marriage to, and who are not the legal wards or foster children of, the supervising adult. A childcare center, accessory to employment is a facility operated solely for the use of employees of a business or businesses, such as offices, industrial uses, or other employment uses, within the development.\nChildcare Center in Residence. A facility run by an individual residing in a single family dwelling, that provides supervision or care on a regular basis in the individual’s home for six to 12 pre-school children who are not related by blood or marriage to, and who are not the legal wards or foster children of, the supervising adult. A childcare center in residence shall be licensed by the North Carolina Department of Health and Human Services.\nChildcare Center, Large. An individual, agency, or organization, licensed by the North Carolina Department of Health and Human Services, providing supervision or care on a regular basis to 80 or more children who are not related by blood or marriage to, and who are not the legal wards or foster children of, the supervising adult.\nChildcare Home, Family. A facility run by an individual that resides in a single-family dwelling that provides supervision or care on a regular basis in the individual’s home for eight or fewer children who are not related by blood or marriage to, and are not the legal wards or foster children of, the supervising adult. Family childcare homes shall be licensed by the North Carolina Department of Health and Human Services.\nChildren’s Home. A residential facility that provides housing for and care to minors who are wards of the state, whose parents or guardians are deceased or otherwise unable or unwilling to care for them.\nCommercial Kitchen. A shared commercial grade kitchen in which individuals or businesses prepare value-added food products and meals, usually paying an hourly, daily, weekly, or monthly rate to lease a space shared by others.\nCommunity Center. A facility used as a place of meeting, recreation, or social activity, that is open to the public and is not operated for profit, and offers a variety of educational and community service activities.\nCommunity Garden. Land used to grow and harvest food and non-food crops for personal or group use, consumption, or donation, that is managed and maintained by a group of individuals or a nonprofit.\nConservation Area. Designated open space that preserves and protects natural features, wildlife, and critical environmental features, as well as undeveloped sites of historical or cultural significance. A conservation area may include opportunities for passive recreation, such as hiking trails and lookout structures, and environmental education facilities.\nContinuum Care Retirement Community (CCRC). A large-scale residential development that provides continuum of care as residents age. Continuum care retirement community (CCRC) developments include a range of housing and care levels based on senior residents’ needs and how those needs progress, from independent living to nursing care. A CCRC development may consist of a range of dwelling types and independent living facilities including single-family, duplex, triplex, quadraplex, and multi-family dwellings, and may include both indoor and outdoor recreational facilities for the use of residents and their guests.\nContractor Office with Outdoor Storage. Offices for businesses in the conduct of any landscape or building trade or craft, together with land and/or structures used for the storage of equipment, vehicles, machinery, and/or materials related to and used by the trade or craft. A contractor office with no outdoor storage is considered an Office.\nConvention Center. A facility designed and used for conventions, conferences, seminars, product displays, recreation activities, and entertainment functions, along with other operations such as, but not limited to, temporary outdoor displays and food and beverage preparation and service for on-premise consumption.\nCorrectional Facility. A facility established for the detention of persons by law enforcement.\nCrematorium. A facility for the cremation of the deceased.\nCultural Facility. A facility open to the public that provides access to cultural exhibits and activities including, but not limited to, museums, cultural or historical centers, noncommercial galleries, historical societies, and libraries. A cultural facility may include additional uses as part of the principal use such as, but not limited to, retail sales of related items and restaurants.\nDomestic Violence Shelter. A facility that provides temporary shelter, protection, and support for those escaping domestic violence and intimate partner violence, including victims of human trafficking. A domestic violence shelter also accommodates the minor children of such individuals. The facility may also offer a variety services to help individuals and their children including counseling and legal guidance. Domestic violence shelters may distinguish populations served by age and/or gender.\nDormitory. A building intended or used principally for sleeping accommodations that is part of an educational or public institution, including religious institutions. A common kitchen and common gathering rooms for social purposes may also be provided.\nDrive-Through Establishment. A business where transactions only occur directly with customers via a service window, kiosk, or other configuration where customers remain in their vehicle.\nDrive-Through Facility. That portion of a business where transactions occur directly with customers via a service window, kiosk, or other configuration that allows customers to remain in their vehicle.\nDriving Range. A tract of land equipped with distance markers, clubs, balls, and tees for practicing the hitting of golf balls.\nDrug Treatment Clinic. A licensed facility authorized by the state to administer drugs including, but not limited to, methadone and suboxone, in the treatment, maintenance, or detoxification of persons. Drug treatment clinic also includes needle exchange facilities where injecting drug users (IDUs) may obtain hypodermic needles and associated paraphernalia at little or no cost.\nDwelling -Accessory Unit (ADU). An additional dwelling unit associated with and incidental to a principaldwelling. An accessory dwelling unit (ADU) shall include separate cooking and sanitary facilities and is a complete, separate dwelling unit. The ADU may be within or attached to the principal dwelling unit or within a detached accessory structure, such as a garage. ADUs are not permitted in recreational vehicles, travel trailers, campers, or any other type of motor vehicle.\nDwelling -Live/Work. A principal structure that combines a dwelling unit with a commercial use permitted in the zoning district that is used by one or more of the residents. A live/work dwelling may also include the combination of a dwelling unit with arts-related activities, such as painting, photography, sculpture, music, and film, used by one or more of the residents. Live/work dwellings are subject to the standards for the individual uses contained within this Ordinance.\nDwelling -Manufactured Home. A structure, transportable in one or more sections, which in the traveling mode is eight body feet or more in width, or 40 body feet or more in length, or, when erected on site, is 320 or more square feet; and which is built on a permanent chassis and designed to be used as a dwelling, with or without permanent foundation when connected to the required utilities, including the plumbing, heating, air conditioning, and electrical systems contained therein. Manufactured home includes any structure that meets all of the requirements of this subsection except the size requirements and with respect to which the manufacturer voluntarily files a certification required by the Secretary of HUD and complies with the standards established under the Act.\n\nFor manufactured homes built before June 15, 1976, manufactured home means a portable manufactured housing unit designed for transportation on its own chassis and placement on a temporary or semi-permanent foundation having a measurement of over 32 feet in length and over eight feet in width. Manufactured home also means a double-wide manufactured home, which is two or more portable manufactured housing units designed for transportation on their own chassis that connect on site for placement on a temporary or semi-permanent foundation having a measurement of over 32 feet in length and over eight feet in width.\nModular buildings and modular homes are not considered manufactured homes, and refer to a method of construction.\n\nDwelling – Duplex. A structure containing two dwelling units. Units may or may not be on sublots.  \nDwelling – Multi-Family. A structure containing five or more dwelling units, with dwelling units either stacked or attached horizontally. A multi-family dwelling may be designated senior living when there are age restrictions in place to limit occupancy.\n\nMulti-Family Dwelling Attached Unit. Attached unit design refers to multi-family residential structure designed with primarily side-by-side dwelling units, each with an individual entry. Units may or may not be on sublots.\n\nMULTI-FAMILY DWELLING ATTACHED UNIT\n\nMulti-Family Dwelling Stacked Unit. Stacked unit design refers to multi-family residential structure designed with multiple dwelling units accessed by one or more common entryways. Units may have individual entrances for ground floor units.\n\nMULTI-FAMILY DWELLING STACKED UNIT\nDwelling -Quadraplex. A structure containing four dwelling units. Units may or may not be on sublots.\nDwelling – Single-Family. A structure containing only one dwelling unit.\nDwelling -Triplex. A structure containing three dwelling units. Units may or may not be on sublots.\nEducational Campus. The grounds and buildings of an educational facility, which includes academic buildings, research facilities, dormitories, and other student housing through the educational institution, faculty and staff housing, fraternities/sororities, dining halls and cafeterias for the use of students, teachers, and staff, as well as indoor and outdoor recreational facilities, stadiums, broadcast facility, cultural facilities, and auditoriums that may also accommodate the general public. An educational campus may be a primary or secondary school, a university or college, a vocational school, or a combination of such. For university or college campuses, supportive commercial uses, such as retail goods establishments, personal service establishments, financial institutions, childcare centers, and restaurants, are permitted for the primary use of students, teachers, and staff. Fraternities/sororities shall be a chartered fraternal or sororal membership organization or association, used as a residence and/or a dining and recreational facility for members of organizations or associations who are students at a university, which permits the organization or association to use its facilities because of the relationship of such organization or association to the body of students enrolled in such institution.\nEducational Facility -Pre-School. An educational establishment that offers early childhood education prior to the start of required education at the primary school level.\nEducational Facility -Primary or Secondary. A facility that offers instruction at the elementary, middle, junior, and/or high school levels, including associated indoor or outdoor recreational facilities.\nEducational Facility -University or College. A facility for post-secondary higher learning that grants associate, bachelor, master, and/or doctoral degrees. Such facilities may include additional uses as part of the principal use such as such as research facilities, dormitories, cafeterias, restaurants, retail sales, childcare facilities, indoor or outdoor recreational facilities, stadiums, and similar uses.\nEducational Facility -Vocational. A facility that offers instruction in industrial, clerical, computer, managerial, automotive, repair (electrical, plumbing, carpentry, etc.), or commercial skills, or a business conducted as a commercial enterprise, such as a school for general educational development or driving school. Educational facility -vocational also applies to privately operated schools that do not offer a full educational curriculum.\nEmployment/Labor Service Agency. A business that provides employment services for temporary or transient employment of semi-skilled and unskilled workers, and operates as a labor pool where workers gather on-site for job placement.\nFarm. Land used primarily for the growing of crops, produce, and/or flowers. Horses and/or other livestock may also be raised for personal use.\nFarm, Bona Fide -Charlotte ETJ Only. A bona fide farm is a farm as defined within N.C.G.S. § 160D-903, or as may be amended, and is located within the Charlotte extraterritorial jurisdiction (ETJ).\nFinancial Institution. A bank, savings and loan, credit union, or mortgage office. Financial Institutions also include alternative financial service (AFS) that are provided outside a traditional banking institution, including check cashing establishments and currency exchanges.\nFood Bank. A non-profit organization that collects and distributes food to hunger relief organizations. Food is not distributed to individuals from a food bank.\nFood Pantry. A non-profit organization that provides food directly to individuals. Food pantries receive, buy, store, and distribute food. Food pantries may also prepare meals to be served at no cost to those who receive them.\nFuneral Home. An establishment where the dead are prepared for burial display and for rituals before burial or cremation, including chapels for the display of the deceased and the conducting of rituals before burial or cremation, and crematoriums.\nGas Station. An establishment where fuel for vehicles is stored and dispersed from fixed equipment into the fuel tanks of motor vehicles. A gas station may also include retail uses and an accessory car wash bay.\nGolf Course. A tract of land design with at least nine holes for playing a game of golf and improved with tees, greens, fairways, and hazards. A golf course may include a clubhouse, restrooms, snack-bar, and pro-shop as additional uses as part of the golf course. A driving range may be included as part of a golf course. A private recreation club may include a golf course as part of the principal use.\nGovernment Office/Facility. Offices owned, operated, or occupied by a governmental agency to provide a governmental service to the public, such as city offices and post offices. Government offices/facilities do not include public safety or public works facilities.\nGovernment Campus. A development designed to accommodate government offices and facilities in one or more buildings, including public safety and defense facilities, such as police academies and armories, and correctional facilities. Supportive commercial uses for the primary use of government campus staff and visitors, such as retail goods establishments, personal service establishments, financial institutions, childcare centers, and restaurants, are permitted.\nGreenhouse/Nursery -Retail. An establishment where flowers, shrubbery, vegetables, trees, and other horticultural and floricultural products are propagated and sold, and may include gardening and landscape supplies and products, such as hardware, garden tools and utensils, paving stones and bricks, and other related items for sale. If all such activities are indoors with no outdoor component (growing, displays, storage, sales), then such use is considered a retail goods establishment.\nGreenhouse/Nursery -Wholesale. An establishment where flowers, shrubbery, vegetables, trees, and other horticultural and floricultural products are propagated and sold in bulk to retailers, other professional business users, and/or other wholesalers.\nGroup Home. Group home means a “Family Care Home” as defined in N.C.G.S § 160D-907. A group home is a home with support and supervisory personnel that provides room and board, personal care, and habilitation services in a family environment for not more than six resident persons with disabilities. Person with disabilities are defined as a person with a temporary or permanent physical, emotional, or mental disability, including, but not limited to, an intellectual or other developmental disability, cerebral palsy, epilepsy, autism, hearing and sight impairments, emotional disturbances, and orthopedic impairments but not including persons with a mental illness who are dangerous to others as defined in G.S. 122C-3(11)b. In addition, a group home also means a residential use, even if it does not conform to the language above, that provides a residential environment which may require various services, living assistance, or supervision but does not include any facility that provides medical services requiring or comparable to on-site, nursing, physician, or medical care for the occupants which is only permitted in a dependent living facility or healthcare institution.\nHalfway House. A residential facility for persons who have been institutionalized for criminal conduct and require a group setting to facilitate the transition to society.\nHealthcare Institution. Facilities for primary health services and medical or surgical care to people, primarily inpatient overnight care, and including related facilities such as laboratories, outpatient facilities, dormitories, educational facilities, cafeterias, retail sales, and similar uses.\nHeavy Rental and Service Establishment. Rental and/or service establishments of a heavier and larger-scale commercial character typically requiring permanent outdoor service and storage areas and/or partially enclosed structures. Examples of heavy rental and service establishments include truck rental establishments, amusement equipment rental, and rental and repair of heavy equipment.\nHeavy Retail Establishment. Retail centers of a heavier and/or larger-scale commercial character typically requiring permanent outdoor storage areas and/or partially enclosed structures. Examples of heavy retail establishments include large-scale home improvement centers with outdoor storage and display, lumberyards, recreational vehicle dealerships, and sales of heavy equipment. Wholesale establishments that sell to the general public, including those establishments where membership is required, are considered heavy retail establishments.\nHelistop. Land or part of a structure used for the landing of helicopters.\nHome Occupation. An activity carried out for economic gain by a resident, conducted as an accessory use in the resident’s dwelling.\nHomeless Shelter. A facility that provides overnight, temporary, or transitional shelter and services to the homeless in general.\nHotel/Motel. A commercial facility that provides sleeping accommodations for a fee and customary lodging services. Related accessory uses may include, but are not be limited to, meeting facilities, restaurants, bars, and recreational facilities for the use of guests. A hotel/motel has common facilities for reservations, cleaning services, combined utilities, and on-site management and reception.\nIndustrial Design. An establishment where the design, marketing, and/or brand development of various products are researched and developed typically integrating the fields of art, business, science, and/or engineering. An industrial design establishment may create prototypes and products, but cannot mass manufacture products on the premises.\nIndustrial, Craft. Artisan-related crafts and industrial processes that are more intensive uses, such as metalworking, glassblowing, woodworking, furniture making, and food production that includes preparation, processing, canning, or packaging of food products. Micro-production of alcohol is regulated separately from craft industrial.\nIndustrial, General. Within a wholly enclosed building or out-of-doors, the manufacture, fabrication, processing, reduction, and/or destruction of any article, substance, or commodity, or any other treatment thereof, in such a manner as to change the form, character, and/or appearance. A general industrial use may produce noise, vibrations, illumination, odor, or particulate that is perceptible to adjacent land users.\nIndustrial, Light. Within a wholly enclosed building, the manufacture, fabrication, processing, reduction, and/or destruction of any article, substance, or commodity, or any other treatment thereof in such a manner as to change the form, character, and/or appearance. A light industrial use may also include a showroom, sales of products related to the items manufactured or stored on-site, and/or outdoor storage.\nKennel. A facility for the breeding and raising of domestic animals for sale.\nLandfill, Land Clearing, and Inert Debris (LCID). A facility for the land disposal of inert debris, land clearing debris, yard waste, and untreated and unpainted wood.\nLight Assembly. The assembly of previously manufactured parts within a fully enclosed structure that does not create noise, smoke, fumes, odors, glare, or health or safety hazards outside the building.\nLive Performance Venue -Indoor. An indoor facility for the presentation of live entertainment, including musical acts and disc jockeys, theatrical plays, stand-up comedy, and similar performances. Performances are scheduled in advance and tickets are required for admission and available for purchase in advance, though tickets may be purchased at the venue’s box office on the day of the performance. A live performance venue may include classroom and/or rehearsal space utilized during hours it is not open to the public for a performance. A live performance venue may include concession stands, including sale of alcohol, but only when it is open to the public for a performance. This does not include any adult use or stadium.\nLodge/Meeting Hall. A facility operated by an organization or association for a common purpose, such as, but not limited to, a meeting hall for a fraternal or social organization or a union hall, but not including clubs organized primarily for-profit or to render a service which is customarily carried on as a business.\nManufactured Home Park. A parcel of land with single control or unified ownership that has been planned and improved for the placement of manufactured homes for residential use.\nMarina. A facility with navigable water access for docking or storage of boats or providing services to boats and the occupants thereof. Services may include minor servicing and repair to boats while in the water, sale of fuel and supplies, food, beverages, and entertainment as accessory uses. A yacht club is considered a marina.\nMedical Campus. The grounds and buildings of a healthcare institution, providing primary health services and medical or surgical care to people, including in-patient overnight care, as well as research and development facilities, medical/dental educational facilities, and medical/dental offices. A medical campus may include dormitories and other housing through the medical institution, dining rooms, cafeterias, gift shops, and pharmacies for the use of staff, patients, and visitors. Supportive commercial uses for the primary use of medical campus staff and visitors, such as retail goods establishments, personal service establishments, financial institutions, childcare centers, and restaurants, are permitted.\nMedical/Dental Office. A facility operated by one or more physicians, dentists, chiropractors, psychiatrists, physical therapists, acupuncturists, or other licensed practitioners of the healing arts for the examination and treatment of persons solely on an outpatient basis.\nMicro-Production of Alcohol. A facility for the production and packaging of alcoholic beverages, such as beer, wine, spirits, cider, and mead, for distribution and consumption on-premises. A tasting room is an area within the premises of the production facilities where guests may sample the products. When the production facilities exceed the maximum square footage allowed by any prescribed conditions, the facility is not considered micro-production of alcohol, but rather an industrial use.\nMobile Car Wash. A temporary service, and its associated equipment, for the washing, cleaning, and detailing of motor vehicles by hand. A mobile car wash operates from a fixed location to offer services to multiple cars on that site for a limited period of time.\nMobile Food Vendor. A motor vehicle or food trailer towed by another vehicle, designed and equipped to sell food and/or beverages directly to consumers. It does not include wholesale food distributors. The vendor physically reports to and operates from an off-site kitchen for servicing, restocking, and maintenance each operating day.\nMobile Retail Vendor. A motor vehicle, or trailer towed by another vehicle, designed and equipped to sell goods directly to consumers. It does not include wholesale distributors. The vendor physically reports to and operates from an off-site facility for servicing, restocking, and maintenance.\nMovie Studio. Facilities for the production of motion pictures and film, including stages, exterior sets, film laboratories, sound recording facilities, construction, repair and storage facilities, caretaker and temporary housing, related commercial vehicles, and accessory fabrication activities.\nMulti-Dwelling Development. A development consisting of two or more single-family, duplex, triplex, quadraplex, and/or multi-family principal buildings located on a lot or parcel of land under single ownership, and planned and developed with a unified design of buildings and coordinated open space and service areas. Only those dwelling types allowed within the zoning district are allowed within the multi-dwelling development.\nNeighborhood Commercial Establishment. Select commercial uses located within a residential neighborhood to serve the surrounding residents.\nNightclub. An establishment that provides entertainment of a participatory nature, including disc jockeys, by providing a place for dancing designed with an area designated as a dance floor, including any stage area; however, portions of the floor area may be set up for alcohol service, including a bar counter, with or without stools, and other seating areas.\nOffice. An establishment that engages in the processing, manipulation, or application of business information or professional expertise. An office may or may not offer services to the public. An office is not materially involved in fabricating, assembling, or warehousing of physical products for the retail or wholesale market, nor engaged in the repair or sale of products for immediate purchase and removal from the premise by the purchaser.\nOffice Campus. A development of one or more buildings designed to accommodate offices, corporate headquarters, research and development, broadcast facilities, and/or fully enclosed light assembly with no outdoor storage. An office campus may also include hotels/motels, medical/dental offices, and a healthcare institution of 25,000 square feet or less in gross floor area. Supportive commercial uses for the primary use of office campus staff and visitors, such as of retail goods establishments, personal service establishments, financial institutions, childcare centers, and restaurants, are permitted.\nOutdoor Entertainment. Outdoor entertainment as an accessory use means presentation of live entertainment, including musical acts and disc jockeys, theatrical plays, stand-up comedy, and similar live performances, or the presentation of a live or pre-recorded major sporting event, media event, movie, or similar. Outdoor entertainment occurs on the premises of, but outside of, a restaurant, bar, amusement facility, or similar uses. Entertainment occurs outdoors when it is outside a permanently enclosed area.\nOutdoor Market. A market consisting of booths, tables, platforms, mobile units, or similar displays where producers and/or growers sell fresh food, flowers and plants, value-added products, and artisan wares at stalls or mobile units in a permanent outdoor location. Individual vendors may operate one or more booths, under the supervision of a market proprietor, who rent or otherwise arrange for assigned space(s) for each vendor.\nOutdoor Sales and Display. Part of a lot used for outdoor sales and/or display of goods accessory to the principal use.\nOutdoor Seating/Activity Area. An outdoor seating/activity area as an accessory use is located outside the permanent enclosed area, and is used for seating, for food and/or beverage consumption, and/or participatory activities such as trivia or skill games like darts. This includes, but is not limited to, areas such as patios, decks, rooftops, and open areas.\nOutdoor Storage Yard. The storage of materials, supplies, equipment, vehicles, and similar items outdoors as the principal use of land. Salvage and/or junk yard is a separate use from outdoor storage yard.\nParking Lot (Principal Use). A lot, which excludes any public or network-required private street, used for the parking of operable vehicles, whether for compensation or at no charge. A parking lot (principal use) is not accessory to or associated with any other use on the same or any other lot.\nParking Structure (Principal Use). A structure or portion of a structure used for the parking of operable vehicles, whether for compensation or at no charge. A parking structure (principal use) is not accessory to or associated with any other use on the same or any other lot.\nPassenger Terminal. A facility for the assembly and dispersal of travelling passengers by means of intercity rail, bus, or other mode of transit, including offices for such services, and additional uses such as passenger waiting areas, restaurants, and retail establishments. Passenger terminal does not include airport or CATS public transit facilities.\nPersonal Service Establishment. An establishment that provides services of a personal nature. Typical uses include, but are not limited to, beauty shops, barbershops, body modification establishments (e.g., tattoos, piercing, etc.), tanning salons, electronics repair shops, bicycle repair shops, nail salons, laundromats, health clubs, dry cleaners, and tailors.\nPlace of Worship. A facility where persons regularly assemble for religious purposes and related social events, and may include group housing for persons under religious vows or orders. Places of worship may include additional uses as part of the principal use such as childcare facilities, meeting rooms, food preparation and dining areas, auditoriums, and/or classrooms for religious instruction.\nPrivate Recreation Club. An establishment open to members, their families, and invited guests organized and operated for social and recreation purposes and which may include recreation facilities, both indoor and outdoor, restaurants and bars, meeting rooms, and/or similar uses.\nPrivate Stables. The keeping of equines for private use and not for remuneration, hire, or sale.\nPublic Park. A publicly-owned facility that serves the recreational needs of residents and visitors. Public park includes, but is not limited to, playgrounds, ballfields, football fields, soccer fields, basketball courts, tennis courts, dog parks, skateboard parks, passive recreation areas, and gymnasiums. Public parks may also include noncommercial indoor or outdoor facilities, including zoos, recreational centers, and amphitheaters, additional uses such as, but not limited to, restaurant and retail establishments, and temporary outdoor uses such as festivals and performances. Greenways are not considered a public park (see Article 2 for greenway definition).\nPublic Safety Facility. A facility operated by and for the use of public safety agencies, such as the fire department and the police department, including the dispatch, storage, and maintenance of police and fire vehicles, and training exercises. Public safety facilities include shelter and training facilities for canine and equine units of public safety agencies.\nPublic Transit Facility. Facilities operated as part of the public transit system, which shall include park-and-ride lots, park-and-ride garages, station platforms, bus transfer stations, rideshare mobility hubs, and other transit appurtenances required for the operations and use of public transit service. For the purposes of this Ordinance, bus shelters and rapid transit shelters that are not fully enclosed are not considered buildings.\nPublic Works Facility. A facility operated by and for the use of the municipal public works departments or other governmental agency to provide municipal services, such as but not limited to, the treatment of waste water and potable water; the dispatch, storage, and maintenance of municipal vehicles; and training exercises.\nQuarry. A type of open pit mine in which dimension stone, rock, construction aggregate, riprap, sand, gravel, or slate is excavated from the ground.\nRaceway/Dragstrip. A facility built for racing of vehicles that may include grandstands and/or concourses for viewing. A raceway/dragstrip may also include additional uses as part of the principal use such as, but not limited to, concession stands, restaurants, and retail sales.\nRail Freight Terminal. A heavy rail facility for freight pick-up or distribution that may include intermodal distribution facilities for truck or shipping transport.\nReal Estate Project Sales Office. A real estate project sales office is a residential unit, commercial space, or standalone structure within a development that is temporarily used as a sales or leasing office.\nReception Facility. A facility that provides hosting and rental services of a banquet hall or similar facilities for private events including, but not limited to, wedding receptions, holiday parties, corporate events, and fundraisers, with food and beverages that are prepared and served on-site or by a caterer to invited guests during intermittent dates and hours of operation. Live entertainment may occur as part of an event. A reception facility is not operated as a restaurant with regular hours of operation.\nRecycling Collection Center. An area containing one or more recycling containers operated by a unit of local government, or its designee, which is set aside and used by members of the public, including business entities, to collect recyclable materials, such as paper, plastics, glass, and cardboard. A recycling collection center may also collect household chemicals and computer equipment, including, but not limited to, household cleaners, oil-based paints, solvents, cell phones, compact fluorescent light bulbs, and computers.\nReligious Campus. The grounds and buildings of a place of worship where regular assembly of persons for religious purposes and related social events occurs and which is maintained and controlled by a religious body organized to sustain religious ceremonies and purposes. A religious campus may include supporting office uses, childcare centers, and classrooms for religious study. Supportive commercial uses for the primary use of religious campus staff and visitors, such as retail goods establishments, personal service establishments, and restaurants, are permitted.\nResearch and Development (R&D). A facility where research and development are conducted in industries that include, but are not limited to, biotechnology, pharmaceuticals, medical instrumentation or supplies, communication, information technology, electronics and instrumentation, and computer hardware and software.\nResidential Care Facility. A licensed care facility that provides 24-hour medical and/or non-medical care of persons in need of personal services, supervision, or assistance essential for sustaining the activities of daily living, or for the protection of the individual. A residential care facility includes nursing care, assisted living, hospice care, and continuum of care facilities. Continuum of care facilities may also include independent living facilities as part of the continuum.\nRestaurant/Bar. An establishment where food and/or alcoholic beverages are provided to the public for on-premises consumption and/or food may be sold for off-premise consumption through carry-out service.\nRetail Goods Establishment. An establishment that provides physical goods, products, or merchandise directly to the consumer, where such goods are typically available for immediate purchase and removal from the premises by the purchaser. A retail goods establishment does not include specialty food service.\nRetail Goods Showroom. An establishment where products are displayed for sale, such as furniture, appliances, carpet, tile, or furnishings. Products are available for purchase but are typically not available for immediate removal from the premises.\nRooming House. A single-family detached dwelling where a permanent resident or the property owner makes rooms available to tenants for compensation for a minimum of seven consecutive days, and a common kitchen and common areas are shared between the permanent resident/property owner and tenants.\nSalvage and/or Junk Yard. A facility used for the abandonment, sale, storage, collection, or baling of scrap metal, other scrap or discarded materials, waste tire processing or collection area, and/or abandoned vehicles or machinery, or parts thereof.\nSelf-Storage Facility: Climate-Controlled. A facility for the storage of personal property where individual renters control and access individual storage spaces located within a fully enclosed building that is climate controlled. Sales of related items, such as moving supplies, and facility management offices may also be included.\nSelf-Storage Facility: Outdoor. A facility for the storage of personal property where individual renters control and access individual storage spaces and where each storage unit has individual access from the outdoors, and which may have areas available for accessory outdoor storage. Sales of related items, such as moving supplies, and facility management offices may also be included.\nShooting Range, Indoor. A facility designed or used for shooting at targets with firearms, and which is completely enclosed within a building or structure. Police facilities for the training and practice of officers is not considered an indoor shooting range but rather a public safety facility.\nSingle Room Occupancy (SRO). A residential development where single rooms are rented individually as a permanent and/or primary residence, without kitchen or bathroom amenities in the rooms, for a weekly or monthly period of time for compensation. On-site management is provided on a 24 hour basis. A single room occupancy (SRO) has shared bathroom facilities and may have kitchen facilities, where both types of facilities are freely accessed by all building tenants.\nSocial Service Campus. The grounds and buildings of social service facilities that provide assistance for those recovering from chemical or alcohol dependency; survivors of abuse seeking support; those transitioning from homelessness or prior incarceration; and those with health and disability concerns. A social service campus includes supporting office uses, medical/dental offices, childcare centers, recreational and exercise facilities, food pantries, and community centers. A social service campus may also include supportive housing such as dormitories, multi-family housing through the social service institution, group homes, children’s homes, halfway houses, single room occupancy developments, homeless shelters, and domestic violence shelters.\nSocial Service Facility. A service establishment that provides assistance for those recovering from chemical or alcohol dependency; survivors of abuse seeking support; those transitioning from homelessness or prior incarceration; and those with health and disability concerns. It does not include in-patient, overnight, or living quarters for recipients of the service or for the staff. Such service does not include medical examinations or procedures, medical detoxification, dispensing of drugs or medications, or other treatments normally conducted in a medical office.\nSolar Farm. A ground-mounted solar array operated by a public, private, or cooperative company for the generation, transmission, distribution, storage, or processing of solar energy for the purposes of heating and cooling, electricity generation, and/or water heating. Solar panels as an accessory use, such as those serving a home or business on the same site, are not considered to be a solar farm.\nSpecialty Food Service. A facility that includes preparation, processing, canning, and/or packaging of food products where all processing is completely enclosed and there are no outside impacts or outdoor storage. Such business specializes in the sale of specific food products, such as a coffee roaster or candy maker, and offers areas for retail sales or restaurants that serve the products processed on-site.\nStadium. A commercial structure with tiers of seats and/or viewing areas around and/or adjacent to a field, court, or stage, intended to be used for the viewing of athletic events, entertainment, concerts, and other public gathering purposes. Stadiums may be indoor or outdoor.\nTemporary Contractor’s Office and Contractor’s Yard. A temporary, portable, or modular structure utilized as a watchman’s quarters, construction office, or equipment shed during the construction of a new development. This may include a temporary contractor’s yard where materials and equipment are stored in conjunction with a construction project.\nTemporary Outdoor Entertainment. A temporary entertainment event within an outdoor space, such as but not limited to the performance of live music, festivals, competitions, fireworks shows, carnivals/ circuses, worship services, and others.\nTemporary Outdoor Sales. Temporary uses, which may include temporary structures, where goods are sold, such as consignment auctions, arts and crafts fairs, plant sales, farmers markets, flea markets, rummage sales, and holiday sales, such as Christmas tree lots and pumpkin sales lots. This temporary use category does not include outdoor sales related to a retail goods establishment where such goods are part of the establishment’s regular items offered for purchase.\nTemporary Outdoor Storage Container. Temporary self-storage containers that are delivered to a residence or business owner for the purpose of storing belongings, and then may be picked up and returned to a warehouse until called for again.\nTruck Stop. A facility that provides services to the trucking industry including, but not limited to, dispensing of fuel, repair, truck washes, restaurants, shower facilities, and/or overnight parking, all as part of the facility.\nTruck Terminal. A facility for the receipt, transfer, short-term storage, and dispatching of goods transported by truck.\nUtility (Includes Transmission and Distribution). Any facility, infrastructure, and/or equipment used for the generation, transmission, storage, or distribution of electric energy, natural or manufactured gas, water, stormwater, cable television, internet, telephone services, or wastewater, between the point of generation and the end user. A utility does not include wireless telecommunications towers, antennas and/or facilities, satellite dish antennas, waste management facilities, recycling collection facilities, or radio, television, or microwave transmission or relay towers. Utility also includes utility operation facilities where all activity occurs indoors.\nVehicle Auction Facility. A facility where vehicles are offered for sale to persons who bid on the vehicles in competition with each other. A vehicle auction facility includes outdoor storage of the vehicles to be sold.\nVehicle Dealership: Enclosed. An establishment that sells or leases new or used automobiles, vans, pick- ups, motorcycles, and/or all-terrain vehicles (ATV), or other similar motorized transportation vehicles with no outdoor storage or display of such vehicles on-site, including within a parking structure. An enclosed motor vehicle dealership may maintain an inventory of the vehicles for sale or lease off-site. Vehicle dealerships do not include truck, trailer, boat, or heavy equipment sales, which are considered heavy retail establishments.\nVehicle Dealership: Outdoor. An establishment that sells or leases new or used automobiles, vans, pick- ups, motorcycles, and/or all-terrain vehicles (ATV), or other similar motorized transportation vehicles with outdoor storage or display of such vehicles on-site. An outdoor motor vehicle dealership may maintain an additional inventory of the vehicles for sale or lease off-site. Vehicle dealerships do not include truck, trailer, boat, or heavy equipment sales, which are considered heavy retail establishments.\nVehicle Operations Facility. A facility for the dispatch, storage, and maintenance of vehicle fleets including, but not limited to, emergency medical care vehicles, taxicabs and similar vehicles for hire, school buses, utility vehicles, delivery vehicles, and public transit vehicle operations and maintenance facilities. Vehicle operations facility does not include a public works or public safety facility.\nVehicle Rental: Enclosed. An establishment that rents motor vehicles and motorcycles, including incidental parking and servicing of vehicles with no outdoor storage and display of such vehicles on-site, including within a parking structure. An enclosed vehicle rental establishment may maintain an inventory of the vehicles for rent off-site.\nVehicle Rental: Outdoor. An establishment that rents motor vehicles and motorcycles, including incidental parking and servicing of vehicles with outdoor storage and display of such vehicles on-site. An outdoor vehicle rental establishment may maintain an additional inventory of the vehicles for rent.\nVehicle Repair Facility: Major. A business that provides services in major reconditioning of worn or damaged motor vehicles, motorcycles, all-terrain vehicles (ATV), recreational vehicles and trailers, towing and collision service, including body, frame, or fender straightening or repair, painting of motor vehicles, interior (e.g., upholstery, dashboard, etc.) reconstruction and/or repairs, and restoration services. A major vehicle repair business may also include services considered minor vehicle repair.\nVehicle Repair Facility: Minor. A business that provides services in minor repairs to motor vehicles and motorcycles, including repair or replacement of cooling, electrical, fuel and exhaust systems, brake adjustments, tire replacement, wheel servicing, alignment, and balancing, realignment, repair and replacement of shock absorbers, and replacement or adjustment of mufflers and tail pipes, hoses, belts, light bulbs, fuses, windshield wipers/wiper blades, grease retainers, and wheel bearings, and similar minor repairs.\nWarehouse and Distribution Center. An enclosed facility for the storage and distribution of manufactured products, supplies, and/or equipment.\nWaste Management Facility. Facilities for the recovery, disposal, depositing, processing, or storage of solid waste, including waste that requires special handling, such as hazardous waste and medical waste. Waste management facilities include sanitary landfills, construction and demolition landfills, solid waste collection sites, and solid waste transfer stations.\nWholesale Goods Establishment. A business where goods are sold to either retailers, or to industrial, commercial, institutional, or other professional business users, or to other wholesalers and related subordinated services.\nWind Farm. An energy system operated by a public, private, or cooperative company for the generation, transmission, distribution, or processing of wind energy.\nWireless Telecommunications. Towers, antennas, and facilities used to transmit and receive signals that facilitate wireless telecommunications. The following definitions describe the wireless telecommunications infrastructure within the general definition for wireless telecommunications:\n\nWireless Antenna.A specific device, the surface of which is used to transmit and/or receive signals transmitted to or from other antennas. This does not include satellite dish antennae.\nWireless Facility.A structure used to house and protect the equipment necessary for processing telecommunications signals, which may include air conditioning equipment and emergency generators. Facility also includes any necessary equipment that facilitates wireless transmission.\nWireless Tower.A structure designed and constructed to support one or more wireless telecommunications antennae and including all appurtenant devices attached to it.\n\n", "metadataJson": "{\"section_url\": \"/articles/article-15-use-regulations/#153-use-definitions\"}"}, {"title": "15.4 PRINCIPAL USES: PRESCRIBED CONDITIONS", "text": "A. Adult Care CenterB. RESERVEDC. Adult Electronic Gaming Establishment\nA zoning use permit is required.\nMinimum spacing requirements for adult electronic gaming establishments are as follows:\n\nAll adult electronic gaming establishments shall be separated by a distance of at least 1,000 feet from any Neighborhood 1 or Neighborhood 2 Place Type, educational facility, place of worship, child care center, or public park. An adult electronic gaming establishment lawfully operating as a conforming use is not rendered a nonconforming use by the subsequent location of any Neighborhood 1 or Neighborhood 2 Place Type, educational facility, place of worship, child care center, or public park within the 1,000 foot separation distance.\nAll adult electronic gaming establishments shall be separated by a distance of at least 1,000 feet from any other adult electronic gaming establishments.\nNo more than one adult electronic gaming establishments may be located within the same structure.\n\n\nAdult electronic gaming establishments may operate from 8:00 a.m. to 10:00 p.m. (local time) each day, seven days per week.\nThe maximum number of machines/computers/tables/terminals for electronic gaming shall be limited to 20.\nAlong frontages, any windows of an adult electronic gaming establishment shall be clear glass allowing for visibility from the exterior through to the interior, with the exception of window signs as allowed by this Ordinance.\nAdult electronic gaming establishments shall comply with all applicable federal, state, and local laws, including but not limited to, tax code, building code, fire code, and environmental health regulations.\nThe provisions of this section are not subject to variance by the UDO Board of Adjustment.\nD. Adult Use\nAll adult uses shall be separated by a distance of at least 1,000 feet from any Neighborhood 1 or Neighborhood 2 Place Type, educational facility, place of worship, child care center, or public park. An adult use lawfully operating as a conforming use is not rendered a nonconforming use by the subsequent location of any Neighborhood 1 or Neighborhood 2 Place Type, educational facility, place of worship, child care center, or public park within the 1,000 foot separation distance.\nAll adult uses shall be separated by a distance of at least 1,000 feet from any other adult use.\nNo more than one adult use may be located within the same structure.\nE. Agriculture – Industrial Process\nThe minimum area for agriculture – industrial processes shall be 20 acres.\nAll animal processing facilities shall be located 250 feet from any lot line.\nThis use is not permitted inside the Airport Noise Disclosure Overlay District.\nF. Airstrip\nAn airstrip and all associated structures shall be located 100 feet from any lot line.\nNo part of the airstrip and any associated structures may be located within a required setback.\nG. Alternative Correctional Facility\nA zoning use permit is required.\nAn alternative correction facility is subject to the standards for a single-family dwelling unless modified by this section.\nNew alternative correctional facilities shall be separated from existing alternative correctional facilities by a minimum of 800 feet.\nAlternative correction facilities shall be limited to six residents.\nH. Amusement Facility – Indoor\nAll windows and doors shall remain closed between the hours of 11:00 p.m. and 8:00 a.m.\nI. Amusement Facility – Outdoor\nWhen abutting a Neighborhood 1 or Neighborhood 2 Place Type, the outdoor activity area, including outdoor dining areas and outdoor entertainment areas, shall be located a minimum of 200 feet from such lot line. This does not include parking facilities.\nJ. Animal Care Facility\nWhen abutting a Neighborhood 1 or Neighborhood 2 Place Type, the exterior exercise area shall be located a minimum of 200 feet from such lot line.\nAnimal care facilities shall locate exterior pens, runs, training, and exercise areas to the side or rear of the building.\nAll exterior exercise areas shall be completely fenced.\nAnimal care facilities shall locate all overnight boarding indoors.\nK. Animal Shelter\nWhen abutting a Neighborhood 1 or Neighborhood 2 Place Type, the exterior exercise area shall be located a minimum of 200 feet from such lot line.\nAnimal shelters shall locate exterior exercise areas to the side or rear of the building.\nAll exterior pens, runs, training, and exercise areas shall be completely fenced.\nAnimal shelters shall locate all overnight boarding indoors.\nL. Bed and Breakfast\nA zoning use permit is required.\nBed and breakfasts are subject to the standards for a single-family dwelling unless modified by this section.\nThe maximum number of guest rooms permitted is as follows:\n\nNeighborhood 1 Zoning District: Four guest rooms.\nAll other zoning districts when permitted: Eight guest rooms.\n\n\nAll guest rooms and the occupants of the premises shall be in the principal residential single-family structure. Separate structures, accessory buildings, and garages are not permitted to be used as living units or guest rooms.\nAll guest rooms shall be accessed from the interior of the building. Separate exterior access to guest rooms is prohibited.\nGuests are limited to a length of stay of no more than seven consecutive days.\nBed and breakfasts may provide food service only to guests lodging in the facility.\nA property may only be used for either a bed and breakfast or rooming house at any one time.\nM. Beneficial Fill Site \nBeneficial fill sites 1/4 acre or greater on one parcel require a zoning use permit and site approval. Beneficial fill sites of less than 1/4 acre on one parcel do not require a zoning use permit or site approval and are exempt from this section, except for items 2, 3, and 4. In addition, item 5 shall be required if the beneficial fill site contains material such as concrete, concrete block, brick, or used asphalt.\nThe site shall be operated only between the hours of 8:00 a.m. and 6:00 p.m. Monday through Saturday.\nFinal fill elevation shall match or compliment adjacent surrounding topography. The final contours and drainage patterns of the fill area shall not adversely affect adjacent properties.\nNo fill, which includes used asphalt, shall be placed in any portion of a regulatory floodplain, including both the floodway and flood fringe area.\nNo portion of a beneficial fill site shall be located within 15 feet of any lot line. This includes structures, equipment storage, parking areas, and fill areas. However, during closure of the site, the 15-foot separation area may be filled if necessary to match or compliment adjacent surrounding topography.\nThe location of a beneficial fill site shall be indicated on a recorded plat. A recorded survey of the site is required after completion and must be submitted to the Planning Department.\nAny such site may not be operated for more than 12 months.\nN. Boarding Stables, Commercial\nThe minimum area for a commercial boarding stable shall be two acres.\nAll structures for the keeping and maintenance of animals, equipment, or manure and all manure piles, pits, or bins shall be located a minimum of 50 feet from any lot line.\nThe following activities are permitted as part of the operation of a commercial horse stable:\n\nHorse auctions.\nHorse breeding.\nHorse clinics.\nHorse demonstrations and exhibitions (horse shows), which may be conducted without a temporary use permit. This excludes spectator sport horse racing, which is prohibited.\nBoarding horses.\nEquine therapy.\nRenting horses for recreational riding.\nRiding lessons.\n\n\nO. Broadcasting Facility – With Antennae\nRadio and television tower antennas may exceed the zoning district height limits but shall be separated from any abutting lot line by one foot for every two feet in height above the permitted height.\nIn addition, if a broadcasting facility – with antennae is located on a lot that abuts a Neighborhood 1 or Neighborhood 2 Place Type, the radio or television tower antennas shall be setback from all lot lines a minimum of 110% of the tower height as measured from the base of the antenna.\nP. Campground\nThe minimum area for a campground is six acres.\nCampgrounds shall provide a common recreational area consisting of 100 square feet per campsite or recreational vehicle parking site.\nManagement headquarters, recreational facilities, coin operated laundry facilities, cabins for staff, and other uses and structures customarily associated with the operation of a campground are permitted.\nStorage of equipment shall be within enclosed structures.\nYear-round residency is prohibited at any campground. Use of tents or recreational vehicles as a principal residence is prohibited. This excludes any structures erected for an on-site caretaker or manager, which may be a year-round residency.\nIndividual campsites or recreational vehicle parking sites shall be set back a minimum of 100 feet from all lot lines.\nQ. Carwash\nA Class C landscape yard shall be required along the side and rear lot lines, unless Article 20 requires a higher class of landscape yard.\nR. Cemetery\nTombstones, crypts, monuments, columbaria, and mausoleums shall be located a minimum of 25 feet from any side or rear lot line that abuts an Neighborhood 1 or Neighborhood 2 Place Type and a minimum of ten feet from any side or rear lot line that abuts any other lot. In addition, they shall be a minimum of 40 feet from any lot line abutting a public or network-required private street.\nCrematoriums and funeral homes are only permitted within cemeteries of 100 acres or more.\nAll buildings shall be located a minimum of 100 feet from any lot line that abuts a Neighborhood 1 or Neighborhood 2 Place Type. In addition, cemeteries shall be exempt from the following zoning district standards:\n\nMinimum build-to zones and build-to percentages\nBuilding articulation requirements\nMinimum transparency requirements\nBuilding design standards (excluding building materials)\n\n\nS. Childcare Center\nEach facility shall comply with all applicable federal and state regulations. The operator shall be licensed and such license displayed publicly.\nOutdoor play space and equipment shall be located to the rear or side of the principal building.\nIn the Neighborhood 1 Zoning Districts, primary vehicular  access is only permitted via arterial and collector streets, and limited access roadways where allowed.\nT. RESERVEDU. Childcare Center, Large\nIn the Neighborhood 1 Zoning Districts, primary vehicular access is only permitted via arterial and collector streets, and limited access roadways where allowed.\nEach facility shall comply with all applicable federal and state regulations. The operator shall be licensed and such license displayed publicly.\nOutdoor play space and equipment shall be located to the rear or side of the principal building.\nV. Commercial Kitchen\nOutdoor overnight parking and storage of vehicles such as food trucks and trailers associated with acommercial kitchen is prohibited in the IMU and RC Zoning Districts.\nOvernight parking and storage of vehicles such as food trucks and trailers associated with a commercial kitchen are allowed in other zoning districts and require a Class C landscape yard along the side and rear lot lines, unless Article 20 requires a higher class of landscape yard.\nW. Community Garden\nAreas of cultivation and accessory structures shall be set back as follows:\n\nA minimum of five feet from side and rear lot lines.\nA minimum of ten feet from any lot line abutting a street.\n\n\nAccessory structures shall be limited to 15 feet in height and 120 square feet in area.\nThe keeping of livestock is prohibited.\nThe sale of items grown on-site is prohibited.\nX. Conservation Area\nConservation areas shall be exempt from the following zoning district standards:\n\nMinimum lot width and/or area\nMinimum build-to zones and build-to percentages\nBuilding articulation requirements\nMinimum transparency requirements\nBuilding design standards (excluding building materials)\n\n\nY. Continuum Care Retirement Community (CCRC)\nTo qualify as a continuum care retirement community (CCRC), a development shall include residential care facilities with a minimum combination of at least two of the following uses: independent living, assisted living housing, nursing care facilities, and hospice care, where the average length of stay in these type facilities is more than 45 days.\nSupportive commercial uses of retail goods establishments, personal service establishments, restaurants, and childcare centers are permitted but are limited to the use of staff, residents, and their guests.\nZ. Contractor Office with Outdoor Storage\nAny outdoor storage area shall be located a minimum of 20 feet from any lot line. However, when abutting an Neighborhood 1 or Neighborhood 2 Place Type, the outdoor storage area shall be located a minimum of 200 feet from a lot line that abuts a Neighborhood 1 or Neighborhood 2 Place Type. No storage is permitted within this setback.\nA Class C landscape yard is required along all lot lines, unless Article 20 requires a higher class of landscape yard. However, if a higher class of landscape yard is required and does not require a fence or wall, a fence or wall shall still be required.\nStorage of any kind is prohibited outside the required fence in item 2 above.\nNo items stored within 50 feet of the fence or wall may exceed the height of the fence or wall in the landscape yard.\nAA. Crematorium\nA crematorium shall be located a minimum of 400 feet from any lot line abutting a Neighborhood 1 or Neighborhood 2 Place Type.\nBB. Dormitory\nDormitories in the Neighborhood 2 Zoning Districts shall be subject to the standards for multi-family dwellings within the zoning district.\nCC. Drive-Through Establishment\nAll drive-through establishments, except restaurants, shall provide a minimum of four stacking spaces per lane or bay, unless additional stacking spaces are specifically required by this Ordinance. Restaurants shall provide a minimum of eight stacking spaces per lane or bay. The space at the service window is counted in this minimum number of stacking spaces.\nA drive-through lane shall have bail out capability for all vehicles that enter the drive-through lane. The bail out lane shall be a minimum width of ten feet in width and run parallel to the drive-through lane. If a bail out lane is also an interior access drive providing access to parking spaces, the bail out lane is limited to a one-way traffic pattern following the direction of the drive-through lane.\nDrive-through lanes and drive aisles located between the street and the facade of the building shall require parking lot screening per Section 20.5 .\nA stacking space shall be a minimum of nine feet in width and 18 feet in length.\nAll components of a drive-through including, but not limited to, signs, stacking lanes, trash receptacles, ordering box, and drive up windows, shall be located to the rear or side of the building.\nDD. Drug Treatment Clinic\nAll drug treatment clinics shall be separated by a distance of at least 800 feet from any Neighborhood 1 or Neighborhood 2 Place Type.\nAll drug treatment clinics shall be separated by a distance of at least 800 feet from any other drug treatment clinics.\nEE. Dwelling – Duplex\nIn the N2-A and N2-B Zoning Districts, duplex dwellings are permitted subject to the standards of the N1-E Zoning District, or as components of a multi-dwelling development.\nFF. Dwelling – Multi-Family Attached\nMulti-family attached dwellings are limited to a maximum building length of 150 feet. This maximum building length may be increased to 400 feet if vehicular entrances to garages, including areas used for vehicular access to attached or detached garages, are located to the side or rear of the building.\nIf the zoning district limits maximum building length with a stricter standard, such stricter standard controls.\nGG. Dwelling -Quadraplex\nIn the Neighborhood 1 Zoning Districts, quadraplex dwellings are permitted only as follows:\n\nQuadraplex dwellings are permitted only on arterial streets and a minimum of one unit within the structure shall be set aside for households earning 80% AMI or less. This restriction does not apply to the N1-F Zoning District.\nIn the case of a through lot, a quadraplex is only permitted if both frontages abut arterial streets.\n\n\nIn the N2-A and N2-B Zoning Districts, quadraplex dwellings are permitted subject to the standards of the N1-E Zoning District, or as components of a multi-dwelling development.\nHH. Dwelling – Single-Family\nIn the N2-A and N2-B Zoning Districts, single-family dwellings are permitted subject to the standards of the N1-E Zoning District, or as components of a multi-dwelling development.\nII. RESERVEDJJ. Dwelling -Triplex\nIn the N2-A and N2-B Zoning Districts, triplex dwellings are permitted subject to the standards of the N1-E Zoning District, or as components of a multi-dwelling development.\nKK. Educational Facility -Primary or Secondary\nIn the Neighborhood 1 Zoning Districts, primary vehicular access is only permitted via arterial and collector streets, and limited access roadways where allowed.\nLL. Educational Facility -University or College\nIn the Neighborhood 1 Zoning Districts, primary vehicular access is only permitted via arterial and collector streets, and limited access roadways where allowed.\nMM. Educational Facility -Vocational\nIn the Neighborhood 1 Zoning Districts, primary vehicular access is only permitted via arterial and collector streets, and limited access roadways where allowed.\nNN. Employment/Labor Service Agency\nAn employment/labor service agency shall be separated by a distance of at least 800 feet from any other employment/labor service agency.\nOn-site management shall be required during the hours of operation. The manager shall be accessible to clients, law enforcement personnel, and any other individuals who need to establish communication upon or about the premises.\nThe employment/labor service agency shall provide adequate seating for clients in an accessible waiting area. The waiting area shall allow for access to restrooms and water during the hours of operation.\nOO. RESERVEDPP. Farm\nActivities that are considered an agriculture -industrial process, as defined in this section, are prohibited.\nAll structures for the keeping of animals shall be located 100 feet from any lot line.\nFarmstands for the sale of items grown on the farm are permitted.\nAll manure may only be stored in appropriate containers. The containers shall be located at least 250 feet from any from any lot line. A pile containing putrescible refuse and/or manure is prohibited. Spreading of manure is prohibited.\nQQ. Food Pantry\nA food pantry in the Neighborhood 1 and Neighborhood 2 Zoning Districts is permitted as an accessory use to an established nonresidential principal use.\nRR. Funeral Home\nFuneral homes shall have primary vehicular access from a collector or arterial street.\nSS. Gas Station\nGas station canopies may be located in required build-to zones but shall be located a minimum of 15 feet from any required frontage setback line.\nGas stations must meet the standards of the district with the exception of minimum building length as a percentage of lot width along a frontage, minimum ground floor height, and minimum building height.\nTT. Government Office/Facility\nIn the Neighborhood 1 Zoning Districts, primary vehicular access is only permitted via arterial and collector streets, and limited access roadways where allowed.\nUU. Group Home\nA zoning use permit is required.\nA group home is subject to the standards for a single-family dwelling unless modified by this section.\nGroup homes shall be licensed by the state.\nGroup homes in the Neighborhood 1 Zoning Districts shall be limited to a maximum of six residents. Group homes in all other zoning districts shall be limited to ten residents.\nNew group homes shall be separated from existing group homes in an Neighborhood 1 Place Type by a distance of 800 feet. This standard does not apply in circumstances when the sites are separated by a major thoroughfare, major topographical feature such as a major stream floodway, or by major nonresidential or public uses such as a public park, educational facility, place of worship, or commercial area.\nVV. Halfway House\nEach halfway house shall identify a manager to act as a 24 hour contact.\nHalfway houses shall be limited to ten residents.\nThe manager contact information shall be printed legibly and posted in such a way as to be conspicuous and readable from the exterior of each building to a person at the front entrance of a building. The posting shall contain the address of the property, the name of the manager of the property, and the phone number of the manager.\nWW. Homeless Shelter\nNew homeless shelters shall be separated from existing homeless shelters by a minimum of 800 feet. This separation requirement does not apply in the Commercial Zoning Districts and the Manufacturing and Logistics Zoning Districts.\nEach homeless shelter shall identify a manager to act as a 24-hour contact.\nThe manager contact information shall be printed legibly and posted in such a way as to be conspicuous and readable from the exterior of each building to a person at the front entrance of a building. The posting shall contain the address of the property, the name of the manager of the property, and the phone number of the manager.\nXX. Industrial, Craft\nIn the IMU and RC Zoning Districts, the following apply:\n\nEach craft industrial use is limited to a maximum gross square footage of 30,000 square feet.\nTo encourage the adaptive reuse of older or underutilized buildings, this maximum area is increased to 60,000 square feet if the use is located in a building constructed prior to 1980.\nOutside storage is prohibited. All business, servicing, processing, and storage uses shall be fully enclosed.\n\n\nYY. Industrial, General\nAll outdoor storage and activity areas shall be located a minimum of 30 feet from any lot line. However, when abutting a Neighborhood 1 or Neighborhood 2 Place Type, the outdoor storage and activity areas shall be located a minimum of 200 feet from the lot line that abuts a Neighborhood 1 or Neighborhood 2 Place Type. No storage is permitted within this setback.\nAll outdoor storage and activity areas require a Class C landscape yard along all lot lines, unless Article 20 requires a higher class of landscape yard. However, if a higher class of landscape yard is required and does not require a fence or wall, a fence or wall shall still be required. Storage of any kind is prohibited outside the fence.\nNo items stored within 30 feet of the fence or wall may exceed the height of the fence or wall.\nZZ. Industrial, Light\nIn the IMU and RC Zoning Districts, the following apply:\n\nOutside storage is prohibited. All business, servicing, processing, and storage uses shall be fully enclosed.\nLight industrial uses are limited to a maximum gross square footage of 30,000 square feet.\nTo encourage the adaptive reuse of older or underutilized buildings, this maximum area is increased to 60,000 square feet if the use is located in a building constructed prior to 1980.\n\n\nAll outdoor storage and activity areas shall be located a minimum of 30 feet from any lot line. However, when abutting a Neighborhood 1 or Neighborhood 2 Place Type, the outdoor storage and activity areas shall be located a minimum of 200 feet from the lot line that abuts a Neighborhood 1 or Neighborhood 2 Place Type. No storage is permitted within this setback.\nAll outdoor storage areas require a Class C landscape yard along all lot lines, unless Article 20 requires a higher class of landscape yard. However, if a higher class of landscape yard is required and does not require a fence or wall, a fence or wall shall still be required. Storage of any kind is prohibited outside the fence.\nNo items stored within 30 feet of the fence or wall may exceed the height of the fence or wall.\nAAA. Kennel\nAny structure for the keeping of animals that is not completely enclosed shall be located between the principal structure and the side or rear lot line.\nNo more than 20% of the established rear setback shall be occupied by such structures. Such structures shall be located ten feet from any lot line.\nWhen abutting a Neighborhood 1 or Neighborhood 2 Place Type, any exterior exercise area shall be located a minimum of 200 feet from such lot line.\nKennels shall locate exterior pens, runs, training, and exercise areas shall be located between the principal structure and the side or rear lot line.\nAll exterior exercise areas shall be completely fenced.\nBBB. Landfill, Land Clearing, and Inert Debris (LCID)\nAny LCID landfill shall obtain approval and comply with the size, siting, operational standards, and notice by recordation requirements of the State of North Carolina.\nAn LCID landfill may not be operated for more than 12 months except where no portion of the landfill is located within 400 feet of property located in a Neighborhood 1 or Neighborhood 2 Place Type.\nThe location of an LCID landfill shall be indicated on any required final subdivision plat.\nNo operational portion of the LCID landfill may be located within 50 feet of any property lines. This includes structures, equipment storage, parking areas and fill areas; however, access drives may cross this area. The actual fill area shall be located at least 400 feet from any Neighborhood 1 or Neighborhood 2 Place Type or from an existing residential building in any other place type.\nPrimary vehicular access shall only be permitted via arterial streets and limited access roadways where allowed.\nOperation of an LCID landfill is limited to the hours of 7:00 a.m. to 7:00 p.m., Monday through Saturday, if the site is within 400 feet of any Neighborhood 1 or Neighborhood 2 Place Type or a property with an existing residential building in any other place type.\nAll LCID landfills shall be lined with a geomembrane liner and leachate collection system subject to the standards of the Code of North Carolina, Department of Environmental Quality, equal to or exceeding the criteria for Municipal Solid Waste (MSW) Landfill Units.\nAll LCID landfills shall comply with the groundwater well and surface water requirements of MSW Landfill Units as defined by the Code of North Carolina, Department of Environmental Quality, equal to or exceeding the criteria for MSW Landfill Units.\nCCC. Light Assembly\nIn the IMU and RC Zoning Districts, outside storage is prohibited, and all business, servicing, processing, and storage uses shall be fully enclosed.\nDDD. Marina\nMarinas may include caretaker’s residences, docks, fueling and supply facilities, launching and storage facilities, boat servicing facilities, parking areas, maintenance areas, restaurants, boat lifts, launching ramps, boat charter services, and incidental retail sales associated with the principal use.\nAlong any lot line that abuts a use other than another marina, a Class B landscape yard is required, unless Article 20 requires a higher class of landscape yard.\nAreas used for the drydock/outdoor storage of boats shall be screened along all lot lines by a Class B landscape yard unless Article 20 requires a higher class of landscape yard.\nEEE. Medical Campus\nA medical campus may include standalone medical/dental offices, drug treatment clinics, and similar health services.\nA medical campus may include residential care facilities, residential addiction treatment facilities, and similar facilities. Long-term stay housing for patient families is permitted.\nSupportive commercial uses primarily serving medical campus staff, patients, and visitors of the medical campus, such as retail goods establishments, personal service establishments, financial institutions, childcare centers, and restaurants, are permitted but shall be located to minimize attracting outside customers.\nFFF. Micro-Production of Alcohol\nThe establishment shall include a restaurant, bar, and/or tasting room within the same building. The minimum size of the restaurant, bar, and/or tasting room shall be 20% of the total square footage of the use or 1,500 square feet, whichever is less.\nFacilities may include retail areas for the purchase of beverages manufactured on-site and related items.\nThe maximum area that can be used for beverage production within a building is 30,000 square feet. To encourage the adaptive reuse of older or underutilized buildings, this maximum area is increased to 60,000 square feet if the establishment is located in a building constructed prior to 1980.\nGGG. Movie Studio\nA movie studio is not subject to the design standards of a zoning district.\nHHH. Multi-Dwelling Development\nEach dwelling type in a multi-dwelling development shall meet zoning district dimensional and design standards unless modified by this section.\n\nEvery residential building on the site shall be separated on every side from any other building by at least ten feet.\nAll portions of every residential building shall be located within 400 feet of a public street, network-required private street, or non-network required private street that has direct access to the building.\nWhere a multi-dwelling development is served by non-network required private streets, angled parking areas directly adjoining the non-network required private streets will be permitted on one side of the street. Such parking areas may be alternated from one side of the street to the other. The combined length of such parking areas may not exceed 50% of the length of the adjoining roadway. All other angled parking areas shall be clearly separated from the non-network required private street by at least a barrier island. Any angled parking areas on network-required private streets shall be developed per the standards of the Charlotte Land Development Standards Manual (CLDSM) and with the approval of the Charlotte Department of Transportation (CDOT).\nNon-network private streets, similar interior vehicular circulation streets, alleys, and surface parking areas on the site shall be no closer than 15 feet to any side of a residential building used for entry into the building and will be no closer than five feet to any other face of a building.\nArchitectural features such as stoops, stairs, chimneys, bay windows, balconies, and roof overhangs may extend into the 15 foot area of item d above, but in no case may they be closer than five feet to the non-network required private street, alley, and/or surface parking area. No structural support elements may be located in this area.\nParking pads and driveways shall have a minimum length of 20 feet, measured from the back of the sidewalk, back of curb, or edge of pavement, whichever is greater. Along non-network private streets without sidewalks, private drives, and alleys, the driveway apron may be reduced to no more than seven feet behind the back of curb or edge of pavement.\n\n\nOn development sites of 30 acres or more in the N2-A and N2-B Zoning Districts, a mix of dwelling types is required. No one dwelling type may constitute more than 90% of the total units in the development.\nIII. Neighborhood Commercial Establishment\nIn the Neighborhood 1 and Neighborhood 2 Zoning Districts, neighborhood commercial establishments are allowed within existing structures that are nonresidential in their original construction and/or current use as of the effective date of this Ordinance. Such structures cannot be expanded.\nIn the Neighborhood 2 Zoning Districts, new neighborhood commercial establishments are permitted on the ground floor of multi-family stacked dwellings.\nIn the Neighborhood 2 Zoning Districts, new neighborhood commercial establishments are permitted as freestanding structures subject to the following:\n\nShall be located on corner lots.\nShall be limited to a maximum gross square footage of 9,000 square feet.\nShall be limited to a maximum of 48 feet in height.\n\n\nNeighborhood commercial establishments are not subject to the minimum lot sizes for nonresidential uses in Neighborhood 1 and Neighborhood 2 Zoning Districts. All other nonresidential zoning district standards apply.\nThe following commercial uses are permitted within a neighborhood commercial establishment.\n\nAdult care center\nAnimal care facility with no outdoor component\nArt gallery\nArt or fitness studio\nChildcare center; any separation requirements for childcare centers do not apply when allowed within a neighborhood commercial establishment\nMedical/dental office\nOffice\nPersonal service establishment\nRestaurant/bar; sale of alcohol is prohibited in the Neighborhood 1 Zoning Districts\nRetail goods establishment; sale of alcohol is prohibited in the Neighborhood 1 Zoning Districts\nSpecialty food service\n\n\nNo off-street parking is required when the neighborhood commercial establishment is located within an existing building located in a Neighborhood 1 Zoning District. However, any off-street parking currently provided shall be retained.\nDrive-through facilities are prohibited.\nOutdoor seating/activity areas and outdoor sales and display are permitted as an accessory useto a neighborhood commercial establishment. Outside storage is prohibited.\nJJJ. Nightclub\nAll windows and doors shall remain closed between the hours of 11:00 p.m. and 8:00 a.m.\nAll nightclubs shall be separated from any Neighborhood 1 Place Type by a distance of at least 200 feet.\nKKK. Office\nIn the CR, ML-1, and ML-2 Zoning Districts, an office use is limited to 25% of gross floor area of a building.\nLLL. Office Campus\nSupportive commercial uses for the primary use of office campus staff and visitors, such as retail goods establishments, personal service establishments, financial institutions, childcare centers, and restaurants, are permitted but shall be located to minimize attracting outside customers.\nMMM. RESERVEDNNN. Outdoor Storage Yard\nThe outdoor storage yard shall be located a minimum of 15 feet from any lot line except where properties zoned the ML-1 or ML-2 Zoning District abut. However, when abutting a Neighborhood 1 and Neighborhood 2 Place Type, the outdoor storage yard shall be located a minimum of 200 feet from the lot line that abuts a Neighborhood 1 or Neighborhood 2 Place Type. No storage is permitted within this separation.\nThe outdoor area requires a Class C landscape yard along all lot lines, unless Article 20 requires a higher class of landscape yard. However, if a higher class of landscape yard is required and does not require a fence or wall, a fence or wall shall still be required. In addition, when abutting a Manufacturing and Logistics Place Type, a landscape yard is not required but a fence shall be required.\nStorage of any kind is prohibited outside the required fence in item 2 above.\nNo items stored within 30 feet of the fence or wall may exceed the height of the fence or wall.\nOOO. Public Park\nPublic parks shall be exempt from the following zoning district standards:\n\nMinimum lot width and/or area\nMinimum build-to zones and build-to percentages\nBuilding articulation requirements\nMinimum transparency requirements\nBuilding design standards (excluding building materials)\n\n\nPPP. Public Safety Facility\nIn the Neighborhood 1 Zoning Districts, primary vehicular access is only permitted via arterial and collector streets, and limited access roadways where allowed.\nQQQ. Public Transit Facility\nIn the Neighborhood 1 Zoning Districts, primary vehicular access is only permitted via arterial and collector streets, and limited access roadways where allowed.\nRRR. Quarry\nThe minimum area for a quarry shall be 100 acres.\nA plan shall be submitted that specifies the anticipated future use of the property, upon the cessation of quarrying activities. The plan shall include provisions for the property owner to create a reserve fund in accordance with the applicable state statutes.\nRequired minimum setback from any lot line to:\n\nAny building or extraction area, road, driveway or pit: 200 feet\nAny crushing of rock, processing of stone, gravel, or other material: 300 feet\nAny blasting: 500 feet\n\n\nA Class A landscape yard is required along all lot lines.\nDuring operation of the quarry, the following safety features shall be required:\n\nRock Quarries\n\nFrom the edge of the pit, an area 20 feet wide shall be maintained free of any soil cover.\nFrom a point 20 feet from the edge of the pit, the soil cover, if less than 20 feet in depth, shall be graded back to a slope of one foot vertical or less, to one foot horizontal from the rock level to the top of the soil cover.\nIf the soil cover to be stripped away exceeds 20 feet in depth, a ditch eight feet wide and three feet deep, at least ten feet back from the edge of the pit, may be substituted for the backsloping. If the pit has reached its maximum expansion in any direction, however, the permanent fence as described in item 9 below, in connection with termination of quarrying operations, will suffice instead of the backsloping or ditching in that particular area.\n\n\nGravel Quarries and Sand QuarriesWhen the pit exceeds a depth of 20 feet from the surface of the ground, all dense underbrush shall be removed from the soil cover for a distance of 20 feet from the edge of the pit.\n\n\nBlasting is prohibited on Sunday, and may not occur earlier than 7:00 a.m. or later than 7:00 p.m. on any other day.\nVehicular access to the facility shall be provided from an arterial street.\nA metal fence and gate shall be constructed at the entrance to the quarry site and be closed when the quarry is not in operation. All access driveways, which serve the site for ingress or egress, shall be wide enough to accommodate two lanes of traffic.\nUpon termination of quarry operations at any pit that exceeds a depth of 20 feet from the surface of the ground, either the pit shall be backfilled to the slope of one foot vertical, or less, to one foot horizontal from the bottom of the pit to the surface of the ground, or a fence designed to prevent access shall be erected and maintained around the pit, or the site shall be otherwise reclaimed in accordance with the reuse plan for the property. If a fence is used, it shall be a minimum six feet high, and a maximum of eight feet high.\nSSS. Reception Facility\nA general admission fee or any other monetary donations (payment at the door to the general public) for entrance is prohibited, with the exception of fundraisers or events for bona fide non-profit organizations, places of worship, or educational facilities.\nAll windows and doors shall remain closed between the hours of 11:00 p.m. and 8:00 a.m.\nTTT. Recycling Collection Center\nAll recycling collection containers that are not within an enclosed building shall be located a minimum of 30 feet from any lot line.\nA Class B landscape yard is required along all lot lines. A solid fence a minimum of six feet to a maximum of eight feet in height is required with exceptions for ingress/egress, which shall be gated.\nStorage of any kind is prohibited outside the required fence in item 2 above.\nUUU. Religious Campus\nA religious campus may include supportive housing, such as dormitories, group homes, children’s homes,halfway houses, homeless shelters, and domestic violence shelters.\nA religious campus may include community centers and food pantries.\nSupportive nonresidential uses primarily serving religious campus staff and the congregation, such as retail goods establishments and restaurants, are permitted but shall be located to minimize attracting outside customers.\nVVV. Residential Care Facility\nResidential care facilities in the Neighborhood 2 Zoning Districts shall be subject to the standards for multifamily dwellings within the zoning district.\nWWW. Restaurant/Bar\nIncidental entertainment, which is defined as live or pre-recorded background music, is permitted within a permanent enclosed area.\nA restaurant/bar may have areas that have been designed for live performances and/or dancing within permanent enclosed areas\nAll windows and doors shall remain closed between the hours of 11:00 p.m. and 8:00 a.m.\nXXX. RESERVEDYYY. Salvage and/or Junk Yard\nAll outdoor storage and processing areas shall be located a minimum of 200 feet from any lot line except fora lot in a Manufacturing and Logistics Place Type.\nA salvage and/or junk yard shall be located a minimum of 1,000 feet from any lot in a Neighborhood 1 or Neighborhood 2 Place Type.\nScreening is required as follows:\n\nA Class A landscape yard is required along all rear and side lot lines. In Zone 1 of the landscape yard, a solid fence a minimum of six feet to a maximum of eight feet in height is required.\nA Class B landscape yard is required along all lot lines abutting a street. A solid fence a minimum of six feet to a maximum of eight feet in height is required with exceptions for ingress/egress, which shall be gated.\n\n\nZZZ. Self-Storage Facility: Climate-Controlled\nStorage units cannot be used as a residence, office, or principal place of business.\nNo plumbing connections are permitted in self-storage units with the exception of those needed for fire safety.\nAll self-storage activities shall be conducted exclusively indoors. Individual storage units may be accessed from inside the building only.\nAny ground floor facade abutting a street shall be wrapped with active uses. Active use spaces shall be a minimum of 20 feet in width and 20 feet in depth. Individual spaces shall be furnished with water, sewer, and electrical service, or such services shall be stubbed into each individual active use bay for a future connection. This is not required in the Manufacturing and Logistics Zoning Districts or Commercial Zoning Districts.\nAccess to loading areas shall be located to the side or rear of the building.\nAAAA. Self-Storage Facility: Outdoor\nStorage units cannot be used as a residence, office, or principal place of business.\nNo plumbing connections are permitted in self-storage units with the exception of those needed for fire safety.\nOutdoor self-storage facilities should be oriented so that storage unit access doors do not face the public right-of-way.\nOutdoor self-storage facilities may include an area for storage of motor vehicles, recreational vehicles, and marine recreational vehicles. Storage areas shall be located to the side or rear of the facility and shall be a minimum of 30 feet from any lot line.\nIf storage areas for vehicles are provided as described in item 4 above, they shall be screened with a Class C landscape yard along all lot lines, unless Article 20 requires a higher class of landscape yard.\nBBBB. Shooting Range, Indoor\nThe indoor training and shooting facilities shall be located in a building where it is the sole use within the structure.\nCCCC. Single Room Occupancy (SRO)\nRooming units shall be a minimum of 80 square feet, not to exceed 450 square feet total.\nRooming units in single room occupancy residences shall be limited to one occupant per room.\nThe building shall contain common space such as recreation areas, lounges, living rooms, and dining rooms at a rate of five square feet per rooming unit, but totaling not less than 250 square feet. Bathrooms, laundries, hallways, the main lobby, vending areas, and kitchens shall not be counted as common space.\nRooming units in each building shall be accessed through one primary location, unless the building is being rehabilitated or converted from an existing structure with multiple entrances, or from a campus with multiple buildings.\nOn-site management shall be provided on a 24 hour basis per building. Adequate on-site management includes having an employee on premises twenty-four hours a day. The employee shall be accessible to residents, law enforcement personnel, and any other individuals who need to establish communication upon or about the premises. Adequate on-site management also requires that the employee has the authority to exercise control over the premises to ensure that the use of the premises does not result in littering, nuisance activities, noise, or other activities that interfere with the peaceful enjoyment and use of surrounding properties.\nUtilities shall be mass metered.\nA maximum of 120 units are permitted, and a minimum of 11 units is required.\nAll buildings, outdoor active recreation facilities, and off-street parking and service areas require a Class C landscape yard along all lot lines that abut an Neighborhood 1 Place Type.\nDDDD. Utility (Includes Transmission and Distribution)\nUtility Buildings\n\nMinimum building height regulations do not apply to utility buildings.\nBuilding design standards for structures on a site apply, unless it can be shown that incorporating certain elements impacts operations and/ or creates a public safety issue. The Zoning Administrator shall approve the exceptions to design standards.\n\n\nUtility Equipment (Principal Use of Site)\n\nUtility equipment shall be set back 20 feet from all required setback lines.\nUtility equipment shall be screened along all lot lines by a Class C landscape yard, unless Article 20 requires a higher class of landscape yard.\nFor electrical substations, a solid wall of a minimum of 12 feet and a maximum of 15 feet is required as part of the Class C landscape yard.\nThe Zoning Administrator has the authority to approve alternative methods for screening that meet the intent of the solid wall requirement.\n\n\nEEEE. Vehicle Dealership: Outdoor\nIn the CG Zoning District, outdoor vehicle dealerships shall be less than two acres in lot area.\nFFFF. Vehicle Rental: Outdoor\nIn the CG Zoning District, outdoor vehicle rental establishments shall be less than two acres in lot area.\nGGGG. Vehicle Repair Facility: Major\nRepair of vehicles is prohibited outdoors. Storage of all merchandise, auto parts, and supplies shall be within an enclosed structure.\nVehicle repair facilities shall be screened along interior side and rear lot lines with a Class C landscape yard, unless a higher class of landscape yard is required by Article 20. The landscape yard is not required where such side or rear lot abuts a Manufacturing and Logistics Place Type.\nNo partially dismantled, wrecked, junked, or discarded vehicles may be stored outdoors on the premises. This standard does not apply to vehicles under repair.\nNo vehicles may be stored on site for more than 90 days.\nThe sale of new or used vehicles is prohibited unless it is a permitted use in the zoning district.\nNo motor vehicles may be stored and no repair work may be conducted in any public or network-required private street.\nHHHH. Vehicle Repair Facility: Minor\nRepair of vehicles is prohibited outdoors. Storage of all merchandise, auto parts, and supplies shall be within an enclosed structure.\nVehicle repair facilities shall be screened along interior side and rear lot lines with a Class C landscape yard, unless a higher class of landscape yard is required by Article 20. The landscape yard is not required where such side or rear lot abuts a Manufacturing and Logistics Place Type.\nNo partially dismantled, wrecked, junked, or discarded vehicles may be stored outdoors on the premises. This standard does not apply to vehicles under repair.\nNo vehicles may be stored on site for more than 90 days.\nThe sale of new or used vehicles is prohibited unless it is a permitted use in the zoning district.\nNo motor vehicles may be stored and no repair work may be conducted in any public or network-required private street.\nIIII. Waste Management Facility\nAll outdoor waste storage and processing areas shall be located a minimum of 200 feet from any lot line except for a lot in a Manufacturing and Logistics Place Type. For the purposes of this standard, the more restrictive conditions between the North Carolina Department of Environmental Quality (NC DEQ) or the City shall apply and control.\nA waste management facility shall be located a minimum of 1,000 feet from any lot in a Neighborhood 1 or Neighborhood 2 Place Type. For the purposes of this standard, the more restrictive conditions between the NC DEQ or the City shall apply and control.\nScreening is required as follows:\n\nA Class A landscape yard is required along all rear and side lot lines. In Zone 1 of the landscape yard a solid fence a minimum of six feet to a maximum of eight feet in height is required.\nA Class B landscape yard is required along all lot lines abutting a street. A solid fence a minimum of six feet to a maximum of eight feet in height is required with exceptions for ingress/egress, which shall be gated.\n\n\nJJJJ. Wireless Telecommunications\nGeneral Standards for Wireless Telecommunications Systems\n\nWireless telecommunications systems shall not be lit or marked unless required by the Federal Communications Commission (FCC) or the Federal Aviation Administration (FAA).\nCommercial advertising is prohibited on all components. Only signs that are part of the equipment as manufactured or warning signs is permitted.\n\n\nStandards for Wireless Telecommunications Towers\n\nThe maximum height of a wireless telecommunications tower is the minimum needed to function satisfactorily, evidence of which shall be provided to the Zoning Administrator.\nAll wireless communication towers located in a Neighborhood 1 or Neighborhood 2 Zoning District or within 400 feet of a lot within a Neighborhood 1 or Neighborhood 2 Place Type shall be required to meet concealment standards. Such concealment methods are encouraged in all zoning districts. Wireless communication towers are considered to meet concealment standards as follows:\n\nCanister DesignAll antennas on the tower shall be encased within canisters with the following provisions:\n\nThe canisters shall be of a diameter no greater than 12 feet and all canisters shall be the same diameter.\nThere shall be an under mount on the canisters that screens the view of the antennas from the ground.\nThe tower and canisters shall be painted or constructed of the same color.\n\n\nTree DesignThe tower may be designed as a tree to blend with more natural surroundings. At a minimum the following standards shall be met:\n\nBranches of the tree design shall screen antennas and shall extend 12 inches beyond the edge of the antennas.\nMounts and antennas shall be painted green to match the branches.\n\n\n\n\nAll wireless communication towers shall meet the following setback requirements:\n\nWhen located in a Neighborhood 1 or Neighborhood 2 Zoning District or when abutting a lot within a Neighborhood 1 or Neighborhood 2 Place Type, towers shall be setback from all lot lines a minimum of 110% of the tower height.\nIn all other locations, towers shall meet the setback of the zoning district.\n\n\nWireless communication towers are prohibited as a second principal use on any lot that contains a single-family, duplex, triplex, or quadraplex dwelling.\nAll towers shall be designed and equipped with the technological and structural capability to accommodate multiple wireless communications carriers for towers. At a minimum, colocation capability is required as follows:\n\nFor towers up to 150 in height: A minimum of two carriers\nFor towers over 150 in height: A minimum of three carriers\n\n\nAll wireless telecommunication towers shall be monopole construction and be painted or constructed of a neutral color that blends in with the sky including, but not limited to, galvanized silver or gray finish.\nThe use of guyed towers is prohibited. Towers shall be monopoles, meaning self-supporting with no wires, cables, or beams.\n\n\nStandards for Wireless Telecommunications Antennas\n\nWireless communication antennas are permitted atop any building or structure, with the exception of prohibited on single-family, duplex, triplex, or quadraplex dwellings.\nNo wireless communication antenna may extend more than 20 feet above the roof of the structure.\nWireless telecommunication antennas on a tower shall be mounted at least 30 feet above grade, as measured to the base of the antenna.\nAll wireless communication antennas located in a Neighborhood 1 or Neighborhood 2 Zoning District or within 400 feet of a lot within a Neighborhood 1 or Neighborhood 2 Place Type shall be required to meet concealment standards. Such concealment methods are encouraged in all zoning districts. Wireless communication antennas are considered to meet concealment standards as follows:\n\nStealth Design\n\nWireless telecommunications antennas shall be enclosed, camouflaged, screened, obscured, or otherwise not readily apparent to a casual observer.\nWireless telecommunication antennas shall be located on or in structures already permitted within zoning districts, such as water towers, clock towers, streetlights, penthouses, parapet walls (shall be behind the parapet wall), and steeples, and shall be designed to blend in with the structure.\n\n\n Colocation\n\nAntennas that colocate on existing wireless telecommunications towers are considered to meet the requirement of concealment. However, such antennas cannot increase the overall height of the existing wireless telecommunications tower.\nAntennas that colocate may be mounted in the same manner as other antennas on the tower. Where antennas are located within canisters on a tower, new antennas that colocate on the tower shall be within canisters (see item 2 above).\n\n\n\n\n\n\nStandards for Wireless Telecommunications Facilities\n\nWireless telecommunication facilities shall be limited to 500 square feet in gross floor area and 15 feet in height.  The building height limitation may be waived by the Zoning Administrator up to a maximum height of 25 feet in order to accommodate architectural design, screening, or similar special needs.\nWireless telecommunication facilities shall be screened by a Class C landscape yard along all street frontages and lot lines. The fence shall be designed so that it is not easily climbable.\nSafety devices shall be installed and maintained as needed in order to make the facility inaccessible to the public.\n\n\nAbandoned Wireless Telecommunication SystemsAny wireless telecommunication system component that is unused for a continuous period of 12 months shall be removed by the tower owner or the property owner.\nNonconforming Wireless Telecommunication Systems‍\n\nA properly permitted wireless telecommunication systems may remain in its present location and design.\nIf a wireless telecommunication tower and/or facility is replaced, it shall meet all prescribed conditions. The changing of, additions to, or removal of antenna on an existing tower as well as the colocation of additional carriers on an existing tower shall be permitted and shall not require the tower to be brought into compliance.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-15-use-regulations/#154-principal-uses:-prescribed-conditions\"}"}, {"title": "15.5   TEMPORARY USES: PRESCRIBED CONDITIONS", "text": "A. Mobile Car Wash\nA zoning use permit is required.\nA zoning use permit is valid for 90 consecutive calendar days.\nB. Mobile Food Vendor\nA zoning use permit is required.\nA zoning use permit is valid for 365 consecutive calendar days, and may be renewed on an annual basis.\nA mobile food vendor in the Neighborhood 1 and Neighborhood 2 Zoning Districts shall be permitted as an accessory use to an established nonresidential principal use.\nMobile food vendors shall not be located in a required sight distance triangle, shall not block driveways or other access to buildings, and shall not be located within a required setback.\nThe property owner shall submit a site plan for zoning review by the Zoning Administrator, CDOT, and the City of Charlotte Fire Department if four or more vendors locate on a site. Any site plan approval is valid for the duration of the use.\nC. Mobile Retail Vendor\nA zoning use permit is required.\nA zoning use permit is valid for 365 consecutive calendar days, and may be renewed on an annual basis.\nA mobile retail vendor in the Neighborhood 1 and Neighborhood 2 Zoning Districts is permitted as an accessory use to an established nonresidential principal use.\nMobile retail vendors shall not be located in a required sight distance triangle, shall not block driveways or other access to buildings, and shall not be located within a required setback.\nThe property owner shall submit a site plan for zoning review by the Zoning Administrator, CDOT, and the City of Charlotte Fire Department if four or more vendors locate on a site. Any site plan approval is valid for the duration of the use.\nD. Real Estate Project Sales Office\nA temporary standalone real estate sales office shall be subject to the following:\n\nA development is limited to one temporary standalone real estate sales office, which shall not be located in any required setback.\nAll standalone temporary real estate sales offices shall be closed and removed within 30 days after the sale or lease of the last unit of the development.\n\n\nTemporary real estate sales offices within the development shall be closed within 30 days after the sale or rental of the last unit of the development.\nThese standards do not apply to permanent leasing offices.\nE. Temporary Contractor’s Office and Contractor’s Yard\nA temporary contractor’s office is allowed incidental to a construction project and requires a zoning use permit. The zoning use permit is valid for the life of the project.\nA temporary contractor’s office is allowed within required setbacks with Zoning Administrator approval if they determine there is no other feasible location, and placement in a setback shall not negatively impact circulation and abutting properties.\nThe temporary contractor’s office and/or yard shall be removed within 30 days of completion of the construction project.\nTemporary contractor yards shall be secured on all sides by a fence a minimum of six feet to a maximum of eight feet in height. Fencing is not required on shared lot lines if the abutting lot also has a fence or other barrier that prohibits entry onto the lot.\nF. Temporary Outdoor Entertainment\nA zoning use permit is required.\nA temporary outdoor entertainment event in the Neighborhood 1 and Neighborhood 2 Zoning Districts is permitted as an accessory use to an established nonresidential principal use.\nA temporary outdoor entertainment event, including all sale and display items, shall not be located in any required setback.\nThe operator of the temporary outdoor entertainment event shall receive a zoning use permit that describes the type of event involved, and the duration of the event.  Depending on the type of entertainment event, additional City or County permits may be required.\nNo one event may be longer than 14 calendar days, including set-up and breakdown time. The Zoning Administrator is authorized to extend the duration of the temporary outdoor entertainment permit beyond 14 days if there is a unique situation that warrants a time extension.\nThe event cannot locate in any minimum required parking spaces for other businesses on the site when such businesses are open.\nG. Temporary Outdoor Sales\nA zoning use permit is required.\nTemporary outdoor sales in the Neighborhood 1 and Neighborhood 2 Zoning Districts are permitted only when sponsored by an institutional use within the district, such as a place of worship or educational facility, and takes place on the lot of such use.\nTemporary outdoor sales, including all sale and display items, shall not be located in any required build-to zone, required setback, or sight distance triangle.\nAny operator of a temporary outdoor sales event shall receive a zoning use permit that describes the type of event involved and the duration of the event.\nNo one event may be longer than 14 calendar days, including set-up and breakdown time. The Zoning Administrator is authorized to extend the duration of the temporary outdoor sales permit beyond 14 days. Temporary seasonal sales, such as outdoor produce, farmer’s markets, holiday and Christmas tree sales, or pumpkin patches, are allowed 90 days per sale.\nHours of operation are limited to between 8:00 a.m. and 9:00 p.m.\nThe temporary outdoor sales event cannot locate in any minimum required parking spaces for other businesses on the site when such businesses are open.\nH. Temporary Outdoor Storage Container\nThe use of an outdoor storage container is limited to no more than 90 calendar days.\nThe 90 day limit may be waived by the Zoning Administrator if there is a unique situation that warrants a time extension.\n", "metadataJson": "{\"section_url\": \"/articles/article-15-use-regulations/#155-\\u00a0-temporary-uses:-prescribed-conditions\"}"}, {"title": "15.6   ACCESSORY USES: PRESCRIBED CONDITIONS", "text": "A. Accessory Shelter\nAn accessory shelter shall be limited to no more than 15 individuals at any one time.\nAn accessory shelter shall only operate a maximum of two days/nights per week.\nB. Adult Care Home\nA zoning use permit is required.\nAn adult care home is subject to the standards for a single-family dwelling unless modified by this section.\nAn adult care home shall be licensed by the North Carolina Department of Health and Human Services.\nNew adult care homes in an Neighborhood 1 Zoning District shall be separated from any existing adult care homes by a distance of 800 feet. This standard does not apply when the sites are separated by an arterial, Limited Access road, Parkway, Boulevard, or Avenue or a major topographical feature such as a major stream floodway.\nC. Childcare Center in Residence\nA zoning use permit is required.\nChildcare centers in residence are subject to the standards for a single-family dwelling unless modified by this section.\nA single-family dwelling containing a childcare center in residence shall be the primary residence of the operator/primary caregiver.\nNew childcare center in residence shall be separated from existing family childcare homes and existing childcare center in residence in an Neighborhood 1 Place Type by a distance of 400 feet. This does not include childcare centers operating as part of a place of worship.\nOutdoor play space and play equipment shall be located to the rear of the principal structure.\nA childcare center in residence shall be limited to a maximum of two employees that reside outside of the residence at any one time.\nThe operator’s children are not included in the count of the number of children allowed.\nD. Childcare Home, Family\nA zoning use permit is required.\nA family childcare home is subject to the standards for a single-family dwelling unless modified by this section. The family childcare home shall be operated by a permanent resident of the dwelling with the permission of the property owner or by the property owner.\nNew family childcare homes shall be separated from existing family childcare homes and childcare center in residence in the Neighborhood 1 Place Type by a distance of 400 feet. This does not include childcare centers operating as an accessory use to a place of worship.\nOutdoor play space and play equipment shall be located to the rear of the principal structure.\nA family childcare home shall be limited to a maximum of one employee that resides outside of the residence at any one time.\nThe operator’s children are not included in the count of the number of children allowed.\nE. Drive-Through Facility\nAll drive-through facilities, except restaurants shall provide a minimum of four stacking spaces per lane or bay. Restaurants shall provide a minimum of six stacking spaces per lane or bay. The space located at the service window shall be counted in this minimum number of stacking spaces.\nA stacking space shall be a minimum of nine feet in width and 18 feet in length.\nAll components of a drive-through facility including, but not limited to, signs, stacking lanes, trash receptacles, ordering box, and drive up windows, shall be located to the rear or side of the building.\nDrive-through lanes and circulation may not be placed between the street and the front façade of the building; however, this does not apply in the Commercial Zoning Districts, and the Manufacturing and Logistics Zoning Districts. In the Commercial Zoning Districts and the Manufacturing and Logistics Zoning Districts drive- through lanes and drive aisles located between the street and the facade of the building shall require parking lot screening per Section 20.5.\nA drive-through lane shall have bail out capability for all vehicles that enter the drive-through lane. The bail out lane shall be a minimum width of ten feet in width and run parallel to the drive-through lane. If a bail out lane is also an interior access drive providing access to parking spaces, the bail out lane is limited to a one-way traffic pattern following the direction of the drive-through lane.\nFor all zoning districts except the Commercial Zoning Districts and the Manufacturing and Logistics Zoning Districts, a drive-through facility will only be allowed if a drive-through facility was located on the site on June 1, 2023.\nF. Dwelling – Accessory Unit (ADU)\nThe accessory dwelling unit (ADU) shall be clearly subordinate to the principal residential use.\nAn ADU is permitted as follows:\n\nIn conjunction with a single-family dwelling in any zoning district.\nIn conjunction with a duplex dwelling in any zoning district when each unit of the duplex is not located on a sublot.\n\n\nOnly one ADU shall be permitted on the lot.\nThe ADU and its associated principal dwelling shall be under the same ownership.\nThe ADU shall not be served by a driveway separate from that serving the principal dwelling. However, if the ADU is within an accessory structure and located on a corner lot or a lot that abuts an alley, a separate driveway may be provided from the side street or the alley, whichever applies.\nAn ADU located within the principal dwelling shall comply with the following additional requirements:\n\nThe ADU shall have a total floor area no greater than 40% of the total floor area of the principal residential use.\nThe ADU shall not be internally accessible from the principal residential use.\n\n\nAn ADU located within an accessory structure shall comply with the following additional requirements:\n\nThe ADU shall have a total floor area no greater than 50% of the total floor area of the principal residential use.\nThe structure shall not exceed the height of the principal dwelling.\nThe ADU may be in the established rear or side setback but shall not be any closer to any rear or side lot line than the dimension of the required side setback of the zoning district of the subject property.\nHeating, ventilation, or air conditioning equipment serving an ADU within an accessory structure and architectural features such as cornices, eaves, steps, gutters, and fire escapes may encroach into the required side and rear setbacks of the accessory dwelling unit by no more than 50% of the required side and rear setbacks.\n\n\nG. Helistop\nA helistop shall be designed and constructed in accordance with all federal and state regulations.\nA helistop shall be located at least  400 feet from a lot line of any property located in the Neighborhood 1 Place Type.\nH. Home Occupation\nA zoning use permit is required.\nA home occupation shall be incidental to the residential use of the dwelling and shall not change the essential residential character of the dwelling.\nNo internal or external alterations inconsistent with the residential use of the building will be permitted.  With the exception of a permitted sign, there shall be no evidence on the exterior of the premises or visible from the exterior of the premises that the property is used in any way other than for a dwelling. No display of products shall be visible from the street.\nThe home occupation and all related activity, including storage, equipment, and display, shall be conducted completely within a principal building or accessory structure.\nNo toxic, explosive, flammable, combustible, corrosive, etiologic, radioactive, or other restricted materials may be used or stored on-site.\nNo home occupation may dispense medication from the dwelling. No home occupation may engage in any activity that uses, stores, and/or requires the disposal of biohazardous material.\nThere shall be no perceptible noise, odor, smoke, electrical interference, vibration, or other nuisance emanating from the structure where the home occupation is located in excess of that normally associated with residential use.\nOnly residents of the dwelling may be engaged in work activities at the residence. If the home occupation has other employees, those employees may not come to the residence for work purposes, including pick-up of materials, vehicles, assignments, and/or similar purposes.\nThe home occupation cannot create greater vehicular or pedestrian traffic than is average for a residential area. The home occupation and any related activity shall not create any traffic hazards or nuisances in public rights-of-way.\nSigns are permitted in accordance with Article 22.\nClients or business-related visitors shall be by appointment and limited to the timeframe of 7:00 a.m. to 8:00\nThe storage of tractor trailers, semi-trucks, or heavy equipment, such as construction equipment used in a commercial business, is prohibited.\nRepair and service of any vehicles, any type of heavy machinery or any type of engine, is prohibited. Small electronic repair, such as computers, is allowed.\nRental services, where any materials for rent are stored on-site and customers visit the residence to pick-up and return the product, are prohibited.\nDispatching services, where workers report to the home for dispatching, are prohibited.\nThe number of vehicles used by clients or business-related visitors shall be limited to two at any given time.\nI. Outdoor Entertainment\nIf at any time between the hours of 11:00 p.m. and 8:00 a.m., any outdoor entertainment occurs, it shall meet the following:\n\nThe outdoor entertainment shall be separated by a distance of at least 100 feet from a lot line of any property located in the Neighborhood 1 Place Type.\nDistances are measured from the closest edge of any outdoor entertainment to the nearest lot line of property located in an Neighborhood 1 Place Type.\n\n\nJ. Outdoor Sales and Display\nRetail goods establishments are permitted to have accessory outdoor sales and display of merchandise.\nIn the Neighborhood 1 and Neighborhood 2 Zoning Districts, outdoor sales and display is only permitted as an accessory use to a Neighborhood Commercial Establishment.\nAll outdoor display of merchandise shall be located adjacent to the storefront and not in drive aisles, loading zones, or fire lanes. It may be located in a parking lot so long as the minimum number of required parking spaces remain available for use.\nNo display may be placed within three feet of either side of an active door or within 15 feet directly in front of an active door.\nA minimum clear width for pedestrian traffic of eight feet shall be provided and maintained along any interior private sidewalk.\nOutdoor sales and display shall be prohibited in a required sidewalk or path.\nK. Outdoor Seating/Activity Area\nAt-grade outdoor seating areas may be located within a required frontage setback, but shall be located behind any sidewalk, path, and planting strip. It may be allowed within an amenity zone with approval from CDOT when such amenity zone is on public property.\nIf at any time between the hours of 11:00 p.m. and 8:00 a.m., food and/or beverages are consumed in an outdoor seating/activity area, it shall meet the following:\n\nThe outdoor seating/activity area shall be separated by a distance of at least 100 feet from a lot line of any property located in the Neighborhood 1 Place Type.\nDistances are measured from the closest edge of any outdoor seating/activity area to the nearest lot line of property located in a Neighborhood 1 Place Type.\n\n\nL. Private Stables\nA minimum lot size of one acre is required.\nAll structures for the keeping and maintenance of animals, equipment, or manure, and all manure piles, pits, or bins shall be located at least 50 feet from any lot line.\nM. Rooming House\nA zoning use permit is required.\nThe rooming house shall be operated by a permanent resident of the dwelling with the permission of the property owner or by the property owner.\nA rooming house is subject to the standards for a single-family dwelling unless modified by this section.\nThe property owner shall reside within the dwelling.\nAll rooming units shall be in the principal residential structure. Separate structures, accessory structures, accessory dwelling units, and garages are not permitted to be used as rooming units.\nThere shall be no separate private entrance for any of the rooming units.\nA maximum of five boarders is permitted.\nNo signs are permitted.\nA property may only be used for a bed and breakfast or rooming house at any one time.\n", "metadataJson": "{\"section_url\": \"/articles/article-15-use-regulations/#156-\\u00a0-accessory-uses:-prescribed-conditions\"}"}]}