{"title": "Article 18. Architectural Features", "metadataJson": "{\"base_url\": \"article-18-architectural-features\"}", "section": [{"title": "18.1 GENERAL REQUIREMENTS", "text": "\nThe specific architectural features in this section are permitted but not required. All such features shall be constructed in accordance with the requirements of this section.\nWhere architectural features might extend into the right-of-way, prior review and approval by the Charlotte Department of Transportation (CDOT), the North Carolina Department of Transportation (NCDOT), or other relevant agencies is required. Adherence to the design requirements of this section does not imply approval through an encroachment agreement.\nArchitectural features shall not obstruct driveways that serve as access for service and emergency vehicles.\nAll trees shall be protected from encroachment of architectural features to the greatest extent practicable.\nWhen in the fully opened position, any building doors shall maintain a minimum clearance of two feet from the back of any abutting sidewalk or path.\nAn architectural feature shall not obstruct any pedestrian facilities.\n", "metadataJson": "{\"section_url\": \"/articles/article-18-architectural-features/#181-general-requirements\"}"}, {"title": "18.2 ARCHITECTURAL FEATURES: SINGLE-FAMILY, DUPLEX, TRIPLEX, QUADRAPLEX, AND MULTIFAMILY ATTACHED", "text": "\nApplicabilityThe regulations of this section for architectural features apply only to the following dwelling types, including when such dwellings are part of a cottage court or multi-dwelling development:\n\nSingle-family\nDuplex\nTriplex\nQuadraplex\nMulti-family attached\n\n\nArchitectural Features and Permitted Extension into Required Setback\n\nTable 18-1: Permitted Architectural Features and Extensions for Specific Dwelling Types lists the permitted architectural features for the specific dwelling types in item A above.\nAn architectural feature may extend into a required frontage, side, or rear setback in accordance with Table 18-1.\nCertain portions of the required rear setback for a single-family, duplex, triplex, or quadraplex dwelling may be utilized for unheated spaces of the principal structure, such as attached garages, porches, decks, balconies, greenhouses, and utility room extensions, in accordance with the following restrictions:\n\nNo such extension shall encroach into the rear setback more than 25% of the depth of the required rear setback.\nNo such extension shall be more than 50% of the widest part of the dwelling.\n\n\nAdditional extensions into the required rear setback are regulated in Table 18-1.\nFor the dwelling types specified in this section, no architectural feature may encroach into the public right-of-way.\n\n\nTable 18-1: Permitted Architectural Features and Extensions for Single-Family, Duplex, Triplex, Quadraplex, and Multi-Family Attached Development\nArchitectural Feature Additional RegulationsCertain architectural features in this section shall be subject to the following additional regulations:\n\nBreezeway\n\nBreezeways shall be located to the rear or side of the principal structure.\nThe width of a breezeway shall not exceed eight feet between structural supports.\nBreezeway height is limited to 12 feet.\n\n\nDecksIf there is an off-street public path or shared use path along the frontage, the deck entry shall be set back at least six feet behind the path.\nPorch, UnenclosedIf there is an off-street public path or shared use path along the frontage, the porch entry shall be set back at least six feet behind the path.\nSills, Belt Courses, Eaves, Cornices, and Ornamental FeaturesSills, belt courses, eaves, cornices, and ornamental features shall maintain a minimum vertical clearance of 9 feet.\nSteps and Stoops\n\nA stoop shall remain open on all sides except those along an exterior wall to which it is attached and may be roofed or uncovered.\nThe maximum width of a stoop landing shall be eight feet.\nThe maximum projection from the building wall of a stoop landing shall be eight feet.\nIf there is an off-street public path or shared use path along the frontage, steps shall be set back at least six feet behind the path.\n\n\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-18-architectural-features/#182-architectural-features:-single-family,-duplex,-triplex,-quadraplex,-and-multifamily-attached\"}"}, {"title": "18.3 ARCHITECTURAL FEATURES: MULTI-FAMILY STACKED, MIXED-USE, AND NONRESIDENTIAL DEVELOPMENT", "text": "\nApplicabilityThe following regulations for architectural features apply to multi-family stacked, mixed-use, and nonresidential developments.\nArchitectural Features and Permitted Extension into Required Setback\n\nTable 18-2: Permitted Architectural Features and Extensions for Multi-Family Stacked, Mixed-Use, And Nonresidential Development lists the permitted architectural features for multi-family stacked, mixed-use, and nonresidential developments.\nAn architectural feature may extend into a required frontage setback, required rear setback, and/or required side setback in accordance with Table 18-2.\nNo architectural feature may encroach into the public right-of-way unless specifically allowed by Table 18-2.\n\n\nTable 18-2: Permitted Architectural Features and Extensions for Multi-Family Stacked, Mixed-Use, And Nonresidential Development\nArchitectural Feature Additional RegulationsCertain architectural features in this section shall be subject to the following additional regulations:\n\nArcade, Gallery, or Colonnade\n\nAn arcade, gallery, or colonnade is considered to meet a required build-to zone\nThe vertical clearance of an arcade, gallery, or colonnade shall align with the height of the first floor.\nA horizontal clearance of at least eight feet shall be maintained between columns/piers and between columns/piers and the building facade.\nIf there is a public path or shared use path along the frontage, the arcade, gallery, or colonnade shall be set back at least six feet behind the path and no encroachment into this six-foot width is permitted.\n\n\n\n\nARCADE, GALLERY, OR COLONNADE\n\n\nAwning or SunshadeAwnings and sunshades shall have a minimum vertical clearance of nine feet.\n\n\n AWNING OR SUNSHADE\n\n\nBalconyBalconies shall maintain a minimum vertical clearance of 12 feet from grade.\n\n\n BALCONY\n\n\nBay WindowBay windows are prohibited at the ground floor.\n\n\nBAY WINDOW\n\n\nCanopy\n\nCanopies shall have a minimum vertical clearance of nine feet.\nA horizontal clearance of at least eight feet shall be maintained between canopy supports and between canopy supports and any building facade.\n\n\n\n\n CANOPY\n\n\nDeck\n\nA deck is considered to meet a required build-to zone\nIf there is an off-street public path or shared use path along the frontage, the entry to the deck shall be set back at least six feet behind the path.\n\n\nPorch, Unenclosed\n\nA porch is considered to meet a required build-to zone\nIf there is an off-street public path or shared use path along the frontage, the entry to the porch shall be set back at least six feet behind the path.\n\n\nSills, Belt Courses, Eaves, Cornices, and Ornamental Features\n\nSills, belt courses, eaves, cornices, and ornamental features shall maintain a minimum vertical clearance of 9 feet.\n\n\nSteps and Stoops\n\nA stoop shall remain open on all sides except those along an exterior wall to which it is attached and may be roofed or uncovered.\nThe maximum width of a stoop landing shall be eight feet.\nThe maximum projection from the building wall of a stoop landing shall be eight feet.\nIf there is an off-street public path or shared use path along the frontage, steps shall be set back at least six feet behind the path.\n\n\n\n\n     STEPS AND STOOPS‍", "metadataJson": "{\"section_url\": \"/articles/article-18-architectural-features/#183-architectural-features:-multi-family-stacked,-mixed-use,-and-nonresidential-development\"}"}]}