{"title": "Article 22. Signs", "metadataJson": "{\"base_url\": \"article-22-signs\"}", "section": [{"title": "22.1 PURPOSE", "text": "The purpose of this article is intended to accomplish the following objectives:A. To ensure that signs are designed, constructed, installed, and maintained so that public safety and traffic safety are not compromised.B. To minimize distractions and view obstructions that contribute to traffic hazards and endanger public safety.C. To allow for adequate and effective signs while preventing visual clutter.D. To ensure a high standard for the design and size of signs so that they enhance the aesthetic appearance and attractiveness of the community and create an aesthetic environment that has a positive impact on economic development.", "metadataJson": "{\"section_url\": \"/articles/article-22-signs/#221-purpose\"}"}, {"title": "22.2 APPLICABILITY", "text": "A. General Applicability\nAll signs constructed, erected, modified, or altered shall comply with the standards of this article, whether such signs do or do not require a sign permit.\nSigns shall only be placed on private property with the permission of the property owner, whether such signs do or do not require a sign permit.\nThe sign regulations of this article apply to each lot or facade of a structure.\nSigns located in the public right-of-way are not regulated by this article and this Ordinance, except for permissions for some encroachment of on-premise sign structures on City-maintained public rights-of-way.\nLogos and labels located on mechanical equipment, recycling bins, trash containers, and similar equipment, which are part of the equipment as manufactured and/or installed, are not regulated by this article or this Ordinance.\nSigns not regulated by this article or this Ordinance shall otherwise be regulated separately by applicable provisions of the City’s Code of Ordinances.\nB. Noncommercial MessagesAny sign permitted by these regulations may display or publish a noncommercial message. This includes signs that both require and do not require a sign permit.", "metadataJson": "{\"section_url\": \"/articles/article-22-signs/#222-applicability\"}"}, {"title": "22.3 ALTERATION AND MAINTENANCE ACTIVITIES EXEMPT FROM A PERMIT", "text": "The following activities do not require a sign permit:A. Normal maintenance and repair of a sign, including painting and cleaning. The following activities are not considered normal maintenance or repair: structural changes, changes in the electrical components of the sign, any change in sign dimension or height, or changes in the location of a sign.B. Changing or replacing the sign face within an existing sign structure so long as no structural changes are made to the sign structure and the size of the sign face is not increased.C. Changing the copy of a changeable message component of a sign.", "metadataJson": "{\"section_url\": \"/articles/article-22-signs/#223-alteration-and-maintenance-activities-exempt-from-a-permit\"}"}, {"title": "22.4 SIGN PERMIT", "text": "A. AuthorityUnless specifically stated in this article or this Ordinance that a sign is exempt from permit requirements, the installation, construction, enlargement, movement, or replacement of any sign requires a sign permit from the Planning Department.B. Approval Procedure\nUpon the filing of an application for a sign permit, the Planning Department shall examine the plans and specifications within 15 business days. If deemed necessary, they may inspect the premises where the sign will be installed.\nIf an application for a proposed sign is complete and complies with all the requirements of these regulations and other applicable codes, including but not limited to Historic District Commission (HDC) Design Guidelines, a permit shall be issued.\nA sign permit issued in accordance with this article automatically becomes null and void if work has not visibly started within six months of the date of issue, or if the work authorized by it has been suspended or abandoned for one year.\nC. FeesTo obtain a sign permit, all fees, in accordance with the associated fee schedule, shall be paid.D. Final InspectionUpon notification of completion by the permit holder, the City and County shall make a final inspection of the sign to verify conformance with the permit and all applicable codes.", "metadataJson": "{\"section_url\": \"/articles/article-22-signs/#224-sign-permit\"}"}, {"title": "22.5 MEASUREMENT METHODOLOGIES", "text": "A. Calculation of Sign Area\nThe sign area includes the area within a single, continuous perimeter enclosing the extreme limits of characters, lettering, logos, illustration, or ornamentations, together with any material or color forming an integral part of the display or differentiating the sign from the background to which it is placed. Structural supports with no sign copy shall not be included in the sign area. If a sign is attached to an entrance wall or fence, only that portion of that wall or fence onto which the sign face or letters are placed shall be calculated in the sign area.\nMEASUREMENT OF SIGN AREA\nFor calculating maximum area of window signs, the window area is calculated as a continuous surface until divided by an architectural or structural element. Mullions are not considered an element that divides window area. The area of a window sign is calculated by the same method as for other sign areas, per Item 1 above. The standards below further apply to the calculation of window sign areas.\n\nShadowbox design within display windows, where the window display is designed with a background enclosure within two feet of the window against which signs are mounted that block views into the establishment, is considered a window sign and the entire area of the shadowbox is subject to the maximum sign area limitation.\nPerforated window graphics/window clings, which show an image to the outside but allow those on the interior to view outside, are not considered transparent and the entirety of the graphic is counted as a window sign.\n\n\nMEASUREMENT OF WINDOW SIGN AREAB. Measurement of Sign HeightSign height is measured from the base of the sign at the ground to the highest point of the sign, including any attachments.MEASUREMENT OF SIGN HEIGHTC. Measurement of Vertical ClearanceFor building-mounted signs, vertical clearance is measured as the vertical distance measured from the ground directly below the sign to the lowest point of the sign.MEASUREMENT OF VERTICAL CLEARANCED. Determination of Number of Sign FacesSigns are considered double-faced if the faces are positioned relative to one another at an internal angle not exceeding 45 degrees. The sign area for a double-faced sign is calculated as the measurement of one sign face. If the internal angle exceeds 45 degrees, sign area is calculated as the sum of both faces. This applies to all signs except those located on corner lots, in which case the internal angle for a double-faced sign may not exceed 90 degrees. In all cases, this measurement refers to the internal angle of sign faces on a single structure.MEASUREMENT OF SIGN FACES (ANGLED SIGN) – CORNER LOT‍MEASUREMENT OF SIGN FACES (ANGLED SIGN) – INTERIOR LOTE. Sign SetbackA required sign setback is measured from the applicable lot line to the closest component of the sign or sign structure.", "metadataJson": "{\"section_url\": \"/articles/article-22-signs/#225-measurement-methodologies\"}"}, {"title": "22.6 STANDARDS FOR SIGNS EXEMPT FROM A PERMIT", "text": "The following on-premise permanent and temporary signs are exempt from the sign permit requirement, but subject to all applicable standards of this article, including the general sign standards of Section 22.7.A. A-Frame Sign\nA-frame signs are permitted for all uses in the following zoning districts: Neighborhood 2 Zoning Districts; Neighborhood Commercial Zoning Districts; Community Activity Center Zoning Districts; Regional Activity Center Zoning Districts; Innovation Mixed-Use Zoning Districts; Commercial Zoning Districts; Manufacturing and Logistics Zoning Districts; Campus Zoning Districts; and Transit Oriented Development Zoning Districts.\nOne A-frame sign is permitted per establishment, including one for each tenant in a multi-tenant development.\nAn A-frame sign shall be placed within 15 feet of the primary entrance of the business and shall not interfere with pedestrian traffic or violate standards of accessibility as required by the ADA or other accessibility codes.\nA minimum unobstructed sidewalk clearance of six feet shall always be maintained. The requirements of Section 10-141 of the City Code apply to signs on public property or in the public right-of-way.\nA-frame signs are limited to six square feet in area per side and four feet in height.\nThe placement of A-frame signs outdoors is limited to business hours only. A-frame signs shall be stored indoors at all other times.\nIllumination of A-frame signs is prohibited.\nA-frame signs shall not have any type of electronic component.\nA-FRAME SIGNB. Accessory Use SignSigns for accessory uses are permitted in all zoning districts as follows:\nSigns shall be constructed as wall signs. Only one sign is permitted.\nSigns are limited to four square feet in area.\nIllumination of signs for accessory uses is prohibited.\nC. Banner\nBanners are permitted for nonresidential uses in all zoning districts.\nIn permitted zoning districts, except the UC Zoning District (see Item 3 below), one banner is permitted per establishment, including one for each tenant in a multi-tenant development, and banners are limited to a maximum area of 32 square feet. Such banners shall not extend above the second-floor level of a building or 45 feet above grade, whichever is less.\nIn the UC Zoning District, more than one banner is permitted, and the total area of all banners combined shall not exceed 1,000 square feet or 10% of the wall area, whichever is less, per building wall. Banners shall not extend past the roofline.\nBanners shall be securely attached to a building wall, except for uses in the Institutional and Governmental Uses category of the Use Matrix in Article 15 or for temporary outdoor sales.\nBanners for institutional or temporary outdoor sales uses in all zoning districts where allowed may also be ground-mounted between two or more posts, shall be limited to one sign per block per street front, and shall not be located closer than 11 feet from the edge of the pavement of any roadway or alley, or located within any public rights-of-way.\nBanners shall be made of canvas, canvas-like material, nylon, vinyl-coated fabric, or similar weatherproof materials.\nBanners are limited to a maximum display period of 14 consecutive days and there shall be a minimum of ten days between display periods, except for the following:\n\nThe Zoning Administrator is authorized to extend the display duration of a banner for a temporary outdoor sales use, including such sales that are seasonal in nature (includes, but is not limited to, farmer’s markets, Christmas tree lots, pumpkin patches, etc.)\n\n\nBANNERD. Construction Activity\nTemporary ground signs are permitted for lots currently under construction in all zoning districts.\nSigns located on individual single-family detached, duplex, triplex, or quadraplex construction lots are limited to six square feet in area. An additional rider sign not exceeding a total of two square feet in sign area is allowed.\nSigns for all other types of construction lots cannot exceed 64 square feet in sign area.\nSigns shall be located on the construction lot.\nOne sign is permitted per street frontage.\nSigns shall be removed within seven days after expiration of the building permit.\nE. Flags\nCommercial Flags\n\nCommercial flags are permitted for nonresidential uses in the following zoning districts: Neighborhood Commercial Zoning Districts; Community Activity Center Zoning Districts; Regional Activity Center Zoning Districts; Innovation Mixed-Use Zoning Districts; Commercial Zoning Districts; Manufacturing and Logistics Zoning Districts; Campus Zoning Districts; and Transit Oriented Development Zoning Districts.\nOne commercial flag is permitted per establishment for each tenant on the first and second stories where such tenant’s facade abuts a public or private right-of-way.\nCommercial flags are limited to a maximum area of 12 square feet.\nCommercial flags shall only be mounted by a mast arm flagpole that extends at an angle from a building. Such flags cannot extend into the right-of-way measured when the flag is fully extended perpendicular to the post.\nCommercial flags cannot be illuminated.\n\n\nNoncommercial FlagsNoncommercial flags are permitted in all zoning districts and shall be displayed as set forth below as long as the flag(s) do not affect visibility or create any safety hazards or concerns.\n\nReferences to flagpole height in this section refers to vertical flagpoles. References to the number of noncommercial flags, flagpoles, and noncommercial flag dimensions refer to both vertical flagpoles and mast arm flagpoles that may extend at an angle from a building.\nUnless otherwise permitted or restricted by this section, noncommercial flags shall be displayed on permanent flagpoles. Flagpole heights are limited as follows:\n\nMaximum of 60 feet: Neighborhood 2 Zoning Districts; Neighborhood Commercial Zoning Districts; Community Activity Center Zoning Districts; Regional Activity Center Zoning Districts; Innovation Mixed-Use Zoning Districts; Commercial Zoning Districts; Manufacturing and Logistics Zoning Districts; Campus Zoning Districts; and Transit Oriented Development Zoning Districts\nMaximum of 39 feet: Neighborhood 1 Zoning Districts\n\n\nThe maximum dimensions of any noncommercial flag shall be proportional to the flagpole height. The side of the flag nearest to the flagpole shall not exceed 20% of the vertical height of the flagpole. In addition, noncommercial flags are subject to the dimensional limitations of Table 22-1: Noncommercial Flag Dimensions:\n\n\n\nThere shall be no more than three noncommercial flags allowed per street frontage. These flags may be flown on one flagpole or flown on separate flagpoles.\nFlagpoles along public streets and network required private streets shall be located behind any required sidewalks.\nFlagpoles shall be permanently mounted in the ground with necessary structural support features or below grade footings, installed in accordance with all required state and local regulations or applicable codes.\nNoncommercial flags shall not be draped over the hood, top, sides, or back of a vehicle, nor flown from the antennae of any parked vehicle in the following zoning districts: Neighborhood 2 Zoning Districts; Neighborhood Commercial Zoning Districts; Community Activity Center Zoning Districts; Regional Activity Center Zoning Districts; Innovation Mixed-Use Zoning Districts; Commercial Zoning Districts; Manufacturing and Logistics Zoning Districts; Campus Zoning Districts; and Transit Oriented Development Zoning Districts.\nF. Light Pole Banner\nLight poles located entirely on private property are permitted to mount banners in all zoning districts. Light pole banners shall not be used as a temporary off-premise advertising sign.\nA maximum of two light pole banners may be displayed per light pole.\nLight pole banners are limited to a maximum area of 15 square feet.\nLight pole banners shall maintain a minimum vertical clearance of 12 feet from grade to the bottom of the banner.\nLight pole banners shall be mounted to project perpendicular from light poles.\nLIGHT POLE BANNERG. Noncommercial Message SignIn addition to the conversion of any permitted sign to a noncommercial message per Section 22.2.B, additional signs for noncommercial messages are permitted as follows:\nNoncommercial message signs are permitted in all zoning districts.\nNoncommercial message signs are ground or wall signs. There is no limit on the number of noncommercial message signs permitted.\nThe sign area of a ground and wall-mounted sign is limited to 16 square feet in area. Ground signs are limited to four feet in height.\nGround-mounted signs shall not be located closer than 11 feet from the edge of the pavement of any roadway or alley, or within any public rights-of-way.\nNoncommercial message signs shall not be illuminated.\nNoncommercial message signs cannot be used for on-premise or off-premise advertising.\nH. Parking Lot, Parking Structure, and Site Circulation and Wayfinding Signs\nParking lots and structures in all zoning districts are permitted permanent signs at parking lot or structure circulation points in accordance with this section, whether such parking lots or structures are a principal or ancillary use. Such signs shall not be used for off-premise advertising.\nPermanent signs for site circulation and wayfinding are permitted in all zoning districts in accordance with this section. Site circulation points include, but are not limited to, entrances/exits, internal intersections, drive-through lanes, and parking lot drive aisles. Circulation points also include bicycle paths and bicycle parking areas, pedestrian paths and on-site pedestrian rest areas, and pathways to transit stops.\nSigns for parking lot and structure circulation points may be internally or externally illuminated.\nSigns are limited to six square feet in area.\nGround signs are limited to six feet in height.\nA ground sign shall not be located so that it obstructs any pedestrian or vehicular traffic, or within any public rights-of-way.\nI. Real Estate Activity\nTemporary signs are permitted for lots or structures currently for sale, lease, or rent.\nSigns located on individual single-family, duplex, triplex, and quadraplex lots under three acres in size, or individual units within attached housing are limited to six square feet. An additional rider sign not exceeding a total of two square feet in sign area is allowed.\nSigns for other lots or structures for sale, lease, or rent cannot exceed 64 square feet in sign area.\nOnly one sign is permitted per street frontage of a property. However, properties having a continuous frontage of 850 linear feet or more shall be allowed an additional sign so long as such sign is no closer than 850 feet from another sign on the property.\nIllumination is prohibited.\nSigns shall be removed within seven days after the sale is closed or rent or lease transaction is finalized.\nJ. Temporary Off-Premise Advertising Sign\nTemporary off-premise advertising signs are limited to four square feet in area.\nTemporary off-premise advertising signs are limited to four feet in height.\nTemporary off-premise advertising signs are limited to two per property.\nTemporary off-premise advertising signs shall not be located closer than 11 feet from the edge of the pavement of any roadway or alley, or within any public rights-of-way.\nTemporary off-premise advertising signs are limited to the following display period: Posted no earlier than 3:00 p.m. of a Friday, or before 8:00 a.m. of a holiday, and displayed until 6:00 p.m. on a Sunday or a designated holiday.\nTemporary off-premise advertising signs are prohibited from being posted or mounted upon trees, utility poles, traffic control signs, lights, or devices in any place or manner prohibited by the provisions herein.\nNo temporary off-premise advertising sign shall be mounted upon a portable sign structure. Portable sign structures include, but are not limited to, signs mounted upon a trailer, wheeled carrier, or other non-motorized mobile structure, with wheels or without wheels.\nK. Temporary Outdoor Sales Sign\nThe following standards apply to all temporary outdoor sales signs:\n\nTemporary outdoor sales signs are limited to one per establishment, including one for each tenant in a multi-tenant development.\nTemporary outdoor sales signs may either be of A-frame type, banner type, or attached to the sales display.\n\n\nThe following standards apply to temporary outdoor sales signs of A-frame type:\n\nA-frame signs shall not interfere with or obstruct motor vehicle traffic.\nA-frame signs shall not interfere with pedestrian traffic or violate standards of accessibility as required by the ADA or other accessibility codes. The requirements of Section 10-141 of the City Code apply to all signs on public property or in the public right-of-way.\nA-frame signs are limited to six square feet in area per side and four feet in height.\nThe placement of A-frame signs outdoors is limited to sales hours only. A-frame signs shall be stored indoors at all other times.\nIllumination of A-frame signs is prohibited.\nA-frame signs shall not have any type of electronic component.\n\n\nThe following standards apply to temporary outdoor sales signs of banner type:\n\nBanners are limited to a maximum of 32 square feet.\nBanners shall either be secured to a building wall or ground-mounted between two or more posts.\nBanners are limited to one per street front.\nBanners shall not be closer than 11 feet from the edge of pavement of any roadway or alley or located within a public right-of-way.\nBanners shall be made of canvas, canvas-like material, nylon, vinyl-coated fabric, or similar weatherproof materials.\nBanners are limited to a maximum display period of 14 consecutive days and there shall be a minimum of ten days between display periods, except for the following:\n\nThe Zoning Administrator is authorized to extend the display duration of a banner for a temporary outdoor sales use, including such sales that are seasonal in nature (including, but not limited to, farmer’s markets, Christmas tree lots, pumpkin patches, etc.)\n\n\n\n\nThe following standards apply to temporary outdoor sales signs attached to sales displays:\n\nAttached signs are limited to 16 square feet.\nIllumination of attached signs is prohibited.\nAttached signs shall not have any type of electronic component.\n\n\nL. Vehicle Dealership Temporary Sign\nTemporary signs are permitted for vehicle dealerships that front public or network required private streets.\nSigns are limited to nine square feet per each vehicle that front public or network required private streets.\nSigns shall be affixed to the exterior surface of the vehicle. Signs cannot project beyond the roof, hood, or trunk of the vehicle.\nM. Window Sign\nWindow signs are permitted for all uses in the following zoning districts: Neighborhood 2 Zoning Districts; Neighborhood Commercial Zoning Districts; Community Activity Center Zoning Districts; Regional Activity Center Zoning Districts; Innovation Mixed-Use Zoning Districts; Commercial Zoning Districts; Manufacturing and Logistics Zoning Districts; Campus Zoning Districts; and Transit Oriented Development Zoning Districts.\n\nFor uses in the Neighborhood 2 Zoning Districts, window signs are permitted on the ground floor only.\nFor uses in all other zoning districts, window signs are permitted for window areas up to and including the third story.\n\n\nThe total window sign area, whether temporary or permanent, is limited to no more than 25% of the surface of each window area, including transparent areas of doors and entryways. Window area is counted as a continuous surface until divided by an architectural or structural element, such as door casings or facade treatments. Mullions are not considered an element that divides window area.\nHowever, vacant ground floor nonresidential use spaces within the zoning districts in item 1 above are permitted to cover 65% of the surface of each window area, including transparent areas of doors and entryways. Once occupied, the requirements of item 2 above control.\nWindow signs may be internally or naturally illuminated. No external illumination is permitted.\nWINDOW SIGN", "metadataJson": "{\"section_url\": \"/articles/article-22-signs/#226-standards-for-signs-exempt-from-a-permit\"}"}, {"title": "22.7 GENERAL SIGN STANDARDS", "text": "A. Installation\nAll signs shall be constructed and installed in accordance with the applicable provisions of the North Carolina State Building Code.\nAll illuminated signs shall be installed in accordance with the applicable provisions of the North Carolina State Electrical Code and all detached signs shall be illuminated by an underground electrical source.\nB. LocationSigns may be in a required setback. If a sign is in a required setback, it shall not be otherwise located so that it obstructs pedestrian or vehicular traffic.C. Sight Triangle and Sight Distance Obstruction ProhibitedNo sign shall obstruct a required sight triangle or a required sight distance, as described in Section 31.3.D.D. Projection into City Right-of-WayWhen a sign extends into a right-of-way, prior review and approval by the Charlotte Department of Transportation (CDOT) and/or other relevant agencies is required. The encroachment of signs into a right-of-way requires an encroachment agreement from CDOT, if applicable. Adherence to the design standards included in this article does not imply approval through an encroachment agreement.E. Tree ProtectionSign placement, including projections from a building facade, shall protect all trees as required by Article 29 as well as any trees located in the public right-of-way.F. Permitted Materials for Signs\nPermanent sign structures shall be constructed of brick, wood or simulated wood, stone, concrete, metal, plastic, or high-density urethane (HDU) foam board or similar durable foam construction.\nAwning, canopy, projecting, light pole banner, banners, and wall signs may also be constructed of durable weather resistant material such as canvas, nylon, or vinyl-coated fabric.\nWall, awning, canopy, projecting, and light pole banners constructed of non-rigid material such as canvas, nylon, or vinyl-coated fabric shall be mounted within a frame so that they are held taut between all supports.\nG. Audio ComponentsAudio components are prohibited as part of any sign, except for the following:\nDrive-through sign: For drive-through signs, the audio component shall be designed, located, shielded, and directed to prevent detection from surrounding properties.\nH. Changeable Message\nThe following sign types, when allowed within a zoning district, may have a changeable message component: wall sign, projecting sign, ground sign, or marquee sign. Electronic signs are limited to the zoning districts listed in Section 22.9.C.\nWhere a sign has an electronic message or manual changeable copy component, it is limited to a maximum of 50% of the total area of the sign.\n\nFor properties located within the I-277 loop, an electronic message or manual changeable copy component may comprise 100% of the total area of a sign.\n\n\nA sign structure with a changeable message component shall contain additional copy; it cannot be a blank sign structure once the changeable message component is discounted. This provision does not apply to signs located within the I-277 loop and comprised entirely of a changeable message component.\nCHANGEABLE MESSAGE SIGNI. Illumination Standards\nAll sign illumination, both external and internal, shall be designed, located, shielded, and directed to prevent the casting of glare or direct light upon rights-of-way and surrounding properties, and prevent the distraction of motor vehicle operators or pedestrians in the rights-of-way.\nThe sign face of internally illuminated signs shall function as a filter to diffuse illumination. The sign face shall cover all internal illumination components so that no exposed bulbs are visible.\nAll external illumination of a sign shall concentrate the illumination upon the printed area of the sign face.\nSign illumination shall not be combined with reflective materials, such as mirrors, polished metal, or highly-glazed tiles, which would increase glare.\nStrobe lights, moving or fixed searchlights, and floodlights/spotlights are prohibited, except in the UC Zoning District, where such lighting is permitted.\nNo lighting, including neon or LED components of signs, may flash, except in the UC Zoning District, where such lighting may flash, chase, or blink.\nNeon or LED lighting to outline doors, windows, architectural features, and building facades is permitted. Such lighting shall remain static (i.e., no chasing, blinking, or flashing) except in the UC Zoning District, where such lighting may chase, blink or flash.\nThe maximum allowable footcandle at the lot line is one footcandle unless a sign extends over the lot line, where the maximum of one footcandle is measured at the back of curb. This does not apply to electronic message signs, which are regulated by Item 9 below.\nFor electronic message signs, excluding electronic outdoor advertising signs, the maximum brightness is limited to 5,000 nits when measured from the sign’s face at its maximum brightness, during daylight hours, and 500 nits when measured from the sign’s face at its maximum brightness between dusk and dawn (i.e., the time of day between sunset and sunrise). The sign shall have an ambient light meter and automatic or manual dimmer control that produces a distinct illumination change from a higher allowed illumination level to a lower allowed level for the time period between one-half hour before sunset and one-half hour after sunrise. Electronic outdoor advertising signs are regulated by Section 22.10 below.\nJ. Maintenance of Signs\nAll signs shall be maintained in good condition. Deficiencies such as chipped paint, broken plastic, missing letters, and exposed light bulbs are evidence of a lack of maintenance.\nThe City may remove any sign that is an immediate public peril to persons or property summarily and without notice.\nSign frames shall not remain unfilled and/or allow any internal part or element of the sign structure to be visible. Sign frames filled or replaced with a blank panel are considered to meet this standard.\n", "metadataJson": "{\"section_url\": \"/articles/article-22-signs/#227-general-sign-standards\"}"}, {"title": "22.8 SIGN PERMISSIONS", "text": "Table 22-2: Sign Permissions catalogs the types of permitted signs, both permanent and temporary, and indicates whether such sign requires a sign permit. This table is provided for reference purposes. In the case of any conflict with the regulations of this article or any other section of this Ordinance, the specific sign regulations control over this table. This table does not address outdoor advertising signs (Section 22.10) and areas of special sign regulation (Section 22.11).", "metadataJson": "{\"section_url\": \"/articles/article-22-signs/#228-sign-permissions\"}"}, {"title": "22.9 SIGNS REQUIRING A PERMIT", "text": "The following on-premise signs require a sign permit and are subject to all applicable standards of this article. Additionally, the following sign types shall operate only as on-premise signs. Outdoor advertising signs are regulated separately in Section 22.10.A. Awning and Canopy Signs\nThe following standards apply to awning and canopy signs:\n\nOne awning or canopy sign is permitted per tenant with a façade abutting a public or private street, or public right-of-way. Tenants occupying spaces with façades abutting multiple public streets, private streets, or public rights-of-way are permitted one awning or canopy sign per façade.\nSign copy on any awning or canopy sign surface is limited to 30% of each surface area. A valance is considered a separate surface area.\nA canopy is permitted a sign face area attached to and located above the top of the canopy to a maximum height of 24 inches.\nAwning and canopy signs may be illuminated.\n\n\nAWNING SIGN‍NONSTRUCTURAL CANOPY SIGN‍STRUCTURAL CANOPY SIGN‍B. Drive-Through Signs\nThe following standards apply to drive-through signs:\n\nDrive-through signs are limited to one per drive-through lane.\nDrive-through signs are limited to 64 square feet in sign area and eight feet in height. The drive-through sign may be designed as separate ground signs grouped together and may include the use of preview boards designed as separate ground signs installed at a distance earlier in the drive-through lane, however the total area of all signs shall not exceed 64 square feet.\nIn addition, drive-through signs are permitted ten square feet of sign area for temporary signs attached to the top or sides of the drive-through sign.\nDrive-through signs shall be located a minimum of 15 feet from any Neighborhood 1 Place Type. This shall be measured as the shortest straight line from the sign face to the nearest edge of any residential zoning district in the Neighborhood 1 Place Type.\nDrive-through signs may be internally illuminated. Drive-through signs may also contain an electronic or video display screen and audio component for interaction with the customer. No external illumination of drive-through signs shall be permitted.\n\nFor any included audio component, the standards of Section 22.7.G shall apply.\n\n\n\n\nDRIVE-THROUGH SIGNC. Electronic Signs\nElectronic signs are permitted for all uses within the following zoning districts: Neighborhood Commercial Zoning Districts; Community Activity Center Zoning Districts; Regional Activity Center Zoning Districts; Innovation Mixed-Use Zoning Districts; Commercial Zoning Districts; Manufacturing and Logistics Zoning Districts; Campus Zoning Districts; and Transit Oriented Development Zoning Districts.\nIn addition, electronic signs are also permitted for the following:\n\nThe following uses in any zoning district are permitted an electronic sign: cultural facility, educational facility -primary or secondary, educational facility -university or college, government office/facility, public park/playground, place of worship.\n\n\nOnly one electronic sign per lot is permitted.\nElectronic outdoor advertising signs are controlled by Section 22.10.\nEach message or image displayed on an electronic sign shall be static for a minimum of eight seconds. Electronic signs shall display static text messages only, with no animation or effects simulating animation or video. Scrolling, flashing, animation, or movement of the message or any component of the sign is prohibited. Any message change sequence shall be accomplished immediately by changing from one screen to another without transition effect. Such prohibition does not apply to the UC Zoning District.\nD. Ground Signs\nGround Sign TypesGround signs are regulated as five types in this article:\n\nGround signs are permitted for multi-family dwellings and nonresidential uses in the zoning districts indicated in Item 3 below.\nRetail center ground signs are permitted for multi-tenant retail centers in any zoning district except the Regional Activity Center Zoning Districts and the TOD-UC and TOD-NC Zoning Districts.\nMulti-tenant nonresidential development ground signs are permitted in any zoning district except the Regional Activity Center Zoning Districts and the TOD-UC and TOD-NC Zoning Districts.\nMulti-use development ground signs are permitted in any zoning district except the Regional Activity Center Zoning Districts and the TOD-UC and TOD-NC Zoning Districts.\nGround signs are permitted for residential developments in any zoning district except the Regional Activity Center Zoning Districts and the TOD-UC and TOD-NC Zoning Districts.\n\n\nGeneral RegulationsThe following regulations apply to all ground signs:\n\nAll ground signs shall be of monument type construction, except for ground signs in the Manufacturing and Logistics Zoning Districts and the CR Zoning District.\n\nGround signs for nonresidential uses in the Manufacturing and Logistics Zoning Districts and the CR Zoning District may be of pole sign type construction up to a maximum height of 30 feet.\nPole signs are limited to one per lot and a maximum sign area of 84 square feet.\n\n\nGround signs may be in a required setback or along a zoning district-specific frontage with the following exceptions:\n\nGround signs along frontages shall be located out of the right-of-way, if it exists, or behind the required sidewalk or path, whichever is greater.\n\nIn the Neighborhood Commercial Zoning Districts, Community Activity Center Zoning Districts, Regional Activity Center Zoning Districts, and Innovation Mixed-Use Zoning Districts, ground signs shall be located out of the right-of-way, if it exists, or setback, whichever is greater.\n\n\nGround signs shall not project into, over, or otherwise encroach on a public right-of-way, or a sidewalk as part of a network required private street.\n\n\nGround signs may be internally or externally illuminated. If externally illuminated, all light shall be directed onto the sign face.\n\n\nGround SignsGround signs are subject to the following:\n\nGround signs are permitted for multi-family and nonresidential uses in the zoning districts listed in Table 22-3: Ground Signs. Table 22-3 also contains the maximum sign areas and maximum heights.\nOne ground sign is permitted along street frontage of a lot measuring less than 400 feet. Additional signs are allowed as follows:\n\nEach street frontage of a lot measuring 400 feet or more, is permitted one additional sign. However, a minimum distance of 200 feet shall be maintained between signs along the same frontage. This does not apply to a use from the Institutional and Government Uses category in the Use Matrix in Article 15, which is controlled by Item ii below.\nUses from the Institutional and Government Uses category in the Use Matrix in Article 15 located in any zoning district are permitted one additional ground sign of 16 square feet and four feet in height.\n\n\n\n\nGROUND SIGN – MONUMENT4. Retail Center Ground SignsGround signs for retail centers are regulated separately from Item 3 above, and are subject to the following standards:\nOne retail center ground sign is permitted per street frontage. For lots of five acres or more, an additional ground sign is permitted for each entry point to the lot but a minimum separation of 200 feet is required between signs.\n\nRetail center ground signs are limited to the following maximum sign areas and heights:\n\nDevelopment site area of less than 25,000sf: 48 square feet in area and eight feet in height\nDevelopment site area of 25,000sf up to 50,000sf: 100 square feet in area and 10 feet in height\nDevelopment site area more than 50,000sf up to 200,000sf: 128 square feet in area and 15 feet in height\nDevelopment site area more than 50,000sf up to 200,000sf: 128 square feet in area and 15 feet in height\n\n\nWhere a multi-tenant retail center includes outparcels, each outparcel is permitted one ground sign of a maximum of 36 square feet in sign area and a maximum of five feet in height.\nGround signs for retail centers located in Regional Activity Center Zoning Districts and the TOD-UC and TOD-NC Zoning Districts are prohibited.\n5. Multi-Tenant Nonresidential Development Ground SignsGround signs for multi-tenant nonresidential developments are regulated separately from Item 3 above, and are subject to the following standards:\nOne ground sign of 50 square feet in area maximum and a maximum height of seven feet.\nA second ground sign of 24 square feet in area maximum and a maximum height of four feet.\nOutparcels on the site are each allowed one ground sign of 36 square feet in area maximum and a maximum height of five feet.\nGround signs for multi-tenant nonresidential developments located in Regional Activity Center Zoning Districts and the TOD-UC and TOD-NC Zoning Districts are prohibited.\n6. Multi-Use Development Ground SignsGround signs for multi-use developments are regulated separately from Item 3 above, and are subject to the following standards:\nOne ground sign of 50 square feet in area maximum and a maximum height of seven feet.\nA second ground sign of 24 square feet in area maximum and a maximum height of four feet.\nOutparcels on the site are each allowed one ground sign of 36 square feet in area maximum and a maximum height of five feet.\nGround signs for multi-use developments located in Regional Activity Center Zoning Districts and the TOD-UC and TOD-NC Zoning Districts are prohibited.\n7. Residential Development Ground SignGround signs for residential developments are regulated separately from Item 3 above, and are subject to the following standards:\nOne residential development ground sign is permitted for each entry point to the development. A minimum separation of 200 feet is required between signs. Two separate sign faces may be used in conjunction with a wall, fence, or other architectural entrance feature.\nResidential development ground signs are permitted a maximum sign area of 42 square feet per sign and a maximum sign height of five feet per sign.\nGround signs for residential developments located in Regional Activity Center Zoning Districts and the TOD-UC and TOD-NC Zoning Districts are prohibited.\nE. Marquee Signs\nMarquee signs are permitted for nonresidential uses only in the following zoning districts: Neighborhood Commercial Zoning Districts; Community Activity Center Zoning Districts; Regional Activity Center Zoning Districts; Innovation Mixed-Use Zoning Districts; and Transit Oriented Development Zoning Districts.\nMarquee signs shall be supported solely by the building to which they are attached. No exterior columns or posts are permitted as supports.\nThe roof of a marquee sign shall not be used for any purpose other than to form and constitute a roof or to support a vertically-oriented extension of the sign extending upward and mounted perpendicular to the wall on which the marquee is mounted.\nMarquee signs shall be erected over a building entrance. The width of a marquee sign is limited to the width of the building entrance with an additional five-foot extension of the marquee sign allowed on each side of the building entrance so long as such extension is part of the same structure.\nAll marquee signs shall maintain a minimum vertical clearance of nine feet, and the roof of the marquee structure shall be erected below any second-floor windowsill located above the marquee and cannot obstruct any other architectural features.\nMarquee signs may encroach over a public or private sidewalk and/or amenity zone but shall not project from a building façade more than nine feet and shall be no closer than four feet from the future back of curb.\nMarquee signs are permitted a vertically-oriented extension attached to and located above the roof of a marquee sign structure and perpendicular to the building wall. The height of the vertically oriented extensionis limited to a maximum of 24 inches above the building parapet. Such vertically-oriented extension is limited to a maximum projection of 75% of the depth of the marquee, as measured perpendicularly from the building wall to the furthest point of the marquee structure.\nMarquees may be internally or externally illuminated.\nMARQUEE SIGNF. Roof Signs\nRoof signs are permitted only for nonresidential buildings and multi-family dwellings of 30 feet or more in height in the CR, UC, UE, TOD-UC, and TOD-CC Zoning Districts.\nThe size of the roof sign is limited to a height of 15 feet above the roof, including the support structure. The width of a roof sign is limited to 65% of the roof level width or 40 feet, whichever is less.\nRoof signs shall be designed with channel letters/icons and the overall area shall be a minimum of 40%transparent.\nA maximum of one roof sign is permitted per building. Roof signs shall only be installed on a flat roof.\nIf a roof sign is erected on a building, a skyline sign (Item G below) is prohibited.\nA roof sign shall be set back a minimum of five feet from the edge of a roof.\nRoof signs shall be safely and securely attached to the roof structure and cannot interfere with any roof access points.\nRoof signs shall only be internally illuminated.\nROOF SIGNG. Skyline Signs\nSkyline signs are permitted only for nonresidential buildings and multi-family dwellings of 50 feet or more in height in the following zoning districts: Neighborhood Commercial Zoning Districts; Community Activity Center Zoning Districts; Regional Activity Center Zoning Districts; Innovation Mixed-Use Zoning Districts; Commercial Zoning Districts; Manufacturing and Logistics Zoning Districts; Campus Zoning Districts; and Transit Oriented Development Zoning Districts.\nThe size of the skyline sign is limited as follows:\n\nBuilding height of 50’ to 75’: 300sf\nBuilding height of greater than 75’ to 100’: 480sf\nBuilding height of greater than 100’ to 200’: 600sf\nBuilding height of greater than 200’ to 500’: 720sf\nBuilding height of greater than 500’: 850sf\n\n\nOne skyline sign is permitted per facade.\nSkyline signs shall be placed within the top 20% of the height of the structure and cannot cover any windows or architectural features.\nSkyline signs may project up to 24 inches above the roofline or parapet but shall be designed as a wall-mounted sign and cannot be primarily supported by structures installed on the roof.\nIf a skyline sign is erected on a building, a roof sign (Item F above) is prohibited.\nSkyline signs shall only be internally illuminated.\nSKYLINE SIGN Updated diagramH. Temporary Signs for Development Construction Lots\nDevelopments under construction are permitted temporary ground signs.\nOne primary and two secondary temporary ground signs are allowed per street frontage of the development. In addition to these temporary signs, either one real estate activity or one construction activity sign may also be permitted per street frontage.\nThe maximum sign area of a primary sign is limited to 48 square feet in the Neighborhood 1  and Neighborhood 2 Zoning Districts, and 64 square feet in all other zoning districts. The maximum sign area of a secondary sign is limited to 12 square feet.\nThe maximum height of the primary sign is limited to ten feet, and six feet for a secondary sign.\nWithin 30 days after all final certificates of occupancy have been granted, all temporary signs installed per this section shall be removed.\nI. Wall-Mounted Signs\nGeneral Regulations\n\nWall-mounted signs are permitted for all multi-family and nonresidential uses in any zoning district.\nWall signs, projecting signs, and awning and canopy signs are considered wall-mounted signs. Other signs of this section that may be mounted on a wall, such as marquee, skyline, and roof signs, are regulated separately and do not count toward the maximum sign area of wall-mounted signs. Painted and projected wall signs (Item J and Item K, respectively) are also not considered wall-mounted signs and are regulated separately and do not count toward the maximum sign area of wall-mounted signs.\nIn a multi-tenant building, the maximum square footage of all wall-mounted signs is allocated by tenant with leasable building wall square footage along each building facade.\nThe maximum square footage of all wall-mounted signs is 10% of the tenant’s leasable building wall square footage or 300 square feet, whichever is less. This limit applies to each tenant and square footage cannot be transferred from one tenant of a structure to another or from one facade of a structure to another.\n\n\nWALL SIGN\nWall Sign(Painted wall signs and projected wall signs are not regulated by this section and are regulated separately in Items J and K below.)\n\nWall signs are permitted on each facade of a structure. On a site consisting of multiple structures, each structure is permitted wall signs per the regulations of this section.\nWall signs may be internally or externally illuminated. If externally illuminated, all light shall be directed onto the sign face.\nWall signs shall be safely and securely attached to the building wall. Wall signs shall not project more than 18 inches from a building wall.\nWall signs with a background, such as cabinet-box or flat-panel style wall signs, and any associated sign support structure shall not project beyond the ends or top of the wall, or higher than the roofline of the structure to which they are attached. Signs without a background, such as pin-mounted or raceway-mounted channel letter signs, and any associated sign support structure may project a maximum of 24 inches above the roofline but may not project horizontally beyond the end of the wall to which they are attached.\nParapets added to existing buildings for the purpose of attaching signs shall match the architecture of the rest of the building, be of the same thickness, and on the same plane as the wall to which it is added, and no more than six feet above the roofline. Additions to a parapet for the purpose of signage cannot be braced back to the roof.\nWall signs cannot cover any window, windowsill, transom sill, or architectural feature, such as cornices, of the structure.\n\n\nProjecting Signs\n\nProjecting signs shall maintain a minimum vertical clearance of nine feet. No projecting sign affixed to a building shall project higher than the building height, including the sign support structure.\nProjecting signs shall be mounted within the first four stories of the structure.\nProjecting signs are limited to a maximum sign area of 75 square feet. Sign area is counted toward the maximum sign area of all wall-mounted signs.\nOne projecting sign is permitted per tenant with frontage on a street. For a corner lot, one projecting sign is permitted for each street frontage.\nProjecting signs are limited to a projection of four feet from the building facade or up to four feet from the future back of curb, whichever is less.\nProjecting signs may be internally or externally illuminated.\n\n\nPROJECTING SIGNJ. Wall Signs, PaintedA painted wall sign is not limited to only the application of paint on the wall surface. Painted wall signs include other methods of application and/or materials, including but not limited to, tiles or screen printing.\nPainted wall signs are permitted for all nonresidential uses in any zoning district. Painted wall signs are regulated separately and do not count toward the maximum sign area of wall-mounted signs of Item I above.\nPainted wall signs are permitted on each facade of a structure. There is no size limit for a painted wall sign.\nPainted wall signs shall not be painted on or obscure architectural features such as windows, doors, pilasters, or cornices.\nPainted wall signs may be externally illuminated. If externally illuminated, all light shall be directed onto the sign face.\nPainted wall signs shall not project more than 0.25 inches from a building wall.\nNothing in this section shall prevent an installer from incorporating their name or other identifying information as part of the painted wall sign.\nThe property owner, or their authorized agent/representative such as the business owner, are responsible for ensuring that a permitted painted wall sign is maintained in good condition and is repaired in the case of vandalism or accidental destruction.\nK. Wall Signs, Projected\nProjected wall signs are permitted for all nonresidential uses in any zoning district. Projected wall signs are regulated separately and do not count toward the maximum sign area of wall-mounted signs of Item I above.\nProjected wall signs shall remain static and cannot flash, rotate, or move.\nNo projected wall sign can project an electronic video.\nProjected wall signs shall not glare onto adjacent properties.\nProjected wall signs shall not project past the wall onto which it is projected.\nProjected wall signs shall not be projected over any other permanent or temporary sign, which includes painted wall signs.\n", "metadataJson": "{\"section_url\": \"/articles/article-22-signs/#229-signs-requiring-a-permit\"}"}, {"title": "22.10  OUTDOOR ADVERTISING SIGNS", "text": "A. PurposeThe purpose of this section is to establish regulations for outdoor advertising signs that contain off-premise advertising and noncommercial messages to reduce visual clutter, protect the view of the skyline, reduce distractions for motorists, and reduce conflicts with traffic control signs. These regulations are designed to:\nPresent and perpetuate uncluttered and natural views for the enjoyment and environmental enrichment of the citizens of Charlotte, as well as visitors.\nPromote economic prosperity, civic pride, quality of life, and the general welfare of citizens.\nEnhance the aesthetic values of the city and its economic vitality.\nProtect property values.\nPromote good urban design.\nPromote safety of motorists.\nB. Static Outdoor Advertising SignsPermits for new static outdoor advertising signs are issued only in accordance with the standards and regulations listed Table 22-4: Static Outdoor Advertising Signs. This excludes electronic changeable face outdoor advertising signs, tri-vision outdoor advertising signs, and other similar technologies.C. Electronic Changeable Face Outdoor Advertising Signs (Including Conversions)Permits for new electronic changeable face outdoor advertising signs or a permit to convert a static outdoor advertising sign to an electronic changeable face outdoor sign are issued only in accordance with the standards and regulations listed Table 22-5: Electronic Changeable Face Outdoor Advertising Signs (Including Conversions). These regulations apply to all outdoor advertising signs, including those with North Carolina Permits.", "metadataJson": "{\"section_url\": \"/articles/article-22-signs/#2210-\\u00a0outdoor-advertising-signs\"}"}, {"title": "22.11   SPECIAL SIGN REGULATIONS", "text": "A. Passenger Rail Pathways and Platform Signs\nThe maximum sign area for a sign on passenger rail pathways and platforms is 30 square feet.\nThe maximum sign height for a sign on passenger rail pathways and platforms is 5 feet, as measured from existing grade to the top of sign.\nA maximum of eight sign faces per passenger rail pathway and platform are permitted.\nAll signs shall be oriented to make the sign content not readily visible from any street or other zoning district-specific frontage.\nPassenger rail pathway and platform signs may be freestanding if anchored to passenger rail platform or may be attached to a platform wall or fence.\nPassenger rail pathway and platform signs shall not be electronic signs and illumination is prohibited.\nB. Development Flexibility OptionFor providing flexibility and incentives for coordinated, well-designed sign systems for large scale development, special provisions varying the standards of these regulations may be approved by the Planning Director subject to the following:\nThe development is a residential, nonresidential, or mixed-use development, 25 acres or greater in size, or 150 units for multi-family developments, or containing more than 325,000 square feet of nonresidential uses.\nA master sign program that includes the following information is submitted:\n\nDetailed designs of all proposed signs, including the size, height, and materials of such signs.\nProposed locations and number of proposed signs.\nSign illumination plan.\nPlans for landscape or architectural features to be used in conjunction with such plans.\n\n\nThe Planning Director shall determine whether the proposed signs are coordinated in terms of design features.\nThe Planning Director shall allow the following flexibility if Items 1, 2, and 3 above are met:\n\nThe maximum size of individual detached signs may be varied by up to 25%.\nThe number of ground signs along a street frontage may be increased up to three signs.\nThe maximum height of a ground sign may be increased up to 12 feet except when located along a Limited Access Road, Parkway, or Arterial (except Main Street), where the height may be increased up to 16 feet.\nSubject to the sign criteria set out below, a commercial or a mixed-use development containing over 500,000 square feet of gross building area may have additional ground signs at the pedestrian entrances into the building(s). Such signs are not considered to be ground signs along a street frontage and do not count towards the maximum of three ground signs along a street frontage. Such signs are subject to the following:\n\nEach sign shall be located a minimum of 400 feet from any street or other zoning district-specific frontage.\nEach sign shall be located within 150 feet of a pedestrian entrance.\nThe maximum height of each sign is 18 feet, and the maximum sign area is 70 square feet per side.\n\n\n\n\nC. Detached Signs Impacted by Government-Sponsored ProjectsWhen a government-sponsored project requires either the relocation of an existing ground sign or impairs the visibility of an existing ground sign from the lane of travel adjacent to the sign, adjustments to the ground sign location and standards may be requested in accordance with the following.\nRelocation of a Sign Approved on a Conditional Site Plan\n\nRelocation of a ground sign, whose location was originally approved on a conditional site plan, may be requested if the sign’s visibility from the adjacent travel lane is impacted by a government-sponsored project, or if the project requires the relocation of the sign.\nThe requested new location is not required to be a location shown on the approved conditional site plan.\n\n\nConverting a Monument Sign to a Pole Sign\n\nConversion of a monument sign may be requested if the sign’s visibility from the adjacent travel lane is impacted by a government-sponsored project.\nConversion to a pole sign may be requested even if the zoning district or conditional site plan does not allow pole signs.\nConversion to a pole sign shall only be considered if the ground sign cannot be relocated to another location that allows visibility from the adjacent travel lane.\n\n\nModification to the Maximum Height of a Sign\n\nModification to the maximum allowed height of a detached sign may be requested if the sign’s visibility from the adjacent travel lane is impacted by a government-sponsored project.\nModification to the maximum allowed height may be requested even if the height is greater than that allowed by a conditional site plan.\nModification to the maximum allowed height shall only be considered if the sign cannot be relocated to another location that allows visibility from the adjacent travel lane.\nModification to the maximum allowed height shall only be considered if the increase is ten feet or less above the maximum sign height permitted in the zoning district.\n\n\nApproval and New Sign Permit Required\n\nAn application shall be submitted to the Planning Department requesting the detached sign modification. The Planning Director has the authority to approve or disapprove the application. Considerations in granting approval include, but are not limited to, the following:\n\nNeed for relocation due to the government-sponsored project.\nLoss of visibility from the adjacent lane of travel.\nImpact of relocated utility lines.\nPurpose and intent of sign restrictions on conditional site plan.\nTopographical changes due to the government-sponsored project.\nUnusual or unique circumstances.\nIf the sign is proposed to be moved, has the distance between the existing and proposed location been minimized.\nIf converting to a pole sign, has the requested increase in the sign height been minimized.\nIf increasing the maximum sign height, has the increase in the proposed sign height been minimized.\nConsolidation of multiple individual signs.\nAll other sign standards of this article and the zoning district in which the sign is located are met.\n\n\nIf the application is approved, a new sign permit is required for each sign.\n\n\nD. Landmark and Historic Signs\nDesignation Procedure\n\nThe property owner of the parcel where a proposed landmark sign is located, or the owner of the site where a proposed historic sign is to be relocated, may apply for designation of an existing sign as a landmark or historic sign. Such application shall be submitted on a form determined by the Planning Department. The Zoning Administrator has the authority to approve or to disapprove the designation of landmark or historic signs based upon the criteria stated below. At the time of the filing of a landmark or historic sign designation application, the applicant shall file all necessary information for the Planning Department to determine if the sign meets the criteria for the requested designation. The Zoning Administrator has the authority to request whatever other information is necessary to make a decision. The burden of proof for meeting the criteria is upon the applicant.\nIn approving or disapproving a landmark or historic sign application, the Zoning Administrator shall state the reasons in writing. An appeal of the decision to the UDO Board of Adjustment shall be properly filed within 30 days of the date of the decision as shown on the face of the decision.\nOnce a sign has been designated as a landmark or historic sign, the Planning Department shall then issue a certificate to the applicant stating that the sign has been duly designated as a landmark or historic sign.\nIf the sign being considered for landmark or historic designation is associated with a designated local landmark or located in an established Historic District, the Planning Department shall receive a recommendation from the appropriate Charlotte-Mecklenburg Historic Landmark Commission or the Historic District Commission before deciding.\nAfter a sign is designated as a landmark or historic sign it shall be maintained in its original condition, shape, and size, except for minor changes required for structural enhancements or changes required to comply with minimum Building or Electrical Codes, or to remove portions from a public right-of-way. Where original materials are unavailable, substitute materials shall be used that are as similar as possible to the original material.\nWhile a designated landmark or historic sign is deemed conforming, this section is not intended to prevent the Planning Department from enforcing this Ordinance if it, or another City agency, determines that there is a violation of any provisions, or the intent and purposes of any provisions of this Ordinance.\nNothing in this section shall prohibit the owner(s) of a designated landmark or historic sign from removing such a sign.\n\n\nLandmark SignsThe purpose of designating a sign as a landmark sign is to encourage the restoration and retention of on-premise, nonconforming signs that are historically significant. Once designated as a landmark sign, the sign is deemed conforming.\n\nDesignation CriteriaThe Planning Department may designate an existing on-premises sign as a landmark sign if it meets the following criteria:\n\nThe sign has been in continuous existence at the present location for at least 25 years.\nThe sign is an on-premises sign, which meets at least four of the following criteria:\n\nIt was expressly designed for the business, institution, or other establishments at that location.\nIt bears a national or local emblem, logo, or other graphic that is unique to the property or the establishment.\nThe sign exhibits unique or rare characteristics that enhance the streetscape or identity of a neighborhood.\nThe sign is significant as evidence of the history of the product, business, or service advertised.\nThe sign is characteristic of a specific historic period.\nThe sign is integral to the building’s design or physical fabric.\nThe sign represents an outstanding example of the sign maker’s art due to craftsmanship, use of materials, or design.\n\n\nThe sign complies with the appropriate provisions of the North Carolina State Building and Electrical Codes. Such signs are allowed structural and electrical repairs, with the approval of a sign permit, to meet the standards of such codes.\nIf any portion of the sign is permitted to remain in or over a City right-of-way, a CDOT encroachment agreement is required.\nThe sign is structurally safe or is capable of being made so without substantially altering its historical significance.\n\n\nLocationIf a designated landmark sign is moved on-premise, it shall be subject to the location standards of this article.\n\n\nHistoric SignsThe restoration and retention of nonconforming, historically significant signs that have been removed from their original locations and are to be reused is encouraged. Allowing those signs to move to other locations within the community is necessary to ensure preservation. Once designated as a historic sign, the sign is deemed conforming.\n\nDesignation CriteriaThe Planning Department may designate an existing sign as a historic sign if it meets the following criteria:\n\nThe sign shall be at least 25 years old.\nThe sign shall meet at least three of the following criteria:\n\nIt bears a national or local emblem, logo, or other graphic that is unique to the community.\nThe sign exhibits unique or rare characteristics that enhance the streetscape or identity of a neighborhood.\nThe sign is significant as evidence of the history of the product, business, or service advertised.\nThe sign is characteristic of a specific historic period.\nThe sign represents an outstanding example of the sign maker’s art due to craftsmanship, use of materials, or design.\nThe sign complies with the appropriate provisions of the North Carolina State Building and Electrical Codes. Such signs are allowed structural and electrical repairs, with the approval of a sign permit, to meet the standards of such codes.\nThe sign is structurally safe or is capable of being made so without substantially altering its historical significance.\n\n\n\n\nLocationThe sign may be moved to another location on the site where it is currently located or to another property. It is encouraged that the sign be relocated to a site within the neighborhood from which it originated. The receiving site shall be located outside of a Neighborhood 1 Zoning District or Neighborhood 2 Zoning District for commercial signs.\nNonconforming Aspects of Relocated Signs\n\nRelocated historic signs that are nonconforming based on their size, height, or lighting do not have to be brought into conformance. However, such signs shall not increase the degree of nonconformity by any physical alterations to the sign that previously rendered them nonconforming.\nSign lighting of relocated historic signs shall be located, screened, or shielded so that abutting lots located in any Neighborhood 1 Place Type and Neighborhood 2 Place Type are not directly illuminated and do not cause glare or impair the vision of motorists.\nProjecting signs that extend beyond the maximum projecting dimension based upon the existing dimension of the sign require a CDOT encroachment agreement if they project into the city right-of-way.\nThe relocation of historic signs that are considered prohibited by this article may maintain the prohibited characteristic, provided such features are considered part of the historic or cultural character of the sign and approved as part of the designation.\nRelocated outdoor advertising signs shall comply with only the following sections of Table 22-6: zoning district, location, spacing, and tree-cutting regulations.\n\n\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-22-signs/#2211-\\u00a0-special-sign-regulations\"}"}, {"title": "22.12   PROHIBITED SIGNS", "text": "The following signs and sign structures are specifically prohibited. Other signs that have not been expressly allowed by these regulations are also prohibited.A. Balloon signs, including air-infused/air-inflated signs.B. Feather flags. Also known as sails.C. Except in the UC Zoning District, flashing, fluttering, swinging, or rotating signs other than time and/or temperature signs.D. Pennants. Streamers are considered pennants.E. Portable sign structures.F. Signs that constitute a traffic hazard, including signs that:\nInterfere with, obstruct the view of, or may be confused with any authorized traffic sign, signal, or device because of its position, shape, or color, including signs illuminated in red, green, and/or amber color to resemble a traffic signal.\nMake use of words, phrases, symbols, or characters in a manner that misleads, interferes with, or confuses traffic.\nG. Signs painted, pasted, stapled, taped, or otherwise affixed to a tree, fence, utility pole, bench, trash receptacle, or similar non-sign structure.H. Vehicle signs.", "metadataJson": "{\"section_url\": \"/articles/article-22-signs/#2212-\\u00a0-prohibited-signs\"}"}, {"title": "22.13 ADMINISTRATION", "text": "A. Appeals and variances of these sign regulations shall be subject to Article 37.B. Inspections and enforcement actions of these sign regulations shall be subject to Article 39.", "metadataJson": "{\"section_url\": \"/articles/article-22-signs/#2213-administration\"}"}]}