{"title": "Article 8. Manufacturing & Logistics Zoning Districts", "metadataJson": "{\"base_url\": \"article-8-manufacturing-logistics-zoning-districts\"}", "section": [{"title": "8.1 PURPOSE", "text": "\nML-1 Manufacturing and Logistics Zoning DistrictThe ML-1 Manufacturing and Logistics Zoning District is intended to accommodate a range of warehouse/distribution and light industrial uses, including a variety of light manufacturing and assembly. The ML-1 Zoning District includes significant screening and buffering requirements to ensure adequate separation and mitigation of potential impacts on surrounding areas. Limited restaurant, retail, and personal service uses to accommodate area workers are also allowed in the zoning district. The ML-1 Zoning District is generally located in areas readily accessible by arterials and interstates, as well as freight rail.\nML-2 Manufacturing and Logistics Zoning DistrictThe ML-2 Manufacturing and Logistics Zoning District is intended to accommodate industrial uses, including those uses that may be hazardous or noxious. Such uses may have significant external impacts and may include large areas of outdoor storage or operation. The ML-2 Zoning District includes significant screening and buffering requirements to ensure adequate separation and mitigation of potential impacts on surrounding areas. The ML-2 Zoning District is generally located in areas readily accessible by arterials and interstates, as well as freight rail.\n", "metadataJson": "{\"section_url\": \"/articles/article-8-manufacturing-logistics-zoning-districts/#81-purpose\"}"}, {"title": "8.2 USES", "text": "Article 15 lists permitted, temporary, and accessory uses for the Manufacturing and Logistics Zoning Districts. Use definitions are found in Article 15.", "metadataJson": "{\"section_url\": \"/articles/article-8-manufacturing-logistics-zoning-districts/#82-uses\"}"}, {"title": "8.3 DIMENSIONAL AND DESIGN STANDARDS", "text": "\nGeneral\n\nThe tables below include the dimensional and design standards for the Manufacturing and Logistics Zoning Districts. Standards within the tables below may contain specific regulations organized by frontage type (Section 3.5).\nWhere this Ordinance refers to frontages in general, transit station, off-street public path, public park shall not be considered a frontage within the Manufacturing and Logistics Zoning Districts.\nIn the tables below, where a cell contains a standard or a “.” the standard is applicable. Where a cell is blank and shaded, the standard does not apply.\n\n\nLotLot standards govern the basic dimensions of lots, including but not limited to minimum area, width, and coverage as applicable. These standards are intended to provide a rational basis for the division, organization, and development of land within the City of Charlotte.\nTable 8-1: Manufacturing and Logistics Zoning Districts Lot Standards\nBuilding SitingBuilding siting standards govern the placement of buildings on lots and are intended to ensure that development maintains compatibility with its surrounding context and the intent of the applicable zoning district.\nTable 8-2: Manufacturing and Logistics Zoning Districts Building Siting Standards1 On local and collector streets, measured from the curb location for Industrial Local Street Cross Section in CLDSM or the existing back of curb, whichever is farthest from the centerline. If SSI standards require the relocation of the back of curb or the back of curb is voluntarily relocated, that shall be considered the existing back of curb location.2 In no case shall any building entry be located closer than six feet to an existing or proposed off-street public path or shared use path.3 For the Transit Station/ Off-Street Public Path, Public Park frontage, shall be measured from a property line or right-of-way line. If there is an easement in place for any frontage, then the measurement shall be taken from such easement. For any frontage abutting a reservation for a future frontage, the frontage setback line shall be measured from the edge of the reservation area.4 Rear setbacks are not required for industrial uses when the rear setback is adjacent to railroad rights-of-way for freight rail.\nBuilding HeightBuilding height standards govern the maximum heights of buildings as applicable and are intended to provide flexibility while maintaining appropriate transitions to adjacent areas.\nTable 8-3: Manufacturing and Logistics Zoning Districts Building Height Standards1 The height and location of structures may be restricted by the limitations set forth in the Code of Federal Regulations (CFR) Title 14 Part 77: Safe, Efficient Use, and Preservation of the Navigable Airspace. A notice of proposed construction FAA Form 7460-1 must be filed with the FAA for construction or alteration that impacts any of the imaginary surfaces as defined in 14 CFR Part 77 or is more than 200 feet in height above the ground at its site at least 45 days prior to construction. The Aviation Department Planning Division may serve as a point of contact for information regarding building notification requirements and obstruction evaluation2 The maximum building height of any structure within 200 feet of residential uses or vacant land in a Neighborhood 1 Place Type is limited as follows: That portion of a structure within the first 100 feet is limited to a maximum of 50 feet in height; that portion of a structure within 100 to 200 feet is limited to a maximum of 65 feet in height. These standards apply only to that part of a structure within the 200 foot distance, and each portion of the building may be measured independently, from the average grade of the portion being measured to the highest point of the same portion. This limitation does not apply to public parks of three acres or greater within a Neighborhood 1 Place Type, nor to an area of two or fewer parcels totaling no more than three acres within a Neighborhood 1 Place Type.\nBuilding Design StandardsDesign standards govern the fundamental elements of building design and are intended to encourage the creation of a built environment that is aesthetically and functionally of a high-quality.\nTable 8-4: Manufacturing and Logistics Zoning Districts Building Design Standards1 The Zoning Administrator may waive this requirement if they determine that the nature of the use does not require such pedestrian connections, for example warehouse and distribution centers, airports, truck and rail freight terminals, and other similar uses.\nBuilding MaterialsThe following building materials are limited to 50% of each façade along a frontage. They may also be used as a component of construction when not a surface finish material without limitation.\n\nCorrugated metal siding; however, the reuse of pre-fabricated shipping containers is permitted and is not subject to this limitation, subject to compliance with the building code and other applicable codes\nPlain concrete masonry units (CMU)\nPlastic\nT-111 composite plywood siding\nVinyl\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-8-manufacturing-logistics-zoning-districts/#83-dimensional-and-design-standards\"}"}, {"title": "8.4 GENERAL DEVELOPMENT STANDARDS", "text": "\nGeneral Development StandardsGeneral development standards are found in Article 16.\nAccessory StructuresStandards for accessory structures are found in Article 17.\nArchitectural FeaturesStandards for architectural features are found in Article 18.\nOff-Street ParkingStandards for off-street parking and bicycle parking are found in Article 19.\nLandscaping and ScreeningLandscaping and screening standards are found in Article 20.\nLoading and ServiceStandards for loading spaces and service areas are found in Article 21.\nSignsStandards for signs are found in Article 22.\nDrainageStandards for drainage are found in Article 24.\n", "metadataJson": "{\"section_url\": \"/articles/article-8-manufacturing-logistics-zoning-districts/#84-general-development-standards\"}"}]}