{"title": "Article 14. Special Purpose & Overlay Zoning Districts", "metadataJson": "{\"base_url\": \"article-14-special-purpose-overlay-zoning-districts\"}", "section": [{"title": "14.1 HDO HISTORIC DISTRICT OVERLAY", "text": "A. PurposeThe purpose of the HDO Historic District Overlay is to establish local historic districts to encourage the restoration, preservation, rehabilitation, and conservation of historically, architecturally, and archaeologically significant areas, structures, buildings, sites, and objects and their surroundings from potentially adverse influences which may cause the decline, decay, or total destruction of important historical, architectural, and archaeological features, which are a part of the City’s heritage, and to review new construction design to ensure compatibility with the character of the district.B. ApplicabilityThe HDO Historic District Overlay is applied as an overlay zoning district which will supersede other zoning districts with respect to compatibility, context, and appropriateness of exterior features as described in item E below within a designated local historic district. An HDO Historic District Overlay cannot be applied in combination with any of the following: HDO-S Streetside Historic District Overlay, NCO Neighborhood Character Overlay, and RIO Residential Infill Overlay.C. Designation\nHistoric District Overlays shall consist of areas that are deemed to be of special significance in terms of their history, architecture and/or culture and to possess integrity of design, setting, materials, feeling and association. The area, buildings, structures, sites, or objects shall be significant elements of the cultural, social, economic, political, or architectural history of the City or of the archaeological history or prehistory of the City and the conservation of such a district will provide for the education, pleasure, and enhancement of the quality of life of all residents of the City.\nThe Historic District Commission (HDC) shall make an investigation and report on the historical, architectural, or archaeological significance of the buildings, structures, features, sites, objects, or surroundings included in a proposed district, and prepare a description of the boundaries of the district.\nThe North Carolina Department of Natural and Cultural Resources, or an agent or employee designated by its Secretary, shall make an analysis of, and recommendations concerning, this report and description of proposed boundaries in accordance with state law. Failure of the Department to submit its written analysis and recommendations to the City Council within 30 calendar days after a written request for such analysis has been mailed to the Department shall relieve the City of any responsibility for awaiting such an analysis, and the City Council may at any time thereafter take any necessary action.\nWith respect to any changes in the boundaries of such district subsequent to its initial establishment or the creation of additional districts within the City, the investigative studies and reports shall be prepared by the Historic District Commission. Changes in the boundaries of an initial district or proposals for additional districts shall also be submitted to the Department of Natural and Cultural Resources in accordance with the provisions stated above.\nThe City Council shall designate the boundaries of a new HDO or change in boundary to an HDO in accordance with procedures set forth in Section 37.2 for amending the Zoning Map.\nD. Certificate of Appropriateness Required\nNo exterior portion of any building or other structure, including masonry walls, fences, light fixtures, steps and pavement, or other appurtenant features, above-ground utility structures, any type of outdoor advertising sign, or important landscape and natural features may be erected, altered, restored, moved, or demolished within an HDO until after the property owner, or his/her designated agent, has contacted the Historic District Commission staff to determine whether the project will require a Certificate of Appropriateness (COA).\nWhen a Certificate of Appropriateness is required, an application for a Certificate of Appropriateness shall be submitted and work may not begin until the Certificate of Appropriateness has been issued. A Certificate of Appropriateness shall be issued by the Historic District Commission prior to the issuance of a building permit or other permit granted, for the purposes of constructing, altering, moving, or demolishing structures. A Certificate of Appropriateness is required whether or not a building permit is required.\nE. Exterior FeaturesExterior features include the architectural style, general design, and general arrangement of the exterior of a building or other structure, including the kind and texture of the building materials, the size and scale of the building, and the type and style of all windows, doors, light fixtures, signs, and other appurtenant fixtures. In the case of outdoor advertising signs, exterior features mean the style, material, size, and location of all such signs. Exterior features may also include color and important landscape and natural features of the area.F. Minor WorksThe Historic District Commission has the authority to delegate to their professional staff approval of certain types of minor works consistent with the detailed standards approved by the Historic District Commission. Minor works do not involve substantial alterations, additions, or removals that could impair the integrity of the property and/or the district as a whole or would be incongruous with the special character of the district. Staff shall not deny a request for a Certificate of Appropriateness. All applications where it cannot be determined that the action is a minor work or where the application may be incongruous with the special character of the district shall be submitted to the Historic District Commission.G. Interior ArrangementThe Historic District Commission has no jurisdiction over interior spaces, unless the arrangement of interior features directly affects the integrity of the exterior of the property and, therefore, would be incongruous with the special character of the district as a whole.H. Ordinary Maintenance and Emergency RepairNothing in these provisions shall be construed to prevent the ordinary maintenance, repair, or removal of any exterior feature in a historic district which does not involve a change in design, material, or outer appearance nor to prevent the construction, reconstruction, alteration, restoration, or demolition of any such feature that a Building Inspector or similar official shall certify is required for public safety because of an unsafe or dangerous condition. In the event of an emergency, Historic District Commission staff may authorize the immediate restoration of any exterior feature to pre-disaster conditions. Historic District Commission staff shall be consulted and/or the feature shall be well documented photographically and such documentation shall be made available to the Historic District Commission for its files, if appropriate.I. Restoration or Repair of Historic FeaturesThe Zoning Administrator in consultation with the Historic District Commission Administrator may administratively approve the restoration or replacement of an historic feature necessitated in the Secretary of the Interior’s Standards for the Treatment of Historic Properties as defined by the National Park Service (Secretary’s Standards) if the feature would encroach into a required setback or required landscape yard that is not permitted by this Ordinance. Restoration or replacement of missing features shall be substantiated by documentary, physical, or pictorial evidence.J. Demolition or Removal\nAfter the designation of a historic district, no building or structure located in that district shall be demolished or otherwise removed until the owner of the property has applied for a Certificate of Appropriateness for demolition or removal. If the Historic District Commission determines that the property does not have special significance and value toward maintaining the character of the historic district because of age, architectural style, associative history, designation as a local historic landmark, listed as a contributing building in the National Register of Historic Places, or structural condition, the Historic District Commission may grant a Certificate of Appropriateness for the immediate demolition or removal of the property.\nIf the property is determined by the Historic District Commission to have special significance and value toward maintaining the character of the district, the Historic District Commission may delay demolition or removal for no more than 365 days from the date of the approval. During this 365 day period, the Historic District Commission may negotiate with the owner and with any other parties in an effort to find a means of preserving the building.\nAn application for a Certificate of Appropriateness authorizing the demolition of a building, structure, or site within the district may not be denied. The maximum period of delay authorized by this section shall be reduced by the Historic District Commission where it finds that the owner would suffer extreme hardship or be permanently deprived of all beneficial use of or return from such property by virtue of the delay. If the Historic District Commission finds that the building has no particular significance or value toward maintaining the character of the district, it shall waive all or part of such period and authorize earlier demolition or removal.\nIf the Commission has voted to recommend designation of an area as an Historic District and final designation has not been made by City Council, the demolition or destruction of any building, site, or structure located in the proposed district may be delayed by the HDC for a period of up to 180 days or until City Council takes final action on the designation, whichever occurs first. Should City Council approve the designation prior to the expiration of the 180 day delay period, an application for a Certificate of Appropriateness for demolition shall then be filed. The maximum period of delay for a Certificate of Appropriateness for demolition shall be reduced by the HDC by the period of delay while the designation was pending.\nK. Compliance with Other Applicable LawsIf site plans have been submitted that are not in compliance with this Ordinance or other identified state or local laws, then the Certificate of Appropriateness or any permits or certificates issued by the City may be revoked. An applicant shall submit site plans that are in compliance with this Ordinance and with any other state or local laws designated by the Historic District Commission. If the Historic District Commission staff or the Historic District Commission determines that submitted site plans are not in compliance with this Ordinance or other state or local laws designated by the Historic District Commission, then the Historic District Commission staff or Historic District Commission shall not be required to proceed to review the application for the Certificate of Appropriateness until site plans have been submitted that are in accordance with this Ordinance and applicable state or local laws. If site plans have been submitted that are not in compliance with this Ordinance or other identified state or local laws, then the Certificate of Appropriateness or any permits or certificates issued by the City may be revoked.L. Certificate of Appropriateness\nJurisdictionThe Historic District Commission has jurisdiction over the review, approval, and issuance of Certificates of Appropriateness for the exterior features of all properties and for the demolition or removal of any building or structure within a historic district as per this Section 14.1.\nReview Standards\n\nIn considering an application for a Certificate of Appropriateness, the Historic District Commission shall first determine that the project is congruous with the special character of the historic district in terms of size, scale, and massing, as well as maintaining a pedestrian scale and orientation.\nThe Historic District Commission shall apply the Secretary of Interior’s Standards for Rehabilitation (See 36 Code of Federal Regulations Section 67.7). (Hereinafter: Secretary’s Standards), and the Historic District Design Standards adopted by the Historic District Commission. Approval of a Certificate of Appropriateness by the Historic District Commission should not be interpreted as approval for any other process, such as state or federal tax incentives.\n\n\nApplicationThe applicant has the responsibility to submit an application for a Certificate of Appropriateness that is accurate, complete, and accompanied by sufficient information to fully depict the proposed development, alteration, rehabilitation, relocation, restoration, or demolition. A fee, as applicable, shall be provided to the Historic District Commission staff. If the applicant fails to submit a complete application and any required fee, then the application shall not be submitted for review to the Historic District Commission until the deficient requirements have been met to the satisfaction of the Historic District Commission staff.\nSubmission of Site Plan ComplianceAn applicant shall submit site plans that are in compliance with this Ordinance and with any other local or State laws designated by the Historic District Commission. If the Historic District Commission staff or the Historic District Commission determines that submitted site plans are not in compliance with this Ordinance or other State or local laws designated by the Historic District Commission, then the Historic District Commission staff or Historic District Commission shall not be required to proceed to review the application for the Certificate of Appropriateness until site plans have been submitted that are in accordance with this Ordinance and applicable state or local laws.\nEvidentiary Hearing NoticeThe Historic District Commission staff shall follow the requirements for evidentiary hearing notice in Section 37.8.A.9 to inform the applicant, property owner if different from the applicant, and abutting property owners prior to the hearing.\nProcedure\n\nPrior to Evidentiary Hearing\n\nAll properly filed applications for a Certificate of Appropriateness shall be reviewed and acted upon within a reasonable time, not to exceed 180 days from the date the application is filed. An application is considered filed when accepted by the HDC at the initial public hearing.\nStaff may transmit all applications, analyses, reports, and written materials prior to the hearing, in written or electronic form, at the same time to the Historic District Commission, the applicant, and the property owner, if the property owner is not the applicant.\n\n\nEvidentiary Hearing\n\nThe Historic District Commission evidentiary hearing shall follow its adopted Rules of Procedure and the quasi-judicial procedures and decision requirements of Section 37.8.A.11 and 37.8.A.12.\nPrior to issuance or denial of the Certificate of Appropriateness by the Historic District Commission, the applicant and persons of standing shall have the right to participate as a party at the hearing. Other witnesses may present competent, material, and substantial evidence that is not repetitive as allowed by the Commission.\nAll meetings of the Historic District Commission shall be open to the public in accordance with the North Carolina open meetings law.\nIn all proceedings or public hearings before the Historic District Commission with regard to an application for a Certificate of Appropriateness, the burden of providing competent, material, and substantial evidence is upon the applicant and if the applicant fails to do so, the Historic District Commission shall deny the Certificate of Appropriateness.\nNotwithstanding other provisions of this Ordinance, the Historic District Commission may require additional evidence or memoranda of authority to be submitted and may take the matter under advisement until such evidence or memoranda has been submitted and considered up to the 180 day limit.\n\n\n\n\nDuration of Certificate of Appropriateness\n\nA Certificate of Appropriateness shall be valid for 12 months from the date of issuance.\nIf a building permit is required, failure to procure a building permit within 12 months from the date of issuance shall be considered a failure to comply with the Certificate of Appropriateness and the Certificate of Appropriateness shall expire. The Certificate of Appropriateness may be renewed for an additional 12 months by staff upon written request of the applicant, before the permit expires in order to procure a building permit.\nIf a building permit is not required, the approved work shall be completed within 12 months from the date of issuance. The Certificate of Appropriateness may be renewed for an additional 12 months by staff upon written request of the applicant before the Certificate of Appropriateness expires.\nNo work authorized by any Certificate of Appropriateness that has expired shall thereafter be performed until a new Certificate of Appropriateness has been secured. To secure a new Certificate of Appropriateness, a new application shall be submitted to the Historic District Commission.\n\n\nM. Appeals\nAn appeal in the nature of certiorari may be taken by any aggrieved party to the Mecklenburg County Superior Court from the Historic District Commission’s action granting or denying the Certificate of Appropriateness pursuant to N.C.G.S. § 160D-1402, or as amended.\nPursuant to N.C.G.S. § 160D-406(k) the decision of the Historic District Commission shall be provided by personal delivery, email, or by first-class mail to the applicant, property owner, and to any person who has submitted a written request for a copy prior to the date the decision becomes effective. Appeals shall be in accordance with N.C.G.S. § 160D-1405(d), or as amended. The staff member required to provide notice shall certify to the City that proper notice has been made. When first-class mail is used to deliver the notice, three days shall be added to the time to file the petition.\nIf a petition for review pursuant to N.C.G.S. § 160D-406(k) is filed, then the petitioner must order from the court reporter and pay for the original transcript of the hearing for delivery to the clerk of the Historic District Commission for the preparation of the filing of the record in superior court. If a court ultimately renders a decision in favor of the petitioner, then the City shall reimburse the petitioner for the cost of the transcript. In the event that the petitioner does not order the transcript and does not prevail on appeal, then the City shall request the Court to make the costs of the original transcript part of the costs of the action or recover the costs in the nature of debt owed.\nN. Violations and EnforcementThe Zoning Administrator enforces Section 14.1 in accordance with Section 39.2.L. Failure to comply with these provisions constitutes a violation subject to enforcement action. Violations include but are not limited to:\nPerforming any work (including erecting, altering, restoring, moving, and/or demolishing any building, structure, private street, private sidewalk, site area or object) that requires a Certificate of Appropriateness without first obtaining a Certificate of Appropriateness.\nA Certificate of Appropriateness is denied and the project is carried out in defiance of the denial.\nWork is approved and a Certificate of Appropriateness is issued and the work is carried out in a manner inconsistent with the approval.\nO. Notices of ViolationThe Zoning Administrator enforces Section 14.1, in accordance with Section 39.2.L.2.\nUpon recognition of a violation, a notice of violation will be issued by the Zoning Administrator to the property owner. A notice of violation shall identify the nature of the violation, contain the address or other description of the site upon which the violation occurred or is occurring, and shall set forth the measures necessary to achieve compliance with this Ordinance. The notice shall inform the property owner whether a civil penalty shall be assessed or shall specify a date by which the property owner shall comply. If a violation continues or is not corrected within the time specified in the notification, appropriate action may be taken to correct and abate the violation and will subject that property owner to civil penalties and other authorized enforcement action. Each day’s continuing violation shall be a separate and distinct offense and may be subject to any one, all, or a combination of the remedies authorized and prescribed by this Ordinance in accordance with Section 39.2.C.\nThe notice of violation shall be delivered to the property owner or person in control of the land, by personal delivery, electronic delivery, or first-class mail and may be provided by similar means to the occupant of the property or the person undertaking the work or activity. The notice of violation may be posted on the property. The person providing the notice of violation shall certify to the City that the notice was provided, and the certificate shall be deemed conclusive in the absence of fraud.\nThe property owner will have 30 days to either correct the violation or appeal the citation to the UDO Board of Adjustment through the Board’s appeal procedure. If the property owner corrects the violation, no further action will be taken. If the property owner, in the opinion the Historic District Commission staff, is making a good faith effort to bring the violation into compliance, further enforcement action can be held in abeyance as long as that effort is continuing.\nA notice of violation may be appealed. An appeal stays enforcement of the action appealed from and accrual of any fines assessed during the pendency of the appeal.\nP. Citations and PenaltiesThe Zoning Administrator is authorized to issue citations and penalties, in accordance with Section 39.2.L.3.Q. Civil Judicial RemediesCivil judicial remedies are provided in accordance with Section 39.2.L.4.R. Other Remedies.\nSubject to the provisions of the development regulation, any development regulation may be enforced by any remedy provided by N.C.G.S. § 160A-175.\nIf any building, structure, site, area, or object designated as a historic landmark or located within a designated historic district is about to be demolished whether as the result of deliberate neglect or otherwise, materially altered, remodeled, removed, or destroyed, except in compliance with the development regulations in Section 14.1, or other provisions of this Ordinance, the City, the Historic District Commission, or other party aggrieved by such action may institute any appropriate action or proceedings to prevent such unlawful demolition, destruction, material alteration, remodeling, or removal, to restrain, correct, or abate such violation, or to prevent any illegal act or conduct with respect to such building, structure, site, area, or object. Such remedies shall be in addition to any others authorized by the City for a violation of the Ordinance.\nS. Revocation of Building Permit\nThe Mecklenburg County Land Use and Environmental Services Agency, on its own authority or as directed by the Planning Director, shall revoke and require the return of any building permit by notifying the permit holder in writing stating the reason for the revocation. The revocation process shall follow the same review and approval process required for issuance of the permit. The revocation of a permit by administrative staff may be appealed in accordance with Section 37.8.B.\nBuilding permits shall be revoked for any substantial departure from the approved application, plans, or specifications; for refusal or failure to comply with the requirements of a Certificate of Appropriateness, or any applicable State or local laws; or for false statements or misrepresentations made in securing the permit. Any building permit mistakenly issued in violation of an applicable State or local law may also be revoked.\nIf a Certificate of Appropriateness is required and has not been issued, then a building permit shall not be issued.\nT. Denial or Revocation of Certificate of Compliance and Occupancy\nDenial of IssuanceAs stated in the Mecklenburg County Building Ordinance, Certificates of Compliance and Occupancy, the Mecklenburg County Land Use and Environmental Services Agency, on its own authority or as directed by the Planning Director, shall not issue a Certificate of Occupancy or Certificate of Compliance unless there has been compliance with any Certificate of Appropriateness issued by the Historic District Commission. Compliance with a Certificate of Appropriateness shall include, but not be limited to, meeting all the requirements of the Certificate of Appropriateness, and in not doing any act that would have required a Certificate of Appropriateness.\nRevocationFurther, pursuant to Mecklenburg County Building Ordinance, Revocation of Permits or Certificates, any permit for a Certificate of Occupancy or Certificate of Compliance issued by the Mecklenburg County Land Use and Environmental Services Agency, in violation of any of the Historic District provisions, stated herein, may be revoked by the Mecklenburg County Land Use and Environmental Services Agency, on its own authority or as directed by the Planning Director. Revocation requires written notification to the holder of the permit or certificate stating the reason for the revocation.\n", "metadataJson": "{\"section_url\": \"/articles/article-14-special-purpose-overlay-zoning-districts/#141-hdo-historic-district-overlay\"}"}, {"title": "14.2 HDO-S STREETSIDE HISTORIC DISTRICT OVERLAY", "text": "A. PurposeThe purpose of the HDO-S Historic District Overlay Streetside is to provide for protection of the traditional development patterns of an area and to encourage the restoration, preservation, rehabilitation, and conservation of its historic structures, buildings, sites, and objects that are deemed to be of special significance. The focus is on maintaining an area’s character and on preserving those key character-defining features of individual historic resources within the district, as viewed from the street right-of-way, excluding alleys. The HDO-S regulations are intended to:\nTo promote the preservation and continued use of areas that contain a number historic structures, buildings, sites, and objects of historic significance.\nTo preserve the integrity of historically significant resources found in the area by protecting against potentially adverse influences which may cause the decline, decay, or total destruction of important historical, architectural, and archaeological features, which are a part of the City’s heritage.\nTo support sustainability by reusing existing built resources.\nTo ensure that new construction is compatible with the broader characteristics of the historic context of area, as viewed from the street.\nB. Applicability\nThe HDO-S Historic District Overlay-Streetside is applied as an overlay zoning district which will supersede other zoning districts with respect to compatibility, context, and appropriateness of exterior features as described in Section 14.1.E within a designated local historic district.\nThe provisions of Sections 14.1.C through 14.1.L, the Historic District Overlay (HDO), govern the administration of a HDO-S. The violation and enforcement provisions of Sections 14.2.C through 14.2.J apply only to the following areas within the boundaries of each HDO-S:\n\nThe public right-of-way for primary and side streets, excluding alleys.\nThe first 50% of the depth, as measured from the heated thermal wall, of any existing principal building adjacent to a public right-of-way, excepting corner lots, which are subject to review of the entirety of the lot.\nThe lot area between the public right-of-way and the first 50% of the depth, as measured from the heated thermal wall, of any existing principal building.\n50% of the depth of the lot area adjacent to the public right-of-way for vacant lots excepting corner lots, which are subject to review of the entirety of the lot.\nAny addition to a building or structure that projects beyond an existing building’s maximum front and side wall or alters, above the existing eave line, the height or shape of the roof regardless of distance from the public right-of-way.\nThe entirety of any new principal accessory building construction on a vacant lot.\nThe entirety of any new accessory building construction located in whole or in part in areas outlined in items b through d above.\nThe entirety of any Historic Landmark and its designated boundary area that may be located within an HDO-S.\n\n\n‍‍  ILLUSTRATION OF APPLICABILITY (SECTION 14.2.B.2)‍\nAn HDO-S Streetside Historic District Overlay cannot be applied in combination with any of the following: HDO Historic District Overlay, NCO Neighborhood Character Overlay, and RIO Residential Infill Overlay.\nC. AppealsThe appeal regulations in Section 14.1.M shall apply in the HDO-S Overlay District.D. Violations and EnforcementThe Zoning Administrator enforces Section 14.2 in accordance with Section 39.2.L.E. Notices of ViolationThe Zoning Administrator enforces Section 14.2 in accordance with Section 39.2.L.2.F. Citations and PenaltiesThe Zoning Administrator is authorized to issue citations and penalties, in accordance with Section 39.2.L.3.G. Civil Judicial RemediesCivil judicial remedies provided in Section 39.2.L.4 are available and shall apply in the HDO-S Overlay District.H. Other RemediesThe other remedies provided in Section 14.1.R are available and shall apply in the HDO-S Overlay District.I. Revocation of Building PermitBuilding permits may be revoked in accordance with Section 14.1.S.J. Denial or Revocation of Certificate of Compliance and OccupancyA certificate of compliance and/or a certificate of occupancy may be denied or revoked in accordance with Section 14.1.T.", "metadataJson": "{\"section_url\": \"/articles/article-14-special-purpose-overlay-zoning-districts/#142-hdo-s-streetside-historic-district-overlay\"}"}, {"title": "14.3 NCO NEIGHBORHOOD CHARACTER OVERLAY", "text": "A. PurposeThe NCO Neighborhood Character Overlay establishes regulations to preserve the existing character of a neighborhood and enhance its unique natural and architectural resources, while helping to foster compatible development within neighborhoods. The overlay district regulations are intended to:\nEncourage development and redevelopment that is consistent with a neighborhood’s character.\nProvide a means to modify zoning district regulations and establish standards for specific neighborhoods of the City to manage growth and redevelopment, and to ensure compatible neighborhood development.\nCreate a transition between locally designated historic landmark properties and/or locally designated historic districts and residential areas.\nB. Applicability\nAn NCO District may only be applied to a N1-A, N1-B, N1-C, N1-D, or N1-E Zoning District.\nAn NCO District cannot modify any standards located within existing declarations of covenants and restrictions.\nOnce the NCO District is established, the standards of the Neighborhood Character Plan apply to single-family, duplex, and triplex dwellings within the NCO District and control over those of the underlying zoning district.\nAll new construction, additions, changes, expansions, and alterations to existing single-family, duplex, and triplex dwellings shall comply with the standards of the Neighborhood Character Plan that has been adopted with the NCO District.\nAn NCO Neighborhood Character Overlay cannot be applied in combination with any of the following: HDO Historic District Overlay, HDO-S Streetside Historic District Overlay, and RIO Residential Infill Overlay.\nC. Eligibility\nA majority of properties in an NCO District shall share one or more of the following criteria, thereby creating a cohesive and distinctive setting, character, or association:\n\nConsistency in scale, proportion, and rhythm. This includes similarities in features such as lot width, building height, and front façade width, as well as the relationship of building massing and spacing as established by setbacks and placement of structures on the lot.\nSimilarity in existing streetscape characteristics or tree canopy.\nSimilarity in arrangement of on-site elements such as vehicle parking and accessory structures.\n\n\nIn addition to item 1 above, an NCO District shall meet the following standards:\n\nThe designated area shall be a minimum of 15 contiguous acres.\nWhere a lot is included in an NCO District, all lots on the same blockface shall be included.\nThe general pattern of development, including streets, lots, and buildings, for the proposed overlay district was established at least 25 years prior to the date of consideration of the NCO District designation.\nA minimum of 75% of the lots within the proposed NCO District are developed.\n\n\nD. Standards for NCO Districts\n\n\n\nResidential Development Standards: Single-Family, Duplex, and TriplexThe following standards may be included in an NCO District Neighborhood Character Plan. Where no standards are specified in the Neighborhood Character Plan, those of the underlying district apply.\n\nMinimum and/or maximum lot width or lot frontage\nMinimum and/or maximum setbacks\nMaximum height for principal and accessory buildings\nMaximum building coverage\nSurface parking (total square footage and location)\nTree planting/protection standards that exceed the requirements in Article 20.\n\n\nResidential Development Standards: All Other DwellingResidential dwellings allowed by the district outside of those in item 1 are exempt from NCO District standards and are subject to those of the underlying district.\nNonresidential Development StandardsNonresidential development allowed by the district are exempt from NCO District standards and are subject to those of the underlying district.\nUsesThe uses allowed in the underlying zoning district apply.\n\n\n\nE. Initiation of Neighborhood Character Plan\n\nEstablishment\n\nRequest to Initiate Neighborhood Character Plan ProcessA request may be initiated in one of the following ways:\n\nBy a petition provided to the Planning Department signed by property owner(s) representing at least 25% of the land area and at least 25% of the lots within the proposed district; or\nBy a majority vote of the City Council.\n\n\n\n\nDetermination of Eligibility\n\nIf the Planning Director determines that the area is eligible for designation as an NCO District, the applicant(s) will be notified of this decision and a public informational meeting will be scheduled. An appeal of the Planning Director’s decision is governed by Section 37.8.B of this Ordinance.\nIf, based on the criteria in item C above, the Planning Director determines the area is not eligible for an NCO District designation, the applicant(s) will be notified of this in writing, including stated reasons for the decision.\nIf demand for the NCO District results in multiple applications requesting initiation of the Neighborhood Character Plan process at a similar time are received, the Planning Director shall have the discretion to establish quantitative and/or locational criteria in order to prioritize those applications.\n\n\nPublic Information Meeting for EligibilityIf the area is determined to be eligible for an NCO District, the Planning Director shall schedule a public informational meeting for the purpose of informing property owners in the proposed district of the nature of the pending request. The Planning Director shall send notice of the date, time, and place of the meeting by mail to all property owners within the proposed district and adjacent property owners. After the meeting, the Planning Department shall initiate the preparation of a Neighborhood Character Plan.\nNeighborhood Character Plan (NCP)A Neighborhood Character Plan (NCP) shall be prepared by City staff with the assistance of representatives of the proposed district and include, at a minimum, the following information:\n\nStatement of purpose and intent.\nA map that indicates the boundaries of the proposed NCO District.\nA description of how the area developed.\nA description of the existing and common characteristics of the area as defined in item C.1 above.\nThe standards to be established for the proposed district as allowed by item D.1 above.\n\n\nPublic Information Meeting for Neighborhood Character PlanUpon completion of the proposed Neighborhood Character Plan, the Planning Director shall schedule a public meeting for the purpose of informing property owners in the proposed overlay district of the nature of any pending requirements. The Planning Director shall send notice as provided in item 3 above.\n\nF. Petition for NCO District Zoning Map Amendment\nInitiationA zoning map amendment for the NCO District may be initiated:\n\nBy a majority vote of City Council to initiate a zoning map amendment; or\nBy a petition provided to the Planning Department signed by property owner(s) representing at least 51% of the land area and at least 51% of the lots within the proposed district.\n\n\nZoning Map Amendment and NCP\n\nThe Planning Director will initiate the zoning map amendment upon the action required in item 1.a or 1.b above.\nAdoption of an NCO District requires an amendment to the Zoning Map and shall follow the process for a zoning map amendment in Section 37.2.\nAn NCP shall be approved by the City Council prior to approval of the zoning map amendment.\n\n\nAmendments to Adopted NCO DistrictsAny proposal to amend, modify, or dissolve any district boundaries in an adopted NCO District or the standards of a Neighborhood Character Plan is subject to the following.\n\nDistrict Boundary Amendments\n\nAny proposal to add lots to an adopted NCO District shall follow the same adoption procedures set forth in this section (items 1 through 7 above) except that a new NCP is not required. The original NCP for the district can be amended to incorporate the expansion concurrently with the zoning map amendment.\n Any proposal to subtract lots from an adopted NCO District shall follow the same adoption procedures set forth in this section (items 1 through 7 above) except that a new NCP is not required. The original NCP for the district can be amended to incorporate the subtraction concurrently with the zoning map amendment.\n\n\nNeighborhood Character Plan Amendments\n\nA new petition to amend an NCP shall be signed by property owner(s) representing at least 25% of the land area and at least 25% of the lots within the existing district, or by a majority vote of the City Council. Such petition shall include all specific proposed amendments to the development standards of the NCP.\nA public information meeting scheduled by the Planning Director for the purpose of informing property owners in the existing district of the nature of the pending request. The Planning Director shall send notice of the date, time, and place of the meeting by mail to all property owners within the proposed district and adjacent property owners.\nAn amended draft of the updated Neighborhood Character Plan shall be prepared in accordance with item E above.\nA petition, indicating support for the City to amend the Neighborhood Character Plan, shall be filed with the Planning Director. The petition to proceed shall be signed by property owner(s) representing at least 51% of the land area and at least 51% of the lots within the proposed district or by a majority vote of City Council.\nThe Planning Commission shall hold a public meeting to hear comments on the amended NCP and make a recommendation to be forwarded to the City Council. The City Council shall hold a public hearing to consider the amendment to the NCP and render a decision.\nThe amended Neighborhood Character Plan is effective upon Council\n\n\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-14-special-purpose-overlay-zoning-districts/#143-nco-neighborhood-character-overlay\"}"}, {"title": "14.4 RIO RESIDENTIAL INFILL OVERLAY", "text": "A. PurposeThe RIO Residential Infill Overlay District is intended to facilitate residential infill development in the Neighborhood 1 Zoning Districts that maintains and complements existing neighborhood pattern and scale through specific controls addressing height and dwelling unit size.B. ApplicabilityAn RIO District may be applied as follows:\nInitiation The RIO District may be initiated:\n\nBy a majority vote of City Council to initiate a zoning map amendment; or\nBy a petition provided to the Planning Department signed by 51% of property owners within the geographic area as defined in item 2.b below.\n\n\nLocation and Minimum District Area\n\nAn RIO may be applied as an overlay to the N1-A, N1-B, N1-C, N1-D, and N1-E Zoning Districts only.\nAn RIO District shall be applied to an area consisting of a minimum of 50 contiguous lots. Where a lot is included in an RIO District, all lots on the same block shall also be included, encompassing all blockfaces. Arterial fronting lots are not allowed within an RIO District and are exempt from this requirement.\nA RIO Residential Infill Overlay cannot be applied in combination with any of the following: HDO Historic District Overlay, HDO-S Streetside Historic District Overlay, and NCO Neighborhood Character Overlay.\n\n\nExemptions The standards of the RIO District do not apply to:\n\nNonresidential development.\n\n\nC. Standards\n\nDevelopment StandardsThe development standards of the underlying zoning district apply except for the following:\n\nFront Setback from StreetThe required front setback from the street for a residential building on a lot within the RIO District shall be the average of the two closest residential buildings on the same block face, but no less than 10 feet. A survey of the setbacks of the two closest residential buildings on the same blockface will be required at the time of permitting. ‍\nBuilding Height Setback Plane In addition to maximum building height requirement, all residential buildings on any lot within the RIO District shall meet the building height setback plane regulations below.\n\nAll residential buildings are limited to a sidewall height at the required minimum side setback of 20 feet or the average height of the residential building sidewalls on both sides of the lot, whichever is greater. Sidewalls shall be measured from the finished floor elevation of the main floor to the eave or, if no eave is present on the building, to the bottom of the finished roof plane. For a corner lot, the closest residential building on the same blockface and the residential building closest to such are used for averaging. If a sidewall height of greater than 20 feet is proposed, a height survey of the closest residential building sidewalls is required at the time of permitting.\nIf no residential buildings exist on the same blockface as a new residential building under development, the maximum building height for the zoning district controls.\nAdditional building height is granted at a ratio of one foot of additional side setback to one foot of height, establishing a building height setback plane at 45 degrees. Buildings may not exceed the maximum building heights of the district.\nDormers and gable ends may extend into and through the 45 degree building height setback plane but shall comply with the maximum building height.\n\n\n\n\n\n                                                                                       \nbuilding height setback plane\n\nMaximum Building SizeAll principal residential buildings on any lot within the RIO District are limited to a maximum building size, calculated as total heated square footage, as follows:\n\nThe total heated square footage of single-family dwellings on the subject blockface will beaveraged. The applicant will be required to furnish Mecklenburg County tax records documenting this average at the time of permitting.\nThe maximum size of a single-family, duplex, or triplex building will be the greater of the following:\n\nThe average single-family dwelling size based on total heated square footage; or\nThe number of residential units to be constructed multiplied by 800 square feet per unit.\n\n\nSingle-family dwellings are permitted to exceed the maximum dwelling unit size by an additional 25%.\n\n\n\n\nUsesThe uses allowed in the underlying zoning district apply. No uses allowed within the underlying district may be prohibited as part of the RIO District.\n\nD. Approval ProcessThe application of an RIO District shall follow the procedure for a zoning map", "metadataJson": "{\"section_url\": \"/articles/article-14-special-purpose-overlay-zoning-districts/#144-rio-residential-infill-overlay\"}"}, {"title": "14.5 CCO COTTAGE COURT OVERLAY DISTRICT", "text": "A. PurposeA cottage court residential development allows for small lot residential development in a manner that organizes various dwelling types around a common open space, designed as a cohesive whole and maintained in shared stewardship by residents.B. Applicability\nCottage court residential development is allowed in the N1-A, N1-B, N1-C, N1-D, and N1-E Zoning Districts.\nCottage court residential development may take one of two forms:\n\nA development may be designed with individual lots.\nA development may also be designed as a multi-dwelling development, subject to the use limitations in item C below.\n\n\nC. Use Limitations\nOnly single-family, duplex, and triplex dwellings are permitted in a cottage court residential development.\nAccessory dwelling units are prohibited within a cottage court development.\nD. Development Standards\n\n All standards of the base zoning district apply, with the following exceptions:\n\nThe minimum total lot area required for a cottage court is determined by calculating the cumulative lot area required by the base zoning district for the number of buildings to be constructed, and reducing the result by 50%.\nIndividual lots or building sites within the cottage court development are exempt from the base zoning district standards for lot area, lot width, setbacks, and building coverage. However, lot area, lot width, and setbacks apply to the cottage court development parcel.\n\n\n\n SETBACKS FOR A COTTAGE COURT PARCEL‍\nThe minimum and maximum number of units allowed, based on the calculation of item 1 above, are as follows:\n\nCottage court residential development may be used for any development of four or more buildings and requires a minimum of four detached structures.\nThe maximum number of buildings within a cottage court development is 30. When a development site contains multiple cottage court developments, the maximum number of buildings within the development site in total is 30.\n\n\n         MAXIMUM NUMBER OF BUILDINGS WITHIN A COTTAGE COURT\nAll buildings within the cottage court shall front on a street or a common open space. When a cottage court is developed as buildings on individual lots that front on a common open space, such frontage is considered to meet any requirement for frontage on a street. However, all applicable emergency access requirements must be met.\nCommon open space areas shall meet the following standards:\n\nThe minimum size of the common open space area is 3,000 square feet or 500 square feet per dwelling unit, whichever is greater.\nThe common open space area shall maintain a minimum width of 30 feet, shall be contiguous and centrally located, and shall front on a public or network-required private street.\nA maximum of 30% of the common open space area may be hardscape.  \n\n\nDwellings oriented toward the common open space area shall provide a five foot minimum setback from the common area. Such setback does not count toward any required common area.\nVehicular access and parking for a cottage court shall meet the following standards:\n\nRequired off-street parking may be provided on individual development sites for each dwelling within the cottage court or in a shared parking area serving multiple dwellings on-site. Common parking areas shall contain no more than ten spaces each and shall be screened from adjacent properties in a Neighborhood 1 Place Type per the standards of Article 20. Parking shall not be located between principal structures and the street, or within any required common area.\n\n\nE. Small Unit BonusCottage court developments may be eligible for a development bonus as follows if constructed with small dwelling units, as described in this section.\nEligibilityTo receive the small unit bonus, all residential dwelling units in the cottage court development, including any bonus residential buildings, shall meet the following standards:\n\nAll dwelling units within residential buildings shall be 800 square feet or less in gross floor area.\nAll residential buildings shall not exceed 24 feet in height.\n\n\nBonus\n\nThe number of residential buildings able to be developed as part of the overall cottage court residential development may be increased by 25%, not to exceed five bonus buildings.\nBonus residential buildings shall meet the development standards of the cottage court development as set forth in item D above.\nAny bonus residential buildings are not included in the calculation of minimum total lot area required for the overall cottage court development.\n\n\nF. Approval ProcessA CCO District will be approved as a zoning map amendment per Section 37.2.", "metadataJson": "{\"section_url\": \"/articles/article-14-special-purpose-overlay-zoning-districts/#145-cco-cottage-court-overlay-district\"}"}, {"title": "14.6 MHO MANUFACTURED HOME OVERLAY DISTRICT", "text": "A. PurposeThe purpose of the MHO Manufactured Home Overlay District is to provide for the development of manufactured housing in select Neighborhood 1 Zoning Districts. The intent of the MHO District standards is to ensure compatibility of manufactured housing with existing residential dwellings.B. Applicability\nThe MHO District can be applied over the following districts: N1-A, N1-B, N1-C, and N1-D Districts.\nA contiguous area of at least five acres in size is required for application of the overlay. This minimum area does not apply to expansions of an existing MHO District where such expansion is contiguous to the boundaries of an existing MHO District.\nC. Uses\nManufactured home dwellings are permitted in the MHO District, subject to the prescribed conditions of Article 15.\nAll uses permitted in the underlying district are permitted in the MHO District, subject to any required prescribed conditions of the underlying district.\n", "metadataJson": "{\"section_url\": \"/articles/article-14-special-purpose-overlay-zoning-districts/#146-mho-manufactured-home-overlay-district\"}"}, {"title": "14.7 MHP MANUFACTURED HOME PARK ZONING DISTRICT", "text": "A. PurposeThe MHP Manufactured Home Park Zoning District is intended to accommodate manufactured home parks.B. UsesArticle 15 lists permitted, temporary, and accessory uses for the MHP Zoning District.C. Manufactured Home Park Standards\nTable 14-1: Manufactured Home Park Dimensional Standards establishes the dimensional standards for manufactured home parks in the MHP Zoning District.\n\nAt least 10% of the total area of a manufactured housing park shall be devoted to recreational facilities for use by the residents of the park. Examples of such recreational facilities may include community buildings, gardens, outdoor play areas, swimming pools, and ball courts.\nA manufactured home park shall construct internal access drives of 20 feet or greater in width. Internal access drives and circulation patterns shall be adequate to handle the traffic to be generated by the development.\nD. Manufactured Home Stand Standards\nTable 14-2: Manufactured Home Stand Dimensional Standards establishes the dimensional standards for manufactured home stands in the MHP District.\n\nOnly one manufactured home is permitted per stand.\nAll manufactured home stands shall front upon an internal access drive.\nA sidewalk is required connecting either the driveway or a detached garage or carport, to a door or attached porch of the home.\nE. Manufactured Home Standards\nThe area beneath a home shall be fully enclosed with durable skirting within 60 days of placement in the park or subdivision. As a minimum, such skirting shall be a product designed and sold for use as skirting or as approved by the Zoning Administrator.\nThe manufactured home shall have all wheels, axles, transporting lights, and towing apparatus removed.\nThe manufactured home shall be at least 12 feet in width along the majority of its length.\n", "metadataJson": "{\"section_url\": \"/articles/article-14-special-purpose-overlay-zoning-districts/#147-mhp-manufactured-home-park-zoning-district\"}"}, {"title": "14.8 ANDO AIRPORT NOISE DISCLOSURE OVERLAY DISTRICT", "text": "A. PurposeThe purpose of the ANDO Airport Noise Disclosure Overlay District (ANDO District) is to provide mechanisms for the disclosure to residential property owners in the Charlotte Douglas International Airport environs that the use and enjoyment of property located within the ANDO District is subject to over flights and noise consistent with airport operations.B. Required Disclosure Notice\nAn ANDO District Notice is required for all residential development and mixed-use development with a residential component that is wholly or partially located within the boundaries of the ANDO District.\nAll plats and site plans for residential development or mixed-use development that includes residential uses, submitted to the City for review and approval, shall include the ANDO District Notice.\nThe content of this notice is as follows: Airport Noise Disclosure Overlay District Notice: “Noise Warning -This property, either partially or wholly, is zoned Airport Noise Disclosure Overlay District and lies within or near the noise exposure map areas of Charlotte Douglas International Airport and may be subject to noise that may be objectionable.”\n‍", "metadataJson": "{\"section_url\": \"/articles/article-14-special-purpose-overlay-zoning-districts/#148-ando-airport-noise-disclosure-overlay-district\"}"}]}