{"title": "Article 26. Surface Water Improvement, & Management (SWIM) Buffers", "metadataJson": "{\"base_url\": \"article-26-surface-water-improvement-management-swim-buffers\"}", "section": [{"title": "26.1 PURPOSE", "text": "The purpose of the Surface Water Improvement and Management (SWIM) stream buffer network regulations are to ensure that streams draining 100 or more acres and adjacent lands fulfill their natural functions. Stream systems are comprised of the stream and their drainage basins. Streams have the primary natural functions of conveying stormwater and groundwater to downstream drinking water supplies, storing floodwater, and supporting aquatic and other life. Vegetated lands adjacent to the stream in the drainage basin serve as a buffer to protect the stream system’s ability to fulfill its natural functions. Primary natural functions of the buffer are to:A. Protect water quality by filtering pollutants.B. Provide storage for floodwaters.C. Allow streams to meander naturally.D. Provide suitable habitats for wildlife.", "metadataJson": "{\"section_url\": \"/articles/article-26-surface-water-improvement-management-swim-buffers/#261-purpose\"}"}, {"title": "26.2 APPLICABILITY", "text": "A. All properties on lots recorded after November 15, 1999, shall be subject to the requirements of this article, subject to the following categories:\nLots that have been subdivided by a recorded subdivision plat approved by the City.\nLots that have been described by metes and bounds in a recorded deed or shown on a recorded plat, which:\n\nAre residential and one acre or less in size.\nAre nonresidential, including mixed-use, and:\n\nFour acres or less in size if located on a non-FEMA regulated floodway.\nSeven acres or less in size if located on a FEMA regulated floodway.\n\n\n\n\nB. Properties on lots recorded prior to November 15, 1999 shall meet the requirements of this article if redevelopment or expansions to existing structures result in an increase in built-upon area in the SWIM stream buffer.C. The definitions of Section 26.10 only apply to this article. Unless specifically defined in Section 26.10, other words or phrases used in this article are as defined in Article 2 for general definitions or Article 15 for use definitions. In the case of a conflict between a term defined in Article 2 or Article 15 and this article, the definition in Section 26.10 controls.", "metadataJson": "{\"section_url\": \"/articles/article-26-surface-water-improvement-management-swim-buffers/#262-applicability\"}"}, {"title": "26.3 SWIM WATER QUALITY BUFFER STANDARDS", "text": "This article maintains standards for buffers along streams and waterways to fulfill the purposes of this article. Required SWIM stream buffer widths are based on the size of the upstream drainage basin. Charlotte-Mecklenburg Storm Water Services shall make all necessary determinations regarding applicability of SWIM stream buffer requirements, which are generally depicted by the SWIM Stream Buffer Map. The SWIM Stream Buffer Map maintained by Charlotte-Mecklenburg Stormwater Services shall generally depict which streams are subject to buffer requirements and the related buffer widths. SWIM stream buffer requirements begin at the point where the stream drains 100 acres or greater subject to review by field survey on a site-by-site basis.A. Water Quality Buffer Widths for Streams Draining Equal to and Greater than 100 Acres\nSWIM stream buffers are required for streams draining areas equal to or greater than 100 acres. SWIM stream buffers are comprised of up to three zones: the stream side zone, managed use zone, and upland zone. Table 26-1: SWIM Water Quality Buffer Width for Streams Draining Equal to and Greater than 100 Acres, provides the total buffer widths and width for each zone, based on the drainage area size. SWIM stream buffer widths for these streams are measured horizontally on a line perpendicular to the surface water, landward from the top of the bank on each side of the stream.\n\n1 Additional buffer standards for drainage areas of ≥ 640 acres:\n\nThe FEMA Flood Fringe Line and Community Encroachment Line, per Article 27, are used for floodplain and buffer calculations.\nIf the floodplain, per Article 27, is less than 100 feet wide, the total width of the buffer on that side of the stream shall be 100 feet except as provided in item d below.\nThe additional buffer area beyond 100 feet shall be parallel to and contiguous with the required 100 foot buffer and be configured in such a manner as to benefit surface water quality.\nSo long as the total buffer width is maintained, the buffer may vary in width on either side of the stream based on individual stream side topography provided the owner(s) control both sides of the stream and the stream side zone is maintained on both sides of the stream.\nBuffer requirements within this section do not apply to the main channel of the Catawba River including Lake Norman, Mountain Island Lake, and Lake Wylie.\n\n2 Calculation of the additional 50% area requirement is based on the area between the FEMA Flood Fringe Line and the 100 foot SWIM Water Quality Buffer or to the Community Encroachment Line (0.1’), whichever is less.\nCALCULATION OF ADDITIONAL 50% AREASTREAM SIDE ZONE, MANAGED USE ZONE, AND UPLAND ZONE ILLUSTRATIONB. Buffer DescriptionBuffer function, vegetative targets, and allowed impacts vary according to the different buffer zones as described in Table 26-2: SWIM Stream Buffer Descriptions.1 When vegetative targets cannot be met, mitigation of disturbed buffers is required as specified in the Charlotte-Mecklenburg Water Quality Buffer Implementation Guidelines when such disturbances result in the failure of the buffer system to comply with the vegetative targets specified.2 Fill material cannot be brought into the buffer unless explicitly exempted. Grading is allowed only in the upland zone. Structures not explicitly exempted above are not allowed in the SWIM stream buffer. Permitted impacts within the buffer zones should be coordinated to ensure minimal disturbance of the buffer system. For example, if it is necessary to install utilities within the buffer, greenway trails should be constructed to follow the cleared areas to the maximum extent practicable.C. Diffuse Flow RequirementDiffuse flow of runoff shall be maintained in the buffer by dispersing concentrated flow and reestablishing vegetation.\nConcentrated runoff from ditches or other manmade conveyances shall be converted to diffuse flow before the runoff enters the buffer.\nPeriodic corrective action to restore diffuse flow shall be taken by the property owner as necessary to prevent the formation of erosion gullies.\nD. PondsPonds, that intersect a stream, shall have the same buffers as the original stream measured from the top of the bank of the pond. Buffer requirements shall not apply to wet ponds used as Stormwater Control Measures (SCMs). Buffers shall only apply to ponds when the upstream and downstream stream are considered intermittent or perennial.E. Additional SWIM Buffer StandardsThe following may be located within SWIM water quality buffers when they meet the minimum requirements of this article and the articles listed below:\nRequired open space per Article 16.\nLandscape yard per Article 20.\nAmenitized tree areas per Article 20.\nTree save per Article 20.\nInternal trees per Article 20.\nPerimeter trees per Article 20.\nWater supply water quality buffer per Article 23.\nPost-construction water quality buffer per Article 25.\nFloodplain per Article 27.\nAreas for greenways or parks per Article 32 offered for dedication and accepted by Mecklenburg County Park and Recreation.\n", "metadataJson": "{\"section_url\": \"/articles/article-26-surface-water-improvement-management-swim-buffers/#263-swim-water-quality-buffer-standards\"}"}, {"title": "26.4 REQUIRED BUFFER DELINEATION", "text": "The following buffer delineations shall apply:A. Streams and buffer boundaries, including all buffer zones, shall be clearly delineated on all construction plans, including grading and clearing plans, erosion, drainage and sediment control plans, and site plans.B. Outside buffer boundaries shall be clearly marked on-site prior to any land-disturbing activities.C. Streams and buffer boundaries, including the delineation of each buffer zone, shall be specified on all surveys and record plats.D. Buffer requirements shall be referenced in homeowners association documents.", "metadataJson": "{\"section_url\": \"/articles/article-26-surface-water-improvement-management-swim-buffers/#264-required-buffer-delineation\"}"}, {"title": "26.5 MITIGATION", "text": "A. PurposeThe purpose of this section is to set forth the basis on which mitigation is required for unavoidable or approved buffer impacts within any of the buffer zones unless otherwise exempted below. This mitigation basis shall allow the property owner or other entity the opportunity to disturb a buffer, provided steps are taken to offset the buffer loss. Prior to any buffer impact, any person or entity seeking approval of a buffer impact shall submit the requisite site and mitigation information for approval to Charlotte-Mecklenburg Storm Water Services as specified below, to the extent approval is required by this article.B. Buffer Impacts Not Requiring MitigationThe following buffer impacts do not require mitigation or specific plan approval but are required to comply with the City’s requirements, which may be satisfied using designs contained in the current edition of the Charlotte Land Development Standards Manual (CLDSM) and the Charlotte-Mecklenburg Storm Water Services Design Manual for stabilization of disturbed areas to minimize negative water quality impacts.\nRequired transportation crossings for connectivity.\nUtility crossings.\nParallel water and sewer utility installation as approved by Charlotte Water.\nPublic paths and trails parallel to the stream outside the stream side zone and stream crossings. Pathways shall use existing and proposed utility alignments or previously cleared areas and minimize tree cutting to the maximum extent practicable. Pathways shall preserve existing drainage patterns and avoid drainage structures that concentrate stormwater to the maximum extent practicable.\nIncidental drainage improvements/repairs for maintenance.\nIndividual pedestrian paths connecting homeowners to the stream in the form of narrow, pervious footpaths with minimal tree disturbance.\nNew domesticated animal trails for farming where existing trails are lost as a result of action beyond the farmer’s control. Stream crossings should be constructed and maintained to minimize impacts to the stream side zone with fencing perpendicular and through the buffer to direct animal movement.\nMitigation approved by a federal or state agency acting pursuant to Sections 401 or 404 of the Federal Clean Water Act.\nFlood control structures.\nFences that comply with floodplain regulations (Article 27) and do not require tree removal.\nC. Buffer Impacts Requiring MitigationImpacts to stream buffers not specified in item B above, proposing to allow development or other land use in a buffer, shall be required to mitigate or offset the proposed impact in accordance with this section. Buffer impacts requiring mitigation and plan approval include, but are not limited to:\nFilling or piping of streams, regardless of 401 or 404 permitting issued by US Army Corps of Engineers (USACE) or NC Department of Environmental Quality (NCDEQ).\nClearing of land and/or removal of vegetation from the stream side or managed use zones other than as specified by Table 26-2 per the Vegetative Targets of the table.\nPaths proposed within the stream side zone.\nStream relocations.\nFences and walls requiring tree removal in the stream side or managed use zones.\nOther buffer impacts not permitted under item B above.\nThe landowner or other entity proposing any of the impacts specified above shall prepare and submit for approval a site-specific plan to Charlotte-Mecklenburg Storm Water Services. This site plan shall show the extent of the proposed impact and clearly specify the proposed mitigation technique.‍D. Pre-Approved Mitigation TechniquesThe following techniques are available to property owners for mitigation of buffer impacts upon review and approval of a site-specific mitigation plan by Charlotte-Mecklenburg Storm Water Services. Specifications for these preapproved mitigation techniques are provided in the Charlotte-Mecklenburg Water Quality Buffer Implementation Guidelines.\nInstallation of Stormwater Control Measures (SCMs)If not required by another city ordinance or article of this Ordinance, the installation of an on-site SCM designed to achieve specified pollutant removal targets will allow for stream buffer impacts on the specific site. The SCM should remain outside the stream side zone to the maximum extent practicable. A detailed SCM design plan shall be submitted to Charlotte-Mecklenburg Storm Water Services for approval based on specifications and pollutant removal targets contained in the Charlotte-Mecklenburg Stormwater Control Measure Design Manual (SCM Design Manual). This plan shall also include a long-term maintenance strategy for the SCM complete with the establishment of adequate financing to support the proposed maintenance practices.\nStream Buffer RestorationThe owner may restore and preserve the buffer area on any stream of equivalent or greater drainage area, the condition of which is determined to be qualified for restoration by Charlotte-Mecklenburg Storm Water Services. This restored buffer area shall be equal or greater in size than the buffer area to be mitigated.\nStream Buffer PreservationThe owner may purchase, fee simple, other stream segments at equivalent or greater drainage area on a 1:1 linear foot basis and convey fee simple and absolute title to the land to the City of Charlotte, Mecklenburg County, or other conservation organization. Staff may consider other means for preserving these areas on a case-by-case basis.\nWetlands PreservationOn a 2:1 acreage basis for disturbed buffer area (two acres of wetland for each acre of disturbed buffer area), the owner may provide a combination of the preservation and/or restoration of wetlands with protective easements.\nMitigation CreditsThe purchase of mitigation credits on a 1:1 basis utilizing area of buffer impacted and the prevailing rate of purchase as established by Charlotte-Mecklenburg Storm Water Services shall allow for stream buffer impacts on the specific site. Mitigation credits purchased under any other program (i.e., USACE) shall not cover this requirement unless the issuing agency agrees to relinquish the funds to Charlotte-Mecklenburg Storm Water Services.\nE. Other Mitigation TechniquesNo provision of this article shall prevent the creative development of alternative mitigation plans. The owner shall submit such plan with proposed buffer impacts and detailed mitigation information to Charlotte-Mecklenburg Storm Water Services for approval. The criteria used to judge the acceptability of any alternative plan shall be the degree to which the plan addresses the preservation of the four primary natural functions of stream buffers as per Section 26.1. Such plans may be submitted in conjunction with a mitigation plan submission to the USACE and NCDEQ for proposed stream or wetland impacts.F. Posting of Financial Security Required for Stormwater Control Measures (SCMs)When SCMs are approved for mitigation of a buffer disturbance, the approval shall be subject to the owner filing a surety bond or letter of credit or making other financial arrangements which are acceptable to Charlotte-Mecklenburg Storm Water Services, in a form which is satisfactory to the City Attorney, guaranteeing the installation and maintenance of the required SCMs until the issuance of certificates of occupancy for 75% of all construction which might reasonably be anticipated to be built within the area which drains into the SCMs, allowing credit for improvements completed prior to the submission of the final plat.At such time that this level of occupancy is achieved, written notice thereof shall be given by the owner to Charlotte- Mecklenburg Storm Water Services. The owner shall also verify the adequacy of the maintenance plan for the SCMs including the necessary financing to support the proposed maintenance practices. Charlotte-Mecklenburg Storm Water Services will inspect the SCMs and verify the effectiveness of the maintenance plan and if found satisfactory, will notify the owner in writing within 30 days of the date of the notice.", "metadataJson": "{\"section_url\": \"/articles/article-26-surface-water-improvement-management-swim-buffers/#265-mitigation\"}"}, {"title": "26.6 MAINTENANCE RESPONSIBILITY FOR SCMs", "text": "Maintenance of all SCMs shall be the responsibility of the property owner or their designee.", "metadataJson": "{\"section_url\": \"/articles/article-26-surface-water-improvement-management-swim-buffers/#266-maintenance-responsibility-for-scms\"}"}, {"title": "26.7 ADMINISTRATION", "text": "A. Appeals and variances of this article shall be subject to Article 37.B. Inspections and enforcement actions of this article shall be subject to Article 39.", "metadataJson": "{\"section_url\": \"/articles/article-26-surface-water-improvement-management-swim-buffers/#267-administration\"}"}, {"title": "26.8 STORMWATER ADMINISTRATOR", "text": "A. DesignationThe Director of the City of Charlotte department responsible for management of the City’s NPDES MS4 Stormwater permit has been designated as the Stormwater Administrator. The Stormwater Administrator is authorized to administer and enforce Article 26.B. Powers and DutiesIn addition to the powers and duties that may be conferred by other provisions of this Ordinance and other laws, the Stormwater Administrator shall have the following powers and duties under this article:\nTo review and approve or disapprove applications submitted pursuant to Article 26.\nTo make determinations and render interpretations of Article 26.\nTo establish application requirements and schedules for submittal and review of applications and appeals.\nTo enforce Article 26 in accordance with its enforcement provisions.\nTo maintain records, maps, and official materials as they relate to the adoption, amendment, enforcement, or administration of Article 26.\nTo provide expertise and technical assistance upon request to the City Council and the Stormwater Advisory Committee (SWAC).\nTo designate appropriate other person(s) who shall carry out the powers and duties of the Stormwater Administrator.\nTo provide information and recommendations relative to variances and information as requested by the UDO Board of Adjustment in response to appeals.\nTo prepare and make available to the public a Stormwater Regulations Administrative Manual that includes the Stormwater Management Permit application, submittal checklist, fee schedule, maintenance agreements, and references to the Charlotte-Mecklenburg Storm Water Services Design Manual and the SCM Design Manual.\nTo take any other action necessary to administer the provisions of Article 26.\n", "metadataJson": "{\"section_url\": \"/articles/article-26-surface-water-improvement-management-swim-buffers/#268-stormwater-administrator\"}"}, {"title": "26.9 DEFINITIONS", "text": "The definitions below only apply to this article. Unless specifically defined in this section, other words or phrases used in this article are as defined in Article 2 for general definitions or Article 15 for use definitions. In the case of a conflict between a term defined in Article 2 or Article 15 and this article, the definition in this section controls.Development. Land-disturbing activity that creates built-upon area or that otherwise decreases the infiltration of precipitation into the soil.Redevelopment. Any land-disturbing activity that does not result in a net increase in built-upon area and that provides greater or equal stormwater control than the previous development.‍", "metadataJson": "{\"section_url\": \"/articles/article-26-surface-water-improvement-management-swim-buffers/#269-definitions\"}"}]}