{"title": "Article 31. Network, Cross-Access, & Driveway Regulations", "metadataJson": "{\"base_url\": \"article-31-network-cross-access-driveway-regulations\"}", "section": [{"title": "31.1 BLOCK AND NETWORK DESIGN STANDARDS", "text": "This section contains specifications for street networks, external connectivity, internal connectivity, block length, cross-access, and driveway and street access.A. Street Network\nA network of interconnected public streets providing both external and internal connectivity is required for new development. The Subdivision, Streets, and Infrastructure Administrator (SSI Administrator), in consultation with the Charlotte Department of Transportation (CDOT), may allow network-required private streets for external and/or internal connectivity in consideration of the conditions below. Any such network-required private street shall have a recorded public access easement.\n\nSite conditions require street geometry not allowed for a public street.\nA public street is not needed to enhance the existing public street network.\nThe proposed street does not stub into an adjacent property.\nThe proposed street does not connect to an existing street on an adjacent property.\nA Charlotte Water line that connects to an adjacent property is not located or proposed to be located within the street right-of-way.\n\n\nCemeteries, places of worship, and educational facilities are exempt from the street network requirements. However, if any of these uses are part of a mixed-use development, this exemption shall not apply.\nB. External Connectivity1. Existing Street Stubs\nExisting adjacent street stubs shall be extended into the development on the stub street’s proper projection.\nAny existing and abutting paper street stubs shall be extended into the development on the stub street’s proper projection.\n2. Block LengthRequirements for additional new collector and local streets shall be determined as follows, using the preferred block length for the applicable Place Type.\nThe following process shall determine the required number of blocks along the boundary of the development:Step 1. Identify the applicable Place Type in Table 31-1: Preferred Block Length.Step 2. Measure the length of each property boundary and for each measurement divide by the preferred block length spacing from Table 31-1.\nPROPERTY LINE LENGTH\n*_* Step 3. When a fractional number results, round the result down to the nearest whole number.\n*_* Step 4. When the result is less than two, but the boundary exceeds the maximum block length (Table 31-2: Maximum Block Length), one local street is required.\n\nWhere an odd-shaped parcel has a series of property line lengths shorter than the preferred block length, but separate blocks would be required if the site was measured across (as opposed to along the boundary segments), then a new street or streets shall be required.\nWhere the extension of non-local and adjacent local streets creates a street network that meets the required number of blocks, no additional new streets are required. However, if the distance from a parcel boundary to the nearest adjacent street exceeds the maximum block length in Table 31-2, then a new street or streets shall be required unless the SSI Administrator determines that a new street or streets are infeasible due to factors such as significant topographical constraints, unusual site-specific conditions related to the land, significant utility constraints, design of the existing street network, and location of existing driveways.\nNew collector and local streets, if required, shall be located to create the blocks calculated in this section, including any required street stubs.\n\nAlign where possible, with existing streets or existing driveways to create four-way intersections.\nAll new development should provide for more than one access for ingress and egress at the time of development, if feasible.\nNew street stubs shall be public and shall not be required to stub to existing lots if the SSI Administrator, in consultation with CDOT, determines that the size or shape of the lot makes a future street extension infeasible and/or of little functional value.\n\n\nThe average block length, when measured from centerline to centerline, for an entire site shall not exceed the maximum block length in Table 31-2. No individual block length created by the addition of a new street, except in the Parks and Preserves or Manufacturing and Logistics Place Types, shall exceed 1,000 feet. In the Parks and Preserves Place Type, no individual block length shall exceed 1,500 feet. In the Manufacturing and Logistics Place Type no individual block length shall exceed 2,000 feet.\nC. Internal Connectivity\nOnce the external connectivity has been established, the external streets shall be connected to create an internal network.\nThe average block length, when measured from centerline to centerline, for an entire site shall not exceed the maximum block length in Table 31-2. No individual block length, except in the Parks and Preserves or Manufacturing and Logistics Place Types, shall exceed 1,000 feet. In the Parks and Preserves Place Type, no individual block length shall exceed 1,500 feet. In the Manufacturing and Logistics Place Type no individual block length shall exceed 2,000 feet. Exceptions to the maximum individual block length may be allowed as noted in item D below.\nThe average block length for an entire site, measured from street centerline to street centerline, shall not exceed the maximum block length shown in Table 31-2: Maximum Block Length.\n\nThe following streets are not included in the calculation for average block length:\n\nCul-de-sac streets.\nStreet stubs.\nStreets whose length is determined by the depth of an individual or back-to-back residential lots.\n\n\n\n\nExceptions to the maximum individual block length may be allowed as noted in Item D below. When an exception for the maximum individual block length has been granted in the Parks and Preserves Place Type, the length of the block will be included in the block averaging calculation based on its length or 1,500 feet, whichever is smaller. When an exception for the maximum individual block length has been granted in the Manufacturing and Logistics Place Type, the length of the block will be included in the block averaging calculation based on its length or 2,000 feet, whichever is smaller. For all other Place Types, when an exception has been granted for the maximum individual block length, the length of the block will be included in the block averaging calculation based on its length or 1,000 feet, whichever is less.\nSTREETS ELIGIBLE FOR BLOCK AVERAGING CALCULATIOND. Exceptions to Block Lengths\nThe SSI Administrator, in consultation with CDOT, may modify the maximum individual block length, eliminating the need for a street stub or paper street when any of the following conditions exist:\n\nA man-made physical barrier to a connection exists, such as a freeway, railroad line, rapid transit line, or gas pipeline.\nA natural physical barrier exists, such as areas of steep slopes, wetlands, floodplain, creeks, or streams.\nAn industrial use is located adjacent to a proposed residential property, allowing future traffic to said industrial use to traverse the residential property to reach a non-local street.\nThe shape of the property does not allow the requirements to be met.\nThere are right-of-way, sight distance, or access constraints to providing the recommended spacing.\nAccessibility to the subject property or an adjacent property requires modification of the spacing requirements.\nManufacturing, distribution, warehousing, industrial, or security functions do not allow the spacing requirements to be met. Block lengths in the Manufacturing and Logistics Place Type may extend beyond a 2,000 feet individual block length to accommodate for the design of buildings exceeding that length.\nIt is advantageous to the street network to align a new street with an existing street, major driveway, or traffic signal.\n\n\nPublic parks may, in lieu of providing new streets, provide off-street public paths. This exception does not apply for new arterials and limited access streets indicated on the City of Charlotte Streets Map.\nE. Block WidthsBlock widths shall be sufficient to allow two tiers of lots except where a single tier of lots will facilitate nonresidential development, the separation of nonresidential and residential developments, or the separation of residential development from arterials.‍BLOCK WIDTHSF. Street OffsetsWhere there is an offset in the alignment of a street across an intersection, the offset of the centerlines shall conform to the standards of the Charlotte Land Development Standards Manual (CLDSM). The SSI Administrator, in consultation with CDOT, may modify this requirement based on analysis of safety and operational conditions.G. Cul-De-Sacs and Dead-End Streets\nCul-de-sacs and other permanent dead-ends on public or network-required private streets are subject to SSI Administrator approval and shall only be allowed when supporting documentation shows either:\n\nA natural or man-made barrier, such as a waterway, railroad, any portion of a Rapid Transit Corridor alignment that has been adopted by the Metropolitan Transit Commission (MTC), limited-access expressway, or unusual topography exists which prevents connection; or\nWhen a connection is infeasible due to the site design or land use of abutting property.\n\n\nCul-de-sacs shall not be longer than the preferred street spacing in Table 31-1.\nA pedestrian and bicycle connection through a cul-de-sac shall be required in the following instances:\n\nWhen a vehicular connection is impractical, or when environmental conditions make a vehicular connection impractical; or\nWhen a new pedestrian and bicycle connection through a cul-de-sac would connect to an existing pedestrian and bicycle pathway.\nThe requirement for a pedestrian and bicycle connection through a cul-de-sac, and the associated standards in Section 33.4.C, may be modified or eliminated if the developer/owner can document, and it can be confirmed by the Planning Department in consultation with CDOT, that there are significant topographical or unusual conditions related to the land.\n\n\nNo cul-de-sacs are permitted for properties that are within a ½ mile walk of an existing rapid transit station and zoned IMU, NC, CAC-1, CAC-2, RAC, TOD-TR, TOD-NC, TOD-CC, or TOD-UC. In addition, no cul-de-sacs are permitted for any property zoned UC or UE.\nPermanent dead-end streets shall provide for vehicular turn-around mobility consistent with CLDSM standards.\nH. Partial StreetsOn a lot that abuts an existing partial street with new construction of a principal building, the project shall construct the remainder of the partial street. New partial streets shall meet the standards of Tables 34-2 and 34-4.I. Traffic CalmingWherever a street exceeds the maximum block length provided in Table 31-2, the following conditions shall apply:\nFor residential wide or office/commercial wide, provide at least one pair of midblock curb extensions, as described in the CLDSM, or another approved slow point.\nFor all other street types, the developer shall consult with the SSI Administrator about the possible use of other traffic calming devices as available in the CLDSM, or as approved by the CDOT Director.\nFor traffic calming desired on streets not exceeding the maximum block length the developer shall receive approval from the SSI Administrator, in consultation with CDOT, for use of traffic calming devices as available in the CLDSM, or as approved by the CDOT Director.", "metadataJson": "{\"section_url\": \"/articles/article-31-network-cross-access-driveway-regulations/#311-block-and-network-design-standards\"}"}, {"title": "31.2 CROSS-ACCESS", "text": "A. Purpose and Intent\nCross-access provides direct access between adjacent parcels in order to improve connectivity so that motorists and/or pedestrians do not need to reenter arterial streets in order to gain access to an adjacent site, or to provide safer multi-modal mobility, as determined by the CDOT Director.\nCross-access between adjacent properties reduces vehicular conflicts between motorists on public streets and motorists entering and leaving driveways. Reduced traffic conflicts result in fewer accidents and improved traffic flow on the public streets. The intent of this section is to provide for cross-access between adjacent parcels in order to reduce the number of vehicular trips from arterial streets and improve multi-modal mobility, thereby improving safety for all modes.\nB. Parcels Requiring Cross-Access\nAbutting parcels which each front on an arterial street shall provide cross-access between the parcels when the following conditions occur:\n\nSubdivision as defined by Section 30.3.A; or\nConstruction of a new principal structure.\n\n\nWhen a parcel fronting either a collector or a local street abuts a corner lot which has frontages on both the collector or local street and an arterial street, both parcels shall provide cross-access to each other when either actions listed in items B.1.a or B.1.b above occur.\nIf an abutting parcel is undeveloped or does not currently have cross-access, a cross-access stub connection shall be constructed in order to provide for a future cross-access connection.\nCross-access requirements, and the associated standards found in Section 33.5, may be modified or eliminated by the CDOT Director when it is determined that:\n\nA significant obstruction exists due to a significant natural feature or existing infrastructure; or\nSignificant topographical differences between abutting parcels prevents potential cross-access connections; or\nExisting site conditions make cross-access infeasible and/or present other safety and security factors that give little functional value to cross-access; or\nAll on-site parking is located within a parking structure and all vehicular access leads directly to the parking structure; or\nAs provided in Section 32.2.A, the required cross-access is not related to the proposed development’s anticipated transportation impacts or is not roughly proportional to those anticipated impacts.\n\n\nC. ExceptionsThe following are excepted from cross-access requirements:\nResidential development on properties in the N1-A, N1-B, N1-C, N1-D, or N1-E Zoning Districts.\nDevelopment activities in the Parks and Preserves Place Type, the Manufacturing and Logistics Place Type, the Regional Activity Center Place Type located within the I-277 loop, and the TOD-CC, TOD-NC, and TOD-UC Zoning Districts.\nConnections between sites in the Manufacturing and Logistics Place Type and sites in the Neighborhood 1 Place Type or Neighborhood 2 Place Type.\nD. Easements\nA cross-access easement shall be recorded on the final plat for property involving a subdivision or recorded by separate instrument when no plat is proposed.\nProperty owners subject to cross-access requirements are responsible for maintaining safe and useable cross-access conditions for pedestrians and vehicles on their site.\nCross-access connections shall not be blocked or obstructed in such a way as to prevent intended pedestrian and vehicular traffic during agreed upon times of access.\nApplicants are not required to seek cooperation or permission from the adjacent property owner(s).\n", "metadataJson": "{\"section_url\": \"/articles/article-31-network-cross-access-driveway-regulations/#312-cross-access\"}"}, {"title": "31.3 DRIVEWAYS AND STREET ACCESS", "text": "A. Plan Approval Required\nNo driveway to a public street or network-required private street shall be constructed, relocated, or altered without a plan approval by CDOT. Access to a North Carolina Department of Transportation (NCDOT) maintained street or roadway shall also require an NCDOT Driveway Permit. Single-family uses are exempt from obtaining a driveway plan approval but shall comply with the Charlotte Streets Manual (Streets Manual) and CLDSM and item B.1.c. below.\nAll driveway design, placement, and construction shall comply with the Streets Manual and CLDSM.\nDriveway plan approval shall be required for existing driveways when any of the below actions occur. Any approved driveway plan may also require associated improvements to the driveway itself, the site, and/or roadways.\n\nSubdivision as defined per Section 30.3.A; or\nConstruction of a new principal structure; or\nChange of use for a structure of 5,000 square feet or more in gross floor area or change of use that creates more than 20 additional daily trips; or\nExpansion of an existing building by 1,000 square feet; or\nChanges to on-site parking layout or on-site circulation.\n\n\nB. Access Management\nDriveway Location and Placement\n\nAn approved driveway location and access shall be determined based upon the Streets Manual.\nDriveways shall be in a location with limited negative impact on the traffic flow and operations of the street.\nDriveways shall be in a location that does not conflict with or negatively impact the storm drainage system. If other standards require driveway placement in a location such that the storm drainage system would be negatively impacted, the developer is responsible for making alterations to the storm drainage system to mitigate or eliminate the impact. See Section 24.3.A.2 for additional drainage requirements.\nDriveways near an un-signalized intersection shall be located a minimum of 75 feet from the intersection. CDOT may reduce this requirement based on analysis of safety and operational conditions of the intersection.\nDriveways near a signalized intersection shall be located a minimum of 200 feet from the intersection. If the property frontage is less than 200 feet, CDOT may reduce this requirement based on analysis of safety and operational conditions of the intersection.\nCDOT may require existing driveway(s) to be relocated or closed in conjunction with any of the activities pursuant to item A.3 above. Required new curb, amenity zone/planting strip, and/or sidewalk/shared-use path shall be provided where the driveway(s) was previously located. Where sidewalk is added and new or relocated sidewalk is not required along an entire frontage, per Article 32, sidewalk shall be located according to the standards of Article 33 or shall match the adjacent sidewalk along the parcel frontage.\nAn existing curb cut may be relocated to a new location approved by CDOT if the existing curb cut is eliminated, new curb is constructed, and an amenity zone/planting strip and sidewalk/shared-use path is provided where the driveway was previously located.\nA new driveway is prohibited for an existing development that already has access to a street from an existing driveway, unless CDOT determines there is a significant operational or circulation issue.\n\n\n Access Restrictions\n\nPlan approval may include imposing driveway access restrictions that limit vehicular movements to less than full-movement in order to provide safe and efficient street operations.\nDriveway access shall be limited to less than full movement under any of the following conditions:\n\nThe proposed access location is within 200 feet of a signalized intersection.\nThe proposed access location is within the physical limits of existing or future single or dual left-turn lanes.\nThe proposed access is near an intersection or street section where a safety and/or street operations problem exists.\nThe proposed access does not meet sight distance requirements of item D below.\nOther circumstances where full movement at the proposed access location will negatively impact safe and efficient street operations, as determined by CDOT.\n\n\nCDOT may reduce access restrictions based on analysis of safety and operational conditions.\n\n\nC. Driveway Alignment and Internal Access\nChannelization and design of internal access shall comply with the Streets Manual.\nThe angle of a driveway intersection with the public or network-required private street shall be 90 degrees. A reduced angle of no less than 75 degrees may be approved by CDOT if any of the following conditions exist:\n\nTopographical challenges.\nNatural features.\nExisting right-of-way constraints.\nExisting building(s) to remain.\n\n\nNew driveways shall align with existing streets and existing driveways where possible to create four-way intersections.\nD. Sight Distance\nGeneral\n\nAll driveways shall provide sight distance as described in the Streets Manual.\nAll driveways shall meet American Association of State Highway and Transportation Officials (AASHTO) Intersection Sight Distance Requirements.\n\n\nRequired Sight Triangles at Public Street IntersectionsThe standards below regulate sight triangles for intersections of public streets, network-required private streets, and Type III driveways with connections to public streets.\n\nDimension of Sight TrianglesA sight triangle applies to land abutting these intersections as follows:\n\nA sight triangle bounded on two sides by curb, measured in each direction along the back of curb for 50 feet from the midpoint of the radius of the back of curb, and on the third side by a diagonal line connecting the ends of each measured 50 foot side. Where there is no curb, the pavement edge shall be used for these measurements.\nIn addition to the above, in other than 90 degree intersections or where grades mandate, the Charlotte Department of Transportation (CDOT) may impose additional sight triangles under the standards adopted by the American Association of State Highway Transportation Officials (AASHTO).\n\n\n\n\nSIGHT TRIANGLE AT PUBLIC STREET INTERSECTION\nRestrictions for Sight Triangles at Public Street IntersectionsWithin established sight triangles, no structure, sign, parking space, landscaping, tree, berm, fence, wall, or other object of any kind shall be installed, constructed, set out, or maintained so as to obstruct visibility at a level between 30 and 72 inches above the level of the center of the intersection.\nExceptions to Restrictions for Sight Triangles at Public Street Intersections\n\nThe sight triangle restriction shall not apply to:\n\nExisting natural grades, which, by reason of natural topography, rise 30 or more inches above the level of the center of the adjacent intersection.\nTrees having limbs and foliage trimmed in such a manner that no limbs or foliage extend into the area between 30 and 72 inches above the level of the center of the abutting intersection.\nFire hydrants, public utility poles, street markers, and traffic control devices.\nThe sight triangles at street intersections shall not apply to structures located in the N2-C, NC, CAC-2, RAC, UC, UE, TOD-UC, TOD-NC, TOD-CC, IMU, IC-2, and RC Zoning Districts.\n\n\n\n\nAdditional Sight Distance Requirements at Public Street IntersectionsAdditional sight distance requirements may apply per the CDOT Director or North Carolina Department of Transportation (NCDOT) standards, as applicable.\n\nRequired Sight Triangles for Other ConnectionsThe standards below regulate sight triangles for driveway connections to public or network-required private streets.\n\nDimension of Sight Triangles at Other ConnectionsA sight triangle applies to land abutting these intersections as follows:\n\nA ten foot by ten foot sight triangle shall be established on each side of a connection.\nThe sight triangle shall be measured from the edge of the public right-of-way or the back of the sidewalk, whichever is greater, and the closest edge of a connection. Where public right-of-way does not exist, the sight triangle shall be measured from the back of the required sidewalk and the closest edge of the connection.\n\n\n\n\nSIGHT TRIANGLE AT OTHER CONNECTIONS\nRestrictions for Sight Triangles at Other ConnectionsWithin established sight triangles, no structure, sign, parking space, landscaping, tree, berm, fence, wall, or other object of any kind shall be installed, constructed, set out, or maintained so as to obstruct visibility at a level between 30 and 72 inches.\n\nLandscape and/or decorative walls may be in a sight triangle but shall not exceed 30 inches in combined overall height.\nThe sight triangle restriction shall not apply to trees having limbs and foliage trimmed in such a manner that no limbs or foliage extend into the area between 30 and 72 inches above the level of the center of the abutting intersection.\n\n\n\nAuthorityThe Director of the Charlotte Department of Transportation may waive all or part of the requirements in items 2 and 3 above, where a waiver would not constitute a traffic hazard or a condition dangerous to public safety. The Director of the Charlotte Department of Transportation shall also investigate violations, issue notices and orders, and perform other required enforcement duties related to the requirements in items 2 and 3 above.\nF. Turn LanesTurn lanes for driveways shall be required as described in the Streets Manual.G. Payment for Traffic Signal Installation or ModificationsIf a plan approval related to a driveway requires modifications to an existing traffic signal or installation of a new traffic signal, the property owner/developer shall pay for the traffic signal improvements. Additionally, the property owner/developer shall obtain, if necessary, and dedicate the associated right-of-way. Details shall be defined in a Signal Agreement, as described in the Streets Manual.H. Restrictions on Residential DrivewaysDriveway access to arterials shall be prohibited from single-family, duplex, triplex, or quadraplex lots that also front on a collector or local street.‍", "metadataJson": "{\"section_url\": \"/articles/article-31-network-cross-access-driveway-regulations/#313-driveways-and-street-access\"}"}]}