{"title": "Article 19. Off-Street Vehicle & Bicycle Parking", "metadataJson": "{\"base_url\": \"article-19-off-street-vehicle-bicycle-parking\"}", "section": [{"title": "19.1 PURPOSE", "text": "The purpose of the off-street vehicle and bicycle parking regulations is to:A. Manage parking to meet the intent and context of the various Place Types, utilizing tools such as minimum vehicle parking requirements and limits on the maximum amount of vehicle parking to be provided on-site.B. Ensure safe and efficient parking facility design.C. Provide bicycle parking and electric vehicle infrastructure to implement the City’s goals of increasing the use of zero carbon energy sources and alternative modes of transportation.", "metadataJson": "{\"section_url\": \"/articles/article-19-off-street-vehicle-bicycle-parking/#191-purpose\"}"}, {"title": "19.2 VEHICLE PARKING SPACE REQUIREMENTS", "text": "A. Vehicle Parking Space Tier System\nTable 19-1: Vehicle Parking Requirements are structured in a three-tier system as follows:\n\nTier 1: A minimum number of off-street parking spaces are required. There are no off-street parking space maximums.\nTier 2: A minimum number of off-street parking spaces are required. There are also off-street parking space maximums.\nTier 3: A minimum number of off-street parking spaces are required for a limited number of uses and locations, but most uses do not have a minimum parking requirement. There are also off-street parking space maximums.\n\nTier 3 required parking minimums may be reduced or eliminated upon Planning Director approval of a Parking Demand Management Assessment, as described in the Charlotte Streets Manual.\n\n\n\n\nThe tier that is applicable to each zoning district is identified in Table 19-1.\nWhere a cell is blank and shaded, no minimum and/or maximum parking is required.\nB. Calculation of Vehicle Parking SpacesVehicle parking spaces are calculated by the principal use of the lot. When more than one principal use occupies the same lot, the number of spaces is the sum of the separate requirements for each principal use.C. Minimum Off-Street Parking Space Requirements\nWhen minimum off-street parking spaces are required by Table 19-1, the minimum vehicle parking requirements apply when any of the following occurs:\n\nNew construction of a principal building.\nExpansion of an existing principal building resulting in a requirement of more than ten additional spaces.\nChange of use or expansion of an existing use resulting in a requirement of more than ten additional spaces.\n\n\nFor existing parking facilities, the number of off-street vehicle spaces shall not be reduced below any minimum parking requirements of this Ordinance. If the number of such existing spaces is already less than the minimum required, it shall not be further reduced. However, if required streetscape improvements, curb relocation, or other requirements of this Ordinance cause the elimination of off-street parking spaces, these spaces need not be replaced.\nD. Minimum Off-Street Parking Space Flexibilities\nOn-Street Parking SpacesExisting on-street parking spaces abutting the property may be counted toward required minimum off-street parking spaces. New on-street parking spaces abutting the property may also count toward required minimum off-street parking.\n\nWhere on-street parking spaces are unmarked, the number of parking spaces is calculated by dividing the length of the on-street parking area abutting the property by the length required for a parallel parking space in the Charlotte Land Development Standards Manual (CLDSM).\nWhere on-street parking spaces are marked, each marked space counts as one required parking space, including any space where at least 50% of the length is abutting the property.\nSpaces shall be accessible to the public 24 hours a day.\nIn the event that the city or state removes any such on-street parking that was allowed to count toward the minimum required, the existing use will not be required to make up the difference and the parking will not be made nonconforming.\n\n\nPublic Parking ReductionDevelopment sites located within 1,000 feet walking distance of public parking facilities may be granted a 20%reduction from the minimum parking requirement. Public parking facilities shall be owned or operated by a government agency or municipal service district, or developed as a public-private partnership, but do not include “park and ride” facilities for public transit.\nExisting Structures or Tree PreservationIn the event that the required minimum parking spaces cannot be placed on the lot without the demolition of an existing structure or causing damage to significant trees on the site or in the public right-of-way, the Zoning Administrator may authorize up to a 25% reduction in the total number of minimum parking spaces required on the lot. In the case of significant trees, the Zoning Administrator shall consult with the Chief Urban Forester prior to authorization of the reduction.\n\nThe Zoning Administrator may issue such an authorization only upon the request of the applicant and only upon determining that the reduction in the number of required parking spaces will not unreasonably increase parking congestion along public streets or in parking areas located on nearby lots.\nIf such authorization is granted, the applicant shall not demolish or remove the existing structure or trees unless the full required number of off-street parking spaces are provided on the lot.\nThe Zoning Administrator may request measures be taken to help mitigate the reduction in parking. These mitigations may include, but are not limited to, pedestrian connections to public sidewalks and additional bicycle parking accommodations.\n\n\nE. Parking Maximum Limitations for Existing FacilitiesIn the Transit Oriented Development Zoning Districts and the UC Zoning District, when at least 50% of the parking lot area is reconstructed, such parking lot shall meet any required parking maximums. Resealing, repaving, resurfacing, and/or re-striping of an existing parking lot are not considered reconstruction.F. Spaces Exempt from Parking MaximumsSpaces reserved for the following are not included in calculating parking maximums:\nRequired accessible parking spaces in compliance with City, state, and federal standards.\nEVSE-Installed electric vehicle charging stations (Section 19.3).\nThe following pick-up/drop-off spaces, which shall be marked as reserved:\n\nRide-hailing service vehicles.\nQuick-commerce delivery vehicles.\nSafe exchange zones, such as designated spaces in public areas for receipt of goods purchased online\n\n\nOn-street parking spaces abutting the site.\nOn-site visitor spaces for multi-family dwellings to a maximum exception of ten spaces or 10% of the total number of on-site dwelling units (in spaces), whichever is greater. All such spaces shall be marked as available for visitor use.\nG. Permissions to Exceed Parking Maximums\nA parking maximum may be exceeded by up to 25% if one or more of the following are met:\n\n10% of the total number of spaces are provided for public use 24 hours a day and seven days a week.\n20% of the total number of spaces are provided for public use as shared spaces available from 8:00 a.m. to 6:00 p.m., Monday through Friday.\n20% of the total number of spaces are provided for public use as shared spaces available from 6:00 p.m. to 8:00 a.m., seven days a week.\n\n\nWhen public use spaces are provided in order to exceed a parking maximum, the following apply:\n\nWhen located within a parking structure, public use spaces shall be located within the first two floors of the structure.\nSignage shall be provided that indicates the location of public use spaces.\nShared spaces that are not available 24 hours a day and seven days a week shall be clearly marked with the hours of availability for public use.\nThe facility may charge for the use of for public parking spaces.\n\n\nPublic transit facilities shall be exempt from parking maximums.\nH. Alternative Parking Near Existing Transit StationsAny property within one-half mile walking distance of an existing rapid transit station may use the Tier 3 parking standards, unless the property is located in a Neighborhood 1 Place Type. If Tier 3 parking standards are used, such standards shall be used in their entirety, including any applicable parking minimums and maximums.I. Accessible SpacesAll parking facilities shall comply with City, state, and federal requirements for accessible parking spaces.", "metadataJson": "{\"section_url\": \"/articles/article-19-off-street-vehicle-bicycle-parking/#192-vehicle-parking-space-requirements\"}"}, {"title": "19.3   REQUIRED ELECTRIC VEHICLE CHARGING STATIONS", "text": "A. Electric vehicle (EV) charging stations are required per Table 19-2: Required EV Charging Stations for:\nMulti-family stacked dwellings\nThe residential component of mixed-use developments\nHotels\nParking lots and parking structures as a principal use\nB. There are two types of electric vehicle (EV) charging stations required by this article: EV-Capable and EVSE-Installed. The types of electric vehicle (EV) charging stations are defined in Article 2.C. In determining the number of required EV charging stations, when the result contains a fraction, any fraction is counted as one parking space.D. For the residential component of mixed-use developments, the number of required EV charging stations shall be applied on a one-to-one ratio to the number of residential units in the development. However, where the number of parking spaces in a development is less than the number of residential units, the required EV spaces will be based on the total number of spaces provided.E. EV charging stations shall only count toward a development’s parking maximum if spaces are EV-Capable. EVSE-Installed stations do not count toward parking maximums.F. Where a parking minimum is required, EVSE-Installed stations shall count as two spaces.G. Any EVSE-Installed stations provided in addition to the required EVSE-Installed stations may be counted toward the EV-Capable requirement as two EV-Capable stations.", "metadataJson": "{\"section_url\": \"/articles/article-19-off-street-vehicle-bicycle-parking/#193-\\u00a0-required-electric-vehicle-charging-stations\"}"}, {"title": "19.4   REQUIRED BICYCLE PARKING", "text": "A. When bicycle parking spaces are required by Table 19-3: Bicycle Parking Requirements, such bicycle parking shall be installed when any of the following occurs:\nNew construction of a principal building.\nExpansion of an existing principal building resulting in a requirement of more than five additional bicycle spaces.\nChange of use or expansion of an existing use resulting in a requirement of more than five additional bicycle spaces.\nB. Of those uses required to provide bicycle spaces, Table 19-3 will indicate that some uses are required to provide long-term spaces. The required number of long-term spaces is a percentage of the required total bicycle spaces. All other required bicycle spaces shall be designed as short-term spaces. Where a cell is blank and shaded, no short-term and/or long-term bicycle parking is required.C. For uses where bicycle parking is required, a minimum of two short-term bicycle spaces shall be provided. In no case are more than 30 short-term bicycle parking spaces required to be provided.D. If short-term spaces are capped as per item C above, the number of long-term spaces required shall continue to be calculated based upon the required number of short-term spaces, disregarding the cap. In the case of nonresidential uses, no more than 50 long-term bicycle parking spaces are required to be provided.E. Long-term bicycle parking is not required in either of the following conditions:\nThe entire nonresidential development has a gross floor area of 5,000 square feet or less. This does not apply to residential development.\nFive or fewer bicycle spaces are required.\nF. Bicycle parking located in the public right-of-way shall be subject to approval by the Charlotte Department of Transportation (CDOT) or the North Carolina Department of Transportation (NCDOT), as applicable. A requirement to provide bicycle parking does not imply that a right-of-way encroachment will be granted.", "metadataJson": "{\"section_url\": \"/articles/article-19-off-street-vehicle-bicycle-parking/#194-\\u00a0-required-bicycle-parking\"}"}, {"title": "19.5   DESIGN OF VEHICLE PARKING SPACES", "text": "\nEach required vehicle parking space shall meet the minimum dimensional requirements of the Charlotte Land Development Standards Manual (CLDSM). Each required parking space shall have direct and unrestricted access to a drive aisle that meets the standards of the CLDSM.\nFor parking lots and parking structures of 20 spaces or more, up to 25% of required vehicle parking spaces may be designed and designated for compact vehicles per CLDSM standards.\nThe use of required off-street vehicle parking spaces for the sale, repair, dismantling, or servicing of any vehicles, equipment, materials, or supplies is prohibited. The sale and display of goods in required off-street vehicle parking spaces is also prohibited unless specifically permitted within the Use Matrix in Article 15.\nFor nonresidential uses and multi-family stacked dwellings, access configurations which require backing directly onto a street from a required off-street vehicle parking space are prohibited.\n", "metadataJson": "{\"section_url\": \"/articles/article-19-off-street-vehicle-bicycle-parking/#195-\\u00a0-design-of-vehicle-parking-spaces\"}"}, {"title": "19.6  DESIGN OF SURFACE PARKING AND PARKING LOTS", "text": "A. Surface Parking and Parking Lot Location and Configuration\nNeighborhood 1 Zoning Districts and Neighborhood 2 Zoning Districts\n\nResidential Dwellings\n\nSingle-Family Dwellings on Individual LotsThe following apply to all single-family dwellings on individual lots:\n\nRequired parking spaces for single-family dwellings shall be located either on a driveway, on an improved surface parking pad, or in a garage.\nAll required parking spaces for residential uses shall be located on the same lot as the use.\n\n\nDuplex, Triplex, and Quadraplex Dwellings on Individual LotsThe following apply to all duplex, triplex, and quadraplex dwellings on individual lots:\n\nParking spaces shall be located on a driveway, on a parking pad, or in a garage.\nAll required parking spaces shall be located on the same lot as the use.\nDriveways and parking pads shall have a maximum width of 40% of the lot width up to a maximum of 24 feet in width within the established setback along a frontage. This maximum width may be split between driveways and parking pads, but the cumulative width of all driveways and parking pads may not exceed the maximum width permitted.\nDriveways and parking pads may exceed 24 feet in width when outside of the established front setback.\n\n\nAll Dwellings\n\nAll driveways and parking areas/pads shall be improved surfaces, such as concrete, asphalt, or other material commonly used for the parking of vehicles, but not including grass, dirt, or gravel. However, gravel is permitted for single-family dwellings. Alternative types of improved surfaces may be approved by the Zoning Administrator in coordination with the Stormwater Administrator for sites within the water supply watershed protection districts.\nAll driveways shall have a minimum width of 10 feet.\nDriveways and parking pad spaces shall be a minimum of 20 feet in length as measured from the right-of-way, back of sidewalk, or back of a shared use path, whichever is greater.\nGarages for individual units shall be set back a minimum of 20 feet or the required zoning district setback, whichever is greater. The 20 foot distance shall be measured from the right-of-way, back of sidewalk, or back of a shared use path, whichever is greater.\nParking areas other than individual driveways are prohibited within the established front and corner side setback. This does not apply to principal buildings fronting on Limited Access Roads or to single-family dwellings on individual lots.\nDriveways shall be as nearly perpendicular to the street frontage as possible. This does not apply to single-family dwellings on individual lots.\nMulti-family dwellings and multi-dwelling developments may have a common parking area or areas located within the development site.\nAlong alleys, driveways and parking pads shall be designed per the CLDSM.\n\n\n\n\n\n\nDRIVEWAYS\nNonresidential and Mixed-Use Developments\n\nAll surface parking lots are prohibited in an established setback along a primary frontage. However, the following exceptions apply:\n\nWhere there is no principal building, parking areas shall not be located in any required setback or build-to zone, as applicable. In addition, parking areas shall be located a minimum of 20 feet from a right-of-way, back of sidewalk, or back of a shared use path, whichever is greater.\nThis does not apply to principal buildings fronting on Limited Access Roads; however, such areas are prohibited in the required setback.\nFor nonresidential development on arterial streets and Parkways in the Neighborhood 1 Zoning Districts, and the N2-A and N2-B Zoning Districts, one double row of parking may be located between the building façade and the required setback.\nAlternatively, on arterial streets and Parkways in the Neighborhood 1 Zoning Districts, and the N2-A and N2-B Zoning Districts, parking may be located between the building façade and the required setback for up to 60% of the total building length. The remainder of the building length shall be located closer to the required setback line than the parking.\n\n\nParking lots for nonresidential uses shall be located on the same lot as the principal building. Parking lots for nonresidential uses that are part of the development may also be located on a lot that is adjacent to the lot containing the principal building and is used exclusively for parking for that nonresidential use.\n\n\nARTERIAL STREET PARKING LOCATION\nAll Other Zoning Districts\n\nSurface Parking DesignSurface parking design for all developments are subject to the standards of Table 19-4: Surface Parking Area Location and Access.\nAdditional Surface Parking and Parking Lot Location Standards\n\nResidential Uses and Residential Component of Mixed-UseAll required parking spaces for residential uses shall be located on the same lot as the use. Multi-family and multi-dwelling developments may have a common parking area or areas located within the development site.\nNonresidential Uses and Nonresidential Component of Mixed-UseParking areas for nonresidential uses and the nonresidential component of mixed-use may be located as follows:\n\nWhere there is no principal building, parking areas are prohibited in any required setback or build-to zone, as applicable. In addition, parking areas shall be located a minimum of 20 feet from a right-of-way, back of sidewalk, or a shared use path, whichever is greater.\nWithin a common parking area or areas of the development site.\nIn an off-site parking lot or parking structure no more than 800 feet walking distance from the development where the use is located. Such off-site parking shall be approved by the Zoning Administrator. Any off-site parking shall be provided by lease of the off-site parking area for a minimum of five years. Such off-site parking shall be reserved for the exclusive use of the nonresidential use.\nFor uses where events are held but that are not open for use when no events are occurring, such as stadiums and live performance venues, parking may be located off-site more than 800 feet from the event site. The Zoning Administrator, in conjunction with Charlotte Department of Transportation (CDOT) staff, shall require verification of how the anticipated parking demand will be accommodated, such as by shuttle service. This provision does not apply to places of worship.\n\n\n\n\n\n\nB. Parking Lot Surfacing\nAll parking lots shall be improved with a hard surfaces, such as concrete, asphalt, or other material commonly used for the parking of vehicles, but not including grass or dirt; gravel is permitted in accordance with item 2 below. Pervious paving is encouraged where appropriate given weight-bearing and traffic requirements.\nGravel and other loose material shall be permitted for parking lots, with the exception of driveways that connect directly to a street.  Driveways that connect the surface parking lot directly to a street shall meet the following:\n\nSuch driveways shall be improved surfaces, such as concrete, asphalt, or other material commonly used for the parking of vehicles, but not including grass, dirt, or gravel.\nImproved surface driveways shall be a minimum of 20 feet in length as measured from the right-of-way or back of sidewalk or a shared use path, whichever is greater.\n\n\nC. StripingAll parking lots improved with a hard surface, excluding those improved with gravel, of ten or more spaces shall delineate parking spaces with paint or other permanent materials, which shall be maintained in clearly visible condition.D. Barriers\nBarriers, such as wheel blocks, bollards, and curbs, shall be located along the perimeter of parking lots, internal sidewalks and pedestrian connections that abut parking spaces or driveways, and vehicle storage areas, except at ingress, egress, and circulation points. If there is parking on the perimeter of a bus or tractor-trailer lot, bollards, or wheel blocks are required.\nSuch barriers shall be designed and located to prevent parked vehicles from extending beyond designated parking areas.\nAll barriers shall be designed and located in accordance with the standards set out in the CLDSM.\nE. LightingParking lots shall be subject to the exterior lighting standards of Section 16.2.F. Nonconforming Parking Lot and Surface Parking Design‍When an existing parking lot of ten or more spaces does not conform to the design requirements of this article, it shall be brought into conformance when the parking lot is fully reconstructed or repaved, or the parking lot area is expanded by greater than 50%. Any expansion of an existing nonconforming parking lot shall be constructed to all applicable UDO standards. Resealing or re-striping of an existing parking lot, which does not entail paving, resurfacing, or replacement of the asphalt, concrete, or other surface paving material, is not considered reconstruction.", "metadataJson": "{\"section_url\": \"/articles/article-19-off-street-vehicle-bicycle-parking/#196-\\u00a0design-of-surface-parking-and-parking-lots\"}"}, {"title": "19.7   DESIGN OF PARKING STRUCTURES", "text": "A. Applicability of Parking Structure Design Standards\nAll parking structures are subject to the general regulations of item B below.\nSelect zoning districts are subject to the additional standards of item C below and Table 19-5: Parking Structure Design Options when located on the applicable frontage.\nIf there is a conflict between the general regulations in item B and the options outlined in item C, item C shall control.\nB. General Parking Structure Design StandardsAll parking structures are subject to the following standards:\nOn the ground floor of a facade abutting a frontage, where active uses, ingress/egress points, and/or mechanical equipment are not present, pedestrian-scale interest and activity shall be created through the inclusion of at least three architectural elements, such as awnings, overhangs, decorative screens, grills, louvers, pedestrian scale decorative lighting, decorative plantings, or other similar features. This does not apply to Limited Access frontages.\nAlong a frontage, the facades of parking structures shall include both vertical and horizontal treatment that resembles patterns and architecture of the buildings within the development, including use of similar materials and a similar rhythm of window openings. Any openings shall be screened using decorative elements such as grillwork, louvers, green walls, or a similar treatment.  This standard shall also apply to a freestanding parking structure that is not part of a larger development, in which case it shall incorporate the patterns and architecture of the surrounding buildings.\nFor parking structures with rooftop open-air parking, a parapet wall a minimum of four feet in height measured from the surface of the roof is required.\nFacade openings that face any frontage shall be vertically and horizontally aligned, and all floors fronting on those facades shall be level, not inclined. This does not apply to Limited Access frontages.\nParking structures shall be designed so that vehicles parked on all levels of the structure and associated lighting are screened by a wall or panel measuring a minimum of 42 inches in height, as measured from the finished surface of the parking level. Along a frontage, the decorative elements indicated in item 2 above shall occupy a minimum of 25% of the area of the opening above the wall or panel.\nParking structures shall be subject to the exterior lighting standards of Section 16.2.\n     GENERAL PARKING STRUCTURE DESIGNC. Additional Parking Structure Design Standards by Zoning District\nDesign\n\nParking structures in select zoning districts shall be designed in accordance with the additional design standards of Table 19-5: Parking Structure Design Options.\nWhere multiple options are indicated in Table 19-5, any of the indicated options are permitted.\nActive use spaces and fully wrapped parking structures are required to meet building articulation and transparency standards of the zoning district.\nParking structures without active use spaces are exempt from the following zoning district standards:\n\nBuilding articulation standards for minimum ground floor height and maximum prominent entry spacing.\nTransparency standards.\n\n\nThe Zoning Administrator may waive the requirement for ground floor activation for parking structures for public transit facilities in constrained conditions when Table 19-5 only allows options with ground floor activation. If such requirements are waived, the parking structure is subject to the general design standards of item B above.\n\n\nParking Structure Design OptionsThe options of Table 19-5: Parking Structure Design Options are as follows:\n\nOption A – All Floors Wrapped and Ground Floor Activation\n\nAll floors wrapped requires a minimum of 70% of the façade above ground floor along any frontage be covered with occupiable building space a minimum of 20 feet in depth. This does not apply for the portion of the facade above the sixth floor.\nGround floor activation shall meet the standards of Option C below.\n\n\nOption B – Ground Floor Activation and Stepback\n\nGround floor activation shall meet the standards of Option C below.\nA minimum ten foot building stepback is required for any parking located above the ground floor.\n\n\nOption C – Ground Floor Activation\n\nParking structures shall include residential or nonresidential active uses along 90% of the ground floor building length along any primary frontage and 60% of the ground floor building length along any secondary frontage, excluding areas of vehicular and pedestrian egress, fire stairs, and mechanical or electrical equipment rooms.\nNonresidential active use bays shall be a minimum of 20 feet in width and 20 feet in depth. Individual spaces shall be furnished with water, sewer, and electrical service, or such services shall be stubbed into each individual active use bay for a future connection.\n\n\nOption D – Additional Setback with Landscape Area\n\nFoundation landscape is required along the entire façade area excluding areas of vehicular and pedestrian egress, and mechanical or electrical equipment rooms. The landscape yard shall count toward any required minimum build-to percentage.\nThe width of the additional setback is indicated by the number associated with Option D in Table 19-5. This landscape area setback is in addition to the setback required by the zoning district.\nThe landscape area shall be planted in accordance with the requirements of Section 20.8.\n\n\n\n\nPARKING STRUCTURE DESIGN OPTIONS‍", "metadataJson": "{\"section_url\": \"/articles/article-19-off-street-vehicle-bicycle-parking/#197-\\u00a0-design-of-parking-structures\"}"}, {"title": "19.8  DESIGN OF UNDERGROUND PARKING STRUCTURES", "text": "A. All uses are permitted to have an underground parking structure(s).  All portions of such structure(s) shall be fully underground, except for ingress/egress points.B. An underground parking structure may encroach into a setback but shall be no closer than five feet from the right-of-way line nor shall encroach into any area reserved for a utility easement, a landscape yard, or green area required by Article 20.", "metadataJson": "{\"section_url\": \"/articles/article-19-off-street-vehicle-bicycle-parking/#198-\\u00a0design-of-underground-parking-structures\"}"}, {"title": "19.9  DESIGN OF BICYCLE PARKING", "text": "A. General Standards\nBike lockers and racks shall be located on a hard surface and be securely anchored.\nAll bicycle lockers, bicycle racks, and bicycle parking spaces and areas shall be designed to meet the standards and design specifications of the CLDSM. Alternative bike locker and bike rack designs may be deemed acceptable by CDOT.\nIf required bicycle parking is not clearly visible from the entrance to the building, parking structure, transit station, or lot, a sign shall be posted at the primary entrances of these places indicating the location of the parking.\nBicycle parking facilities shall provide sufficient security from theft and damage. They shall be securely anchored to the ground, shall allow the bicycle to be securely locked, and shall be in a location with sufficient lighting and visibility.\nB. Short-Term Bicycle Parking\nShort-term bicycle parking shall be no more than 120 feet from an entrance to the building it is intended to serve.\nShort-term bicycle parking may be located within the public right-of-way and/or within the required setback, subject to the following additional requirements:\n\nThe short-term bicycle parking shall not obstruct required sidewalks or paths or movement from on-street parking to the required sidewalks or paths, and shall not impact the minimum planting area or spacing requirements for street trees or required screening.\nBicycle parking located in the public right-of-way shall be subject to approval by the CDOT or the NCDOT, as applicable.\n\n\nC. Long-Term Bicycle Parking\nAll long-term spaces shall be fully covered and offer protection from the elements. Long-term bicycle parking may consist of indoor parking, racks in garage structures, and/or bicycle lockers or other means which provide coverage of the bicycle.\nLong-term bicycle parking shall be located either internal to the building or behind the building line along a frontage. Such parking may be restricted for the sole use of employees, tenants, residents, or others at the discretion of the property owner or management.\nSpaces within dwelling units or on balconies do not count toward satisfying long-term bicycle parking requirements.\n", "metadataJson": "{\"section_url\": \"/articles/article-19-off-street-vehicle-bicycle-parking/#199-\\u00a0design-of-bicycle-parking\"}"}, {"title": "19.10   VALET PARKING REQUIREMENTS", "text": "A. On private property, all outdoor valet drop-off/pickup locations and maneuvering areas shall be located to the side or rear of the principal building. No maneuvering area shall be located in the established setback along a frontage in Neighborhood Center Zoning Districts, Community Activity Center Zoning Districts, Innovation Mixed-Use Zoning Districts, Transit Oriented Development Zoning Districts, and Regional Activity Center Zoning Districts.B. Drop-off/pickup locations and related elements such as kiosks and counters for approved valet parking on a public or network-required private street shall not be located in any amenity zone, planting strip, sidewalk, or shared use path.C. The valet parking service and associated structures cannot disrupt pedestrian and vehicular traffic.", "metadataJson": "{\"section_url\": \"/articles/article-19-off-street-vehicle-bicycle-parking/#1910-\\u00a0-valet-parking-requirements\"}"}, {"title": "19.11   COMMERCIAL VEHICLE STORAGE", "text": "A. Residential Development\nOne light or medium commercial vehicle may be parked overnight at a residence.\nA medium commercial vehicle may only be parked on a clearly delineated driveway or parking area of the residence. Medium commercial vehicles may not be parked overnight on public streets.\nParking of large commercial vehicles is prohibited, except as permitted in item D below.\nB. Mixed-Use DevelopmentOnly light and medium commercial vehicle storage is permitted in mixed-use developments. The parking of large commercial vehicles is prohibited, except as permitted in item D below.C. Nonresidential DevelopmentParking of light, medium, and large commercial vehicles operated in conjunction with the use established on the site may be stored on-site.D. Temporary ParkingThis section shall not prevent the temporary parking of emergency vehicles, delivery trucks, moving vans, and similar vehicles used for delivery of goods and services, or the parking of commercial vehicles at an active job site or staging area.", "metadataJson": "{\"section_url\": \"/articles/article-19-off-street-vehicle-bicycle-parking/#1911-\\u00a0-commercial-vehicle-storage\"}"}]}