{"title": "Article 38. Nonconformities", "metadataJson": "{\"base_url\": \"article-38-nonconformities\"}", "section": [{"title": "38.1 GENERAL PROVISIONS", "text": "\n” PurposeThe purpose of this article is to regulate and limit the continued existence of structures, uses, lots, site elements, or signs that do not conform to these regulations but were lawfully established by Ordinance regulations prior to the effective date of this Ordinance, and any subsequent amendments.\n*B.* Authority to Continue\n\nAny structure, use, lot, site element, or sign that legally existed as of the effective date of this Ordinance and has been made nonconforming as of the effective date of this Ordinance may continue subject to the provisions of this article.\n\n\n\nAny use, structure, lot, site element, or sign that legally existed after the effective date and has been made nonconforming due to a subsequent amendment of this Ordinance after that effective date may continue subject to the provisions of this article.\n\n\n*C.* Burden on Property OwnerThe burden of establishing a nonconformity under the provisions of this Ordinance is the responsibility of the property owner or operator of the nonconforming structure, use, lot, site element, or sign. Based upon the evidence presented, the Zoning Administrator will make a determination of the validity of the nonconforming status.\n", "metadataJson": "{\"section_url\": \"/articles/article-38-nonconformities/#381-general-provisions\"}"}, {"title": "38.2 NONCONFORMING USES", "text": "Nonconforming uses of land or structures, and nonconforming structures that contain nonconforming uses may continue only in accordance with the provisions of this section.\nNormal repair and maintenance may be performed to allow the continuation of a nonconforming use.\nA nonconforming use shall not be expanded, nor shall a nonconforming use be enlarged by additions to the structure in which the nonconforming use is located or expansion into additional lot area.\nA structure in which a nonconforming use is located and will be maintained shall not be moved unless the use thereafter shall conform to the standards of the zoning district(s) to which it is moved.\nA nonconforming use of a structure or land may be changed to another nonconforming use within the same use category of the Use Matrix in Article 15 if the change to another nonconforming use does not generate any secondary effects such as more automobile or truck traffic, noise, vibration, smoke, dust, or fumes than the original nonconforming use as determined by the Zoning Administrator.\nOnce a nonconforming use is changed to a conforming use, the nonconforming use shall not be re-established.\nWhere a nonconforming use is visibly discontinued for 12 consecutive months, the use shall not be reestablished or resumed, and any subsequent use of the land or structure shall conform to the requirements of this Ordinance\nWhere a structure in which a nonconforming use is located is destroyed or damaged by fire, flood, wind, or other act(s) of God, the structure may be repaired or restored to its original dimensions and conditions and the nonconforming use re-established as long as a building permit application for the repair or restoration is submitted within 18 months of the date of the damage.\n", "metadataJson": "{\"section_url\": \"/articles/article-38-nonconformities/#382-nonconforming-uses\"}"}, {"title": "38.3 NONCONFORMING STRUCTURES", "text": "A nonconforming structure may continue in accordance with the provisions of this section.\n” Normal repair and maintenance may be performed to allow the continuation of nonconforming structures.\n*B.* Except as provided in items C and D below, a nonconforming structure shall not undergo a change of use, renovation, or expansion.\n*C.* Unless otherwise stated elsewhere in the Ordinance, a nonconforming structure may undergo a change of use or renovation without having to bring the structure into conformity with the requirements of this Ordinance, provided that:\n\nThe change of use is to a use allowed within the zoning district.\n\n\n\nThe number of parking spaces provided for the use is in conformity with the requirements of this Ordinance.\n\n\n*D.* A nonconforming structure may be expanded, without bringing the remainder of the nonconforming structure into conformity, only if the expansion and the area of the lot into which the expansion is taking place are both in conformance with the requirements of this Ordinance.\n\nFurther, additions to legally nonconforming structures in the following zoning districts are subject to the following standards: Neighborhood Commercial Zoning Districts, Regional Activity Center Zoning Districts, Innovation Mixed-Use Zoning Districts, Transit Oriented Development Zoning Districts, and the IC-2, RC, and CAC-2 Zoning Districts.\n\nWhen an addition does not exceed 25% of the gross floor area of the structure or 1,000 square feet, whichever is less, the addition shall meet only the following standards:\n\nBuilding siting standards:\n\nRequired setback line by frontage type.\n\n\n\nBuild-to zone. The Zoning Administrator may waive this requirement, if it is determined the build-to zone is not practical.\n\n\n\nMinimum build-to percentage. The Zoning Administrator may waive this requirement, if it is determined the minimum build-to percentage is not practical.\n\n\n\nSide and rear setbacks.\n\n\n\n\n\nMaximum building height.\n\n\n\n\n\nWhen an addition equals or exceeds 25% of the gross floor area of the structure or 1,000 square feet, whichever is less, the addition shall comply with zoning district standards, with the exception of requirements for vertical distance between building entry and sidewalk.\n\n\n\n\n\nIf additions to the structure are incremental, the sum total of all expansions that occur after the effective date of this Ordinance shall be recorded to ensure the limitation of item 1 above is not exceeded.\n\n\n*E.* Alterations to nonconforming structures shall not increase in the degree of nonconformity of any feature that previously rendered them nonconforming.\n*F.* A nonconforming structure shall not be moved unless it thereafter conforms to the standards of the zoning district in which it is located.\n*G.* Where a nonconforming structure is destroyed or damaged by fire, flood, wind, or other act(s) of God, the structure may be repaired or restored to its original dimensions and conditions as long as a building permit application for the repair or restoration is issued within 18 months of the date of the damage.\n*H.* An existing manufactured home located in a nonconforming manufactured home park may be replaced with another manufactured home provided the number of manufactured home units may not be increased beyond the number available before replacement and the replacing manufactured home shall not create nonconforming setbacks, separation distances, or increase existing nonconforming setbacks or separation distances\n", "metadataJson": "{\"section_url\": \"/articles/article-38-nonconformities/#383-nonconforming-structures\"}"}, {"title": "38.4 NONCONFORMING ACCESSORY USES AND ACCESSORY STRUCTURES", "text": "\nNo nonconforming accessory use or accessory structure shall continue after the principal use or structure is discontinued, damaged, or destroyed unless such accessory use or accessory structure thereafter is made to conform to the standards of the zoning district in which it is located.\nAn existing, nonconforming aboveground utility accessory structure or mechanical equipment may be replaced provided the replacement structure does not increase any existing nonconformity caused by an extension into a required side or rear setback. The replacement nonconforming aboveground utility accessory structure or mechanical equipment shall not exceed 42 inches in height if located in an established setback along a frontage.\nA nonconforming accessory use or accessory structure may be expanded only if the nonconforming features of that use or structure are not expanded so as to increase the degree of nonconformity.\n", "metadataJson": "{\"section_url\": \"/articles/article-38-nonconformities/#384-nonconforming-accessory-uses-and-accessory-structures\"}"}, {"title": "38.5 NONCONFORMING EXTERIOR LIGHTING", "text": "The Zoning Administrator may permit alterations to existing nonconforming lighting that brings such lighting into greater conformance but not entirely into conformance. (For example, if the fixture is replaced so that the lighting meets cut-off standards but remains nonconforming in terms of height, such action may be permitted by the Zoning Administrator.)", "metadataJson": "{\"section_url\": \"/articles/article-38-nonconformities/#385-nonconforming-exterior-lighting\"}"}, {"title": "38.6 NONCONFORMING SIGNS", "text": "\n” Nonconforming On-Premise SignsNotwithstanding 39.2.E.4.b, nonconforming on-premise signs shall be subject to all applicable nonconforming provisions of this Ordinance and may remain until one of the following occurs:\n\nThe sign(s) is moved, removed, or replaced by voluntary action. Any such sign, or portion thereof, which is required to be relocated due to a governmental action, such as a roadway improvement, may be moved to another location on the same property.\n\n\n\nAny change to the sign that is not one of the following:\n\nNecessitated by routine maintenance or repairs.\n\n\n\nNecessitated for compliance with minimum building or electrical codes.\n\n\n\nA change to the existing sign face not involving the modification of the size or shape of the sign face.\n\n\n\n\n\nApproval of a sign permit application to add new or additional signage to the site of a nonconforming sign.\n\n\n*B.* Nonconforming Outdoor Advertising Signs\n\nExisting outdoor advertising signs that do not meet the standards of Table 22-4 or Table 22-5 but conform to the standards of Table 22-6 may continue and are deemed nonconforming.\n\n\n\nExisting outdoor advertising signs that do not meet the standards of Table 22-4, Table 22-5, or Table 22-6, but can be rebuilt or replaced to conform to the standards of Table 22-6, may be rebuilt or replaced so long as the sign height and sign area are not increased. A sign permit shall be obtained to rebuild or replace such sign and the sign permit obtained shall be valid and unexpired prior to the removal of the existing sign.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-38-nonconformities/#386-nonconforming-signs\"}"}, {"title": "38.7 NONCONFORMING SITE ELEMENTS", "text": "\nDefinitionA nonconforming site element is a physical characteristic of a site such as landscape, fences or walls, and parking and loading. This does not include nonconforming accessory uses and accessory structures, exterior lighting, and signs which are regulated by Sections 38.4, 38.5, and 38.6 respectively.\nApplicabilityA nonconforming site element may continue in accordance with the provisions of this section.\nMaintenanceNormal maintenance and incidental repair to a nonconforming site element may be performed. No repairs or reconstruction are permitted that would create any new nonconformity or increase the degree of the previously existing nonconformity. Resealing, resurfacing, or re-striping of an existing parking lot is considered normal maintenance and incidental repair.\nRequired ConformanceUnless otherwise stated elsewhere in the Ordinance, all nonconforming site elements must be brought into conformance when there is construction of a new principal building.\n", "metadataJson": "{\"section_url\": \"/articles/article-38-nonconformities/#387-nonconforming-site-elements\"}"}, {"title": "38.8 NONCONFORMING LOTS", "text": "\nExcept as provided in item B below, a nonconforming lot may be used for any of the uses permitted in the zoning district in which it is located, provided that the development on the lot meets all dimensional and design standards of that zoning district.\nA vacant nonconforming lot shall not be used if it could be combined with another vacant adjoining lot(s) owned by the same person, or entity, in order to create one or more conforming lots. When a single property owner owns only two existing adjoining nonconforming lots, and the combination would result in the creation of a single lot that is more than 1.5 times the width and area required in the zoning district, the single lot may be divided into two lots of equal width and area without being further classified as nonconforming.\n‍", "metadataJson": "{\"section_url\": \"/articles/article-38-nonconformities/#388-nonconforming-lots\"}"}]}