{"title": "Article 30. Subdivision", "metadataJson": "{\"base_url\": \"article-30-subdivision\"}", "section": [{"title": "30.1 PURPOSE", "text": "The purpose of this article is to:\nPromote orderly development of the City and its extraterritorial jurisdiction (ETJ) through the coordinated division and development of lands.\nCoordinate streets within subdivisions with existing or planned streets and/or with public facilities.\nSecure adequate rights-of-way or easements for street or utility purposes.\nSecure adequate spaces for recreation; to protect and enhance environmental quality.\nCreate conditions essential to public health, safety, and welfare.\n", "metadataJson": "{\"section_url\": \"/articles/article-30-subdivision/#301-purpose\"}"}, {"title": "30.2 COMPLIANCE", "text": "\nAll plats for the subdivision of land shall conform to the requirements of this article and be submitted in accordance with the procedures and specifications established in this article. The description by metes and bounds in an instrument of transfer or other document used in the process of selling or transferring land shall not exempt the transaction from compliance with this article.\nAfter the effective date of this Ordinance, no plat of a subdivision of land, subject to the jurisdiction of this article, shall be filed or recorded by the County Register of Deeds until it has been submitted to and approved by the Planning Department. This includes all divisions of land as defined in Section 30.3\n", "metadataJson": "{\"section_url\": \"/articles/article-30-subdivision/#302-compliance\"}"}, {"title": "30.3 TYPES OF SUBDIVISIONS", "text": "A. Standard SubdivisionStandard subdivisions include:\nAll divisions of a tract or parcel of land into two or more lots, building sites, or other divisions for the purpose, whether immediate or future, of sale or building development whether residential or nonresidential.\nResidential and nonresidential multiple building site and multi-site projects even if there is no division of the underlying land into separate parcels which is to be recorded with the County Register of Deeds.\nAll divisions of land involving the dedication of a new street or a new street right-of-way or a change in existing streets.\nB. Exceptions to SubdivisionThe following shall not be included within the definition of standard subdivision nor be subject to the requirements of this article:\nThe combination or recombination of portions of parcels created and recorded where the total number of parcels or lots is not increased, and the resultant parcels are equal to the standards of Articles 4 through 14 and Section 16.1.\nThe division of land into parcels greater than ten acres where no street right-of-way dedication is involved.\nThe creation of strips of land for the widening or opening of streets, for public transportation system corridors, or the location of public utility rights-of-way.\nThe division of a tract in single ownership whose entire area is no greater than two acres into not more than three lots, where no street right-of-way dedication is involved and where the resultant lots are equal to or exceed the standards of the appropriate zoning classification.\nThe division of land into plots or lots for use as a cemetery.\nCreation of a separate lot or building site by a less than fee simple instrument, such as a ground lease, when the property interest created is divided from the original parcel for ten years or less, including options to renew.\nThe lease of space or other area within a building owned by the landlord.\nEasements for the purposes of utilities, driveways, parking, footpaths, trails, or other similar purposes.\nThe division of a tract or parcel into separate tracts or parcels, or the creation of interests in lots or parcels, by means of:\n\nA deed of trust, mortgage, or similar security interest solely for the purpose of securing any bona fide obligation (including transfers of such parcels or tracts pursuant to foreclosure or deeds in lieu of foreclosure).\nReleases from the liens and operation of such deeds of trust, mortgages, or similar security interests.\n\n\nProceedings to partition interests in lots or parcels pursuant to N.C.G.S. Chapter 46 (or any successor statute) resulting in the division of a lot or parcel into two or more lots or parcels except where the partition proceeding is brought to circumvent the provisions of this article.\nDivision of a tract into parcels in accordance with the terms of a probated will or in accordance with intestate succession under Chapter 29 of the North Carolina General Statutes.\nTransfers of tracts or parcels by inheritance, to settle an estate, or bona fide gift.\nCondemnation or deed in lieu of condemnation, by either a public or private condemner; provided, however, that the condemner shall comply with the requirements of this article as to the property acquired, either prior to the commencement of any development of the property acquired, or prior to the issuance of any building permit on the property acquired, or within six months following the date of acquisition, whichever date first occurs.\nC. Limited Minor SubdivisionA limited minor subdivision means a subdivision that is not otherwise exempt from this article, and where the tract or parcel of land retained by the owner submitting the land for subdivision approval is either:\nIn excess of ten acres. For such subdivisions, the owner shall be required to plat only the parcel to be transferred or leased, and only that parcel shall be subject to the requirements of this article; or\nA division of a tract or parcel of land in single ownership if all the following criteria are met. A division of a tract or parcel of land meeting all the criteria may only require a plat for recordation.\n\nNo part of the tract or parcel to be divided has been divided under the subdivision regulations of the City in the ten years prior to division.\nThe entire area of the tract or parcel to be divided is greater than five acres.\nAfter division, no more than three lots result from the division.\nAfter division, all resultant lots comply with all the following:\n\nAll lot dimension size requirements of the applicable zoning regulations.\nThe use of the lots is in conformity with the applicable zoning requirements.\nA permanent means of ingress and egress is recorded for each lot.\n\n\n\n\nD. Minor SubdivisionMinor subdivision means a subdivision that is not otherwise exempt from this article and that does not involve any of the following:\nThe creation of any new public street or street right-of-way.\nThe extension of any needed rights-of-way or easements for the water or sewer system operated by Charlotte Water.\nThe installation of drainage improvements through one or more lots to serve one or more other lots.\nThe installation of a private wastewater treatment plant or a private water supply system for more than one lot or building site.\n", "metadataJson": "{\"section_url\": \"/articles/article-30-subdivision/#303-types-of-subdivisions\"}"}, {"title": "30.4 GENERAL REQUIREMENTS", "text": "This section provides general requirements to be used in the design, review, and approval of any subdivision under the jurisdiction of this article.A. Residential Street DesignResidential street design will ensure the creation of a network of low volume, low speed streets. All new development shall provide for more than one access for ingress and egress, where feasible. The proposed street system will extend existing streets on their proper projections. To the greatest extent practicable, cul-de-sacs and other permanently dead-end streets are to be avoided.B. Relationship to Railroad Rights-of-WayWhen a subdivision adjoins a railroad right-of-way, the subdivider may be required to arrange the street pattern to provide for future grade separation of street and railroad crossings, except where no such crossing will be allowed by the railroad.C. Partial StreetsWhenever an existing partial street is adjacent to a tract of land to be subdivided, the remaining portion of the street shall be platted within such tract. New partial streets shall meet the standards of Tables 34-2 and 34-4.D. Mature Trees and Natural VegetationStreets and development sites shall be designed to protect and preserve, to the greatest extent practicable, stands of mature trees and other areas of significant natural vegetation.E. Access to Parks, Schools, GreenwaysStreets shall be designed, or walkways dedicated, to ensure convenient access to parks, greenways, playgrounds, educational facilities, and other places of public assembly.F. Parallel Streets Along Limited Access Roads and Arterial StreetsWhere a tract of land to be subdivided adjoins a federal or state highway, limited access road, or arterial that is not a Main Street, the subdivider may be required to provide a street parallel to the highway or to utilize reverse frontage on an interior street for lots developed adjacent to the highway. Where reverse frontage is established, deed restrictions or other means should be provided to prevent driveways from having direct access to the highway or street at the rear lot line.G. Public School and Public Park SitesWhen a tract of land that appears in any adopted plan or policy document as a future public school, public park, or greenway falls within an area proposed to be subdivided, the Planning Department staff shall notify the appropriate agency of the proposed subdivision and its effect on the future public site. The appropriate agency shall decide within 30 days if it wishes to reserve the site for future acquisition.\nIf the site is not to be reserved, the subdivision shall be processed in the normal fashion.\nIf the agency does wish to reserve the site, the subdivision shall not be approved without such reservation.\n\nThe appropriate agency shall have 18 months from the date of preliminary plan approval to acquire the site by purchase, by receipt of a dedication, or by initiating condemnation proceedings.\nIf, at the end of the 18 month period, none of the actions listed above has commenced, the subdivider may consider the land free of any reservation.\nThe subdivider may choose to dedicate the area to be reserved.\n\n\nH. Public FacilitiesWhen a tract of land that appears in any adopted plan or policy document as a future site for any community service facility including, but not limited to, police and fire stations, libraries, public housing, or other public use sites, falls within an area proposed to be subdivided, the Planning Department staff shall notify the appropriate agency of the proposed subdivision and its effect on the future public site. The appropriate agency shall decide within 30 days if it wishes to reserve the site for future acquisition.\nIf the site is not to be reserved, the subdivision shall be processed in the normal fashion.\nIf the agency does wish to reserve the site, the subdivision shall not be approved without such reservation.\n\nThe appropriate agency shall have 18 months from the date of preliminary plan approval to acquire the site by purchase, by receipt of a dedication, or by initiating condemnation proceedings.\nIf, at the end of the 18 month period, none of the actions listed above has commenced, the subdivider may consider the land free of any reservation.\nThe subdivider may choose to dedicate the area to be reserved.\n\n\nI. Street NamesProposed street names shall not duplicate nor too closely approximate phonetically the name of any street within the County or City. Where proposed streets are extensions of existing streets, the existing street names should be used.J. EasementsEasements established to the width and in the locations required by Charlotte Water and Stormwater Services as per the Charlotte-Mecklenburg Storm Water Services Design Manual, the Charlotte Water, Water and Sewer Design and Construction Standards, and/or the Charlotte Land Development Standards Manual (CLDSM), as applicable, should be provided for open or piped storm drainage, sanitary sewers, and water lines. This requirement applies to such lines installed at the time of the development of the subdivision and to easements for such lines which may reasonably be expected to be installed in the future. A sidewalk and utility easement (SUE) shall be shown two feet off the back of any sidewalk on a public street or shared-use path located partially or completely outside of the public right-of-way. If a building is two or more feet behind the required sidewalk or shared-use path, the two foot space shall be in the right-of-way, a SUE, or a combination of both.K. Proposed Water and Sewer SystemThe preliminary subdivision plan should be accompanied by satisfactory evidence as to the proposed method of providing potable water and a system of sanitary sewage collection and disposal as per the requirements of Sections 34.2 and 34.3.L. Restrictions on Subdivision of Land Subject to FloodingLots that are subject to flooding should not be established in subdivisions, except as provided in Section 24.3.C.M. Lots with Water AccessWhere a subdivision which adjoins the Catawba River or its impounded waters contains interior lots, parcels or tracts of land which do not adjoin the water’s edge, but any part of which is within 450 feet of the water’s edge, one or more lots which adjoin the water’s edge shall be reserved to provide water access for the owners of interior properties. Such lots shall be called water access lots. If property which is in the same ownership adjoins the subdivision, such property shall be construed as being part of the subdivision for purposes of determining requirements of water access lots.Water access lots shall equal at least 10% of the area, exclusive of streets, of all the interior property which lies within 450 feet of the water’s edge. However, where the 10% would equal less than 20,000 square feet, the subdivider shall not be required to provide any water access lots. All water access lots shall have a minimum frontage at the water’s edge of 100 feet. The water access lots shall either be dedicated to Mecklenburg County Park and Recreation Department (only if the Mecklenburg County Board of County Commissioners agrees to accept such dedication) or be transferred in fee simple title to a homeowners association of the interior lot owners of the subdivision. Before approval of the final plat, the subdivider shall submit to the Planning Department a covenant stating either that:\nThey shall dedicate the required amount of water access lots to the County; or\nThey shall convey title of the water access lots to a homeowners association of the purchasers of each interior lot.\nIf the subdivider chooses to dedicate the water access lots to the County, the Board of County Commissioners shall have agreed to accept the final responsibility of maintaining the lots, and the preliminary plan and final plat shall show the dedication. If the title is transferred to a homeowners association of the interior lot owners, the preliminary plan and final plat shall designate the lots covered by the homeowners association for each water access lot.", "metadataJson": "{\"section_url\": \"/articles/article-30-subdivision/#304-general-requirements\"}"}, {"title": "30.5 SKETCH PLAN", "text": "Prior to the filing of an application for approval of a preliminary subdivision plan, it is strongly encouraged, but not required, that a sketch plan be submitted to the Planning Department for review and recommendation. When submitted, this sketch plan should be drawn to a scale no smaller than one inch equals 100 feet on a topographical survey and should show, in simple sketch form, the proposed layout of streets, lots, and other features in relation to existing conditions. It should include the following information:A. The boundary lines of the property being subdivided.B. Watercourses on the land to be subdivided.C. The location, names, and right-of-way widths of any existing streets, paper streets, or half streets on or within 300 feet of the land to be subdivided.D. The location of all property lines which intersect the boundaries of the property being subdivided.", "metadataJson": "{\"section_url\": \"/articles/article-30-subdivision/#305-sketch-plan\"}"}, {"title": "30.6 PRELIMINARY PLAN REQUIREMENTS", "text": "A. A preliminary subdivision plan shall be drawn to the following specifications and shall contain or be accompanied by the information listed. No processing or review of a preliminary plan shall proceed without all the information listed. Detailed standards and specifications for construction are contained in the CLDSM:\nThe boundary of the area to be subdivided and the location within the area, or contiguous to it, of any existing streets, railroad lines, watercourses, easements, or other significant features of the tract.\nThe location, sizes, and elevations of existing sanitary sewers, storm drainage, culverts, and sight distance triangles (as applicable) within the tract and immediately adjacent thereto.\nOriginal contours at intervals of not less than four feet for the entire area to be subdivided and extended into adjoining property for 300 feet at all points where streets connect to the adjoining property. These contours shall be referenced to mean sea level datum established by the National Geodetic Survey and as extended by the City through its primary control system or to a benchmark that is within 2,000 feet of the subdivision. Proposed contours for the full width of all streets along open drainage channels and in all other portions of the subdivision where extensive grading is proposed shall be shown. These requirements shall not apply when the Subdivision, Streets, and Infrastructure (SSI) Administrator determines that the size of the subdivision and the topography make such information unnecessary.\nThe location of proposed streets, alleys, easements, lots, existing public parks or greenways, land reserved for public facilities or use, including off-street public paths, other property lines and building setback lines with street dimensions, tentative lot dimensions, other property lines and the location of any stormwater elevation line required by Section 24.3.C.3.\nThe location of all proposed storm drainage and appurtenances, with grades, inverts, and sizes indicated; a map of the drainage areas tributary to the proposed storm drainage; and a copy of the data used in determining the sizes of drainage pipes and structures. For each lot subject to flooding, as defined in Section 24.3.C, indicate the Stormwater Elevation Line (SWEL) and Stormwater Protection Elevation (SWPE).\nThe name of the subdivision; the name and signature of the owner or the owner’s duly authorized agent; the name of the surveyor, engineer, or designer; the names of proposed streets; and the names of adjoining subdivisions or property owners. The name assigned to the subdivision and the names assigned to streets at this time shall be used throughout the review and approval process for preliminary and final plats and shall not be changed without approval of the Planning Department staff.\nThe scale of the plan, which shall not be smaller than 100 feet to the inch; north point; date.\nTypical cross sections of proposed streets, showing widths and proposed construction of streets.\nProposed profiles of streets. Where a proposed street is an extension of an existing street, the profile shall be extended to include 300 feet of the existing streets and storm drains if present, and a cross section of the existing street shall be shown. Where a proposed street within the subdivision abuts a tract of land that adjoins the subdivision and where the street is expected to extend into the adjoining tract of land, the profile shall be extended to include 300 feet of the adjoining tract.\nThe proposed method of water supply and sewage disposal.\nAll proposed land uses and number of dwelling units.\nThe use, approximate height, and location of all buildings and structures other than single-family and duplex dwellings.\nA small-scale vicinity map showing the location of the subdivision with respect to adjacent streets and properties.\nProposed off-street parking and circulation plan showing the location and arrangement of parking spaces and any driveways for ingress and egress to and from adjacent streets and highways.\nThe proposed location, use, improvements, ownership, and manner of maintenance of common open space areas.\nThe location of any existing demolition landfill on the site and the location of any proposed demolition landfill on the site(s) if such information is available.\nA timetable for estimated project completion of the area covered by the preliminary plan. For plans which call for development over a period of years, a schedule showing the time within which application for final approval of all parts of the development are intended to be filed.\n", "metadataJson": "{\"section_url\": \"/articles/article-30-subdivision/#306-preliminary-plan-requirements\"}"}, {"title": "30.7 FINAL PLAT REQUIREMENTS", "text": "A. The final subdivision plat shall be prepared by a registered surveyor and shall be drawn to a scale of not smaller than 100 feet equal to one inch and shall contain the following information:\nThe exact boundary of the tract of land being subdivided, showing clearly the disposition of all portions of the tract.\nThe lines and names of all streets, alley lines, lot lines, lot and block numbers, building setback lines, easements, reservations, on-site demolition landfills, and areas dedicated to public purpose, with notes stating their purposes.\nFor all lots subject to flooding, the plat shall be inscribed with a statement declaring as such and any other applicable conditions governing the development of the subject lot. This statement shall be furnished by the City based on the current edition of the plat review checklist.\n\nFor plats with multiple lots subject to flooding, in addition to the statement above, the plat may have stormwater protection elevations in tabular form.\n\n\nIn areas where floodplain regulations apply, the plat shall be inscribed with a statement declaring as such and any other applicable conditions governing the development of the areas on the plat. This statement shall be furnished by the City based on the current edition of the plat review checklist.\nAny amendment to a previously approved final plat shall note in writing on the amended plat the nature and extent of the changes and the deed or plat book and page number where previously recorded.\nSufficient data to readily determine and accurately reproduce in the field, to include:\n\nThe location, bearing, and length of:\n\nEvery street line, alley line, lot line, and building line.\nBoundary lines of reserved or dedicated areas.\nEasements required by this article, of record in the County, otherwise committed, or ascertainable by physical inspection of the property.\n\n\n\n\nAll linear dimensions shall be in feet and hundredths thereof. The maximum allowable error of linear closure shall not be in excess of 1:10,000. In closed traverses, the sum of the measured angles shall vary with the theoretical sum by a difference not greater than an average of 7.5 seconds per angle, or the sum of the total shall not differ from the theoretical sum by more than 90 seconds, whichever is smaller.\n\nAs-built drawings and plans of all water system, sewer system, and storm drainage system facilities. Such plans should show all easements and/or rights-of-way to demonstrate that the facilities are properly placed. These drawings need not be placed on the final plat but shall be submitted at the time of the request for final plat approval or release of any performance guarantee for required improvements, whichever comes later.\nThe name of the township in which the subdivision is located, the name of the subdivision, the name of the owner, the name, registration number and seal of the registered surveyor under whose supervision the plat was prepared, the date of the plat and a north point oriented as per state statutes, and a small vicinity map showing the location of the subdivision with respect to adjacent streets and properties.\nThe accurate location of monuments which shall be established along the rear property lines of lots with a minimum of two per phase including coordinates computed from the North Carolina State Plane Rectangular Coordinate System as extended there from. Design and materials shall be in accordance with the standard detail contained in the CLDSM.\nA certificate signed by the surveyor meeting the requirements of N.C.G.S. § 47-30 for proof upon oath that the plat is in all respects correct, written as follows:\n\n“The undersigned surveyor, being duly sworn, deposes and says that the plat upon which this certificate appears was prepared in accordance with N.C.G.S. § 47-30 as amended, is in all respects correct according to the best of their knowledge and belief, and was prepared from an actual survey made by them on the __ day of _____, 20___, with maximum linear error of closure of _____, and a maximum field error of angular closure of _____.”\n\n\nIf the subdivision is wholly or partially located in the ANDO Airport Noise Disclosure Overlay District, a disclosure notice as per the requirements of Section 14.8 shall be inscribed on the plat.\nB. The final plat for a site with multiple residential buildings, including multi-dwelling developments, multi-use buildings with a residential component, and mixed-use developments shall be prepared in accordance with the above requirements and shall also contain the following additional information:\nThe use, minimum and maximum height, and location of all buildings and structures other than single-family and duplex dwellings.\nAll land uses and number of dwelling units.\nThe location, use, improvements, ownership, and manner of maintenance of all common areas.\n", "metadataJson": "{\"section_url\": \"/articles/article-30-subdivision/#307-final-plat-requirements\"}"}, {"title": "30.8 PROCEDURES FOR SUBDIVISION APPROVAL", "text": "A. Preliminary Plan\nA preliminary plan of a proposed subdivision, developed in accordance with the specifications set forth in Section 30.6, shall be submitted to the Planning Department.\nSubmission of a preliminary plan shall be via the method, mode, and number (as applicable) as prescribed by Planning Department staff to the applicant.\nB. Time Limits\nTime limits for reviewing complete applications are as follows in Table 30-1: Time Limits.\n\nThe time limits do not apply to plans for which no sketch plan has been prepared and submitted to the Planning Department staff or to plans which contain any proposed school, park, greenway, or other public facility for which reservation is required. The applicant may consent to an extension of any of the time limits in Table 30-1. Should the staff fail to respond within the time limits set out, the application shall be considered to be denied, and the applicant may appeal the denial to the UDO Board of Adjustment.\nC. Waiver of Preliminary Plan RequirementThe required preliminary plan may be waived by the Planning Department for limited minor or minor subdivisions, including metes and bounds subdivisions. Such applications shall be designated “minor subdivisions,” provided:\nSuch land abuts a street of required width and is so situated that no new streets are proposed, and no improvements are required to be installed by the subdivider according to this article.\nA plat of the tract being subdivided, accompanied by an application signed by the owner/developer and/or their duly authorized agent, has been filed with the Planning Department staff.\nThe subdivider may be required to submit topographic information to determine flood elevations whenever the property proposed to be subdivided or re-subdivided is traversed by or adjacent to a known watercourse. If the preliminary plan requirement is waived, a final plat shall be prepared and recorded as provided in Section 30.7.\nThe required preliminary plan may also be waived by the Planning Department for limited minor subdivisions and/or those subdivisions which do not involve the dedication of a new street.D. Final Plats\nUpon approval of the preliminary subdivision plan by the Planning Department, the subdivider may proceed with the preparation of the final subdivision plat. The final plat may include all or only a portion of the subdivision as proposed and approved on the preliminary plan, provided that all required improvements to any existing or new street shown on the preliminary plan within the boundaries of the final plat have been provided for or been assured by the posting of a performance guarantee as provided for in Section 30.13 prior to any final plat approval. The final plat shall be developed in accordance with the specifications set forth in Section 30.7.\nSubmission of an official final plat for approval, and for recordation purposes, shall be via the method, mode, and number (as applicable) as prescribed by Planning Department staff to the subdivider.\nThe Planning Department shall approve final plats which comply with the requirements of this article within 30 days after complete submission.\nE. Decisions for Preliminary Subdivision Plan and Final Subdivision Plat ReviewPreliminary plans and final plats will be reviewed by the Planning Department for compliance with the applicable standards of this article. In addition, the following agencies shall be given an opportunity to make recommendations concerning a subdivision plat prior to approval:\nNorth Carolina Department of Transportation (NCDOT) District Engineer as to proposed state streets, state highways, and related drainage systems.\nCounty health director or local public utility, as appropriate, as to proposed water or sewerage systems.\nAny other agency or official designated by the Planning Department.\nAny preliminary subdivision plan or final plat approval or denial shall be in writing and shall be issued in print or electronic form. Any approval issued exclusively in electronic form shall be protected from further editing once issued. The written notice shall be delivered to applicant and property owner, if the property owner is not the applicant, by personal delivery, electronic delivery, or first-class mail through the U.S. Postal Service. The notice shall be sent to the last address listed for the property owner or the affected property on the Mecklenburg County tax abstract, and to the address provided in the application if the owner is not the petitioner.F. Appeals of Decisions for Preliminary Subdivision Plan and Final Subdivision Plat Review\nThe property owner or applicant shall have 30 days from receipt of the written notice of decision within which to file an appeal with the SSI Administrator. Any other person with standing to appeal has 30 days from receipt from any source of actual or constructive notice of the decision within which to file an appeal. In the absence of evidence to the contrary, notice given by first-class mail is deemed received on the third business day following deposit of the notice for mailing with the U.S. Postal Service. The appeals process is described in Article 37.\nThe UDO Board of Adjustment shall follow the appeal procedures specified in Article 37. The UDO Board of Adjustment may affirm, reverse, or modify the decision under appeal, making findings of fact and conclusions of law to support its decision.\nAppeals of the UDO Board of Adjustment decision may be made to Mecklenburg County Superior Court.\nG. Effect of Approval of Preliminary PlanA preliminary plan approved under this article shall be valid for a period of three years from the date of approval. If no work on the site in furtherance of the plan has commenced within the three year period, the preliminary plan approval shall become null and void, and a new application shall be required to develop the site. If work on the site in furtherance of the plan has commenced that involves any utility installations included in the approval or street improvements except grading, the plan shall remain valid and in force, and the subdivision may be completed in accordance with the approved plan.H. Release of Grading PermitPreliminary plan approval is required for the issuance of a grading permit for any grading work on the site for the installation of any improvements in furtherance of the development. The release of the grading permit may be authorized by the Planning Department staff prior to the approval of the preliminary plan, if the matters staying the approval are not related to nor shall influence the need for grading on the site. Once the preliminary plan is approved, further approvals under this subsection are not required for granting permits for individual sites within the development.", "metadataJson": "{\"section_url\": \"/articles/article-30-subdivision/#308-procedures-for-subdivision-approval\"}"}, {"title": "30.9 PLATS ALREADY ESTABLISHED BY SURVEY", "text": "A. Plans for subdivisions of land previously approved by the City Planning Board or the Charlotte-Mecklenburg Planning Commission, but not recorded by the County Register of Deeds prior to February 29, 1956, shall be approved for recording without complying with the requirements of this article if the plat conforms to the previously approved plan.B. Plats already established by survey and recorded in the office of the County Register of Deeds prior to the effective date of the Ordinance from which this article derives shall be eligible for development and other administrative permits without complying with the requirements of this article, but shall be developed in accordance with the provisions of the subdivision regulations and/or ordinance in effect at the time of its approval.", "metadataJson": "{\"section_url\": \"/articles/article-30-subdivision/#309-plats-already-established-by-survey\"}"}, {"title": "30.10 DRAINAGE", "text": "New subdivisions, as defined by this article, shall provide storm drainage per the requirements of Section 24.3.B.5.", "metadataJson": "{\"section_url\": \"/articles/article-30-subdivision/#3010-drainage\"}"}, {"title": "30.11 NO SERVICE UNLESS STREET ACCEPTED OR TENTATIVELY APPROVED", "text": "No department, officer, or employee of the City shall accept for maintenance, lay out, open, improve, grade, pave, or light any streets or authorize the laying of water mains, sewers, connections, or other facilities or utilities in any street within the City unless:\nSuch street has been accepted or opened as, or has otherwise received the legal status of, a public street prior to the effective date of the Ordinance from which this article derives; or\nFor any new street, such street corresponds in its location and lines with a street shown on a preliminary subdivision plat, tentatively approved by the Planning Department or Charlotte-Mecklenburg Planning Commission; or\nSuch street has been accepted as a public street by a vote of a majority of all the members of the City Council or by the state; or\nSuch street is an approved network-required private street built in conformance with the provisions of this Ordinance.\n", "metadataJson": "{\"section_url\": \"/articles/article-30-subdivision/#3011-no-service-unless-street-accepted-or-tentatively-approved\"}"}, {"title": "30.12 STANDARDS AND SPECIFICATIONS", "text": "A. Unless specifically noted, before any final plat of a subdivision is eligible for final approval, or before any street is accepted for maintenance by the City or by the NCDOT, minimum improvements, including drainage and soil erosion, shall have been completed by the developer and approved by the Planning Department in accordance with the standards and specifications of the CLDSM or subject to a performance guarantee in accordance with Section 30.13.C.B. This Ordinance prescribes minimum requirements for storm drainage and street improvements to be undertaken by the developer. Satisfactory completion of these improvements, attested by approval of the Planning Department, shall qualify streets in the City to be accepted for maintenance by the City and streets in the extraterritorial jurisdiction (ETJ) to be considered for maintenance by the NCDOT.", "metadataJson": "{\"section_url\": \"/articles/article-30-subdivision/#3012-standards-and-specifications\"}"}, {"title": "30.13 PERFORMANCE GUARANTEES", "text": "A. In subdivisions adjoining already established streets that have been accepted for maintenance by the City or the NCDOT, the requirements of this section shall apply as follows:\nWhere the adjoining established street is a part of the City’s or the NCDOT’s street system, the adjoining street shall be improved in accordance with either the requirements of this Part and the requirements of the City or the NCDOT, whichever establishes the higher standard.\nThe requirements of this section are not applicable for the general removal and reconstruction of established permanent pavements.\nB. Plats for new lots fronting on already dedicated or established streets that have not been accepted for maintenance by the City or the NCDOT, or which have been accepted for maintenance by the NCDOT but have not been improved with a paved roadway, shall be eligible for final approval when the improvement requirements of this Part have been complied with as closely as may reasonably be required considering the existing condition of the street, the extent of area to be platted and the cost of required improvements in relation to the comparative benefits to accrue to the subdivider and the other owners of property on both sides of the street.C. Where the improvements required by this article have not been completed prior to the submission of the final subdivision plat for approval, the approval of the plat shall be subject to the owner filing a performance guarantee with the Planning Department. The amount of the performance guarantee shall not exceed 125% of the reasonably estimated cost of completion at the time the performance guarantee is issued.D. The developer shall have the option to post one type of a performance guarantee, in lieu of multiple bonds, letters of credit, or other equivalent security, for all matters related to the same project requiring performance guarantees. Performance guarantees associated with erosion control and stormwater control measures are not subject to the provisions of this section.E. The City, in consultation with other affected agencies holding performance guarantees for the installation of required improvements, shall determine the amount of the performance guarantee or use a cost estimate determined by the developer. The reasonably estimated cost of completion shall include 100% of the cost for labor and materials necessary for completion of the required improvements. Where applicable, the costs shall be based on unit pricing. The additional 25% allowed under this section includes inflation and all costs of administration regardless of how such fees or charges are denominated. The duration of the performance guarantee shall initially be one year, unless the developer determines that the scope of work for the required improvements necessitates a longer duration. The amount of any extension of any performance guarantee shall be determined according to the procedures for determining the initial guarantee and shall not exceed 125% of the reasonably estimated cost of completion of the remaining incomplete improvements still outstanding at the time.F. Upon completion of the improvements and the submission of as-built drawings, as required by this section, written notice thereof shall be given by the subdivider to the appropriate department. The Planning Department shall arrange for an inspection of the improvements and, if found satisfactory, shall, within 30 days of the date of the notice, provide written acknowledgement to the developer that the required improvements have been completed and authorize in writing the release or return of the performance guarantees given.", "metadataJson": "{\"section_url\": \"/articles/article-30-subdivision/#3013-performance-guarantees\"}"}]}