{"title": "Article 24. Drainage", "metadataJson": "{\"base_url\": \"article-24-drainage\"}", "section": [{"title": "24.1 PURPOSE", "text": "The regulations for storm drainage are intended, to the maximum extent practicable, to allow for the lawful and orderly development of lands within the City and extraterritorial jurisdiction (ETJ) while managing stormwater responsibly. Specifically, they are intended to:\nCoordinate site drainage to protect existing and proposed buildings and structures.\nCoordinate storm drainage infrastructure with existing or planned streets or public facilities.\nCreate a storm drainage network that facilitates development of an entire neighborhood or area of the City.\nPreserve and enhance the quality of the City’s natural features and natural resources.\nProtect the public health, safety, and welfare with respect to stormwater drainage.\n", "metadataJson": "{\"section_url\": \"/articles/article-24-drainage/#241-purpose\"}"}, {"title": "24.2 APPLICABILITY", "text": "All development, including any affiliated construction and/or installation of storm drainage, within the City and its ETJ shall provide adequate drainage controls and conveyance in accordance with this section. The following activities require a storm drainage plan and permit approved by Storm Water Services:A. Construction or expansion of any building, structure, driveway, street, or parking lot.B. Installation, modification, creation, or connection of any of the following items within a stormwater-related easement recorded with the Mecklenburg County Register of Deeds or within the right-of-way of a publicly maintained street. Stormwater related easement, for the purposes of this article includes, but is not limited to, storm drainage easements (SDE), public storm drainage easements (PSDE), and conservation easements:\nStorm drainage pipes, catch basin, manhole structures, ditches, swales, curb and gutter, or other similar items.\nNew driveway aprons or modifications to existing driveway aprons with driveway pipes on existing ditch-type streets or with a catch basin located within ten feet of driveway.\nRetaining walls or privacy/screening walls.\nC. Installation, modification, creation, or connection of storm drainage pipes, catch basins, manhole structures, ditches, swales, curb and gutter, or similar items that convey runoff from a publicly maintained street.D. Land disturbance to perform cut, fill, or recontouring of the land that will modify or impact existing surface drainage features or patterns.", "metadataJson": "{\"section_url\": \"/articles/article-24-drainage/#242-applicability\"}"}, {"title": "24.3 STORM DRAINAGE STANDARDS", "text": "All land disturbing activities shall provide adequate storm drainage in accordance with this article sufficient to achieve purposes as outlined in Section 24.1 above. Persons conducting the land disturbing activity shall take all reasonable measures to protect all public and private property from damage caused by such activity and associated storm drainage.A. Encroachments\nUnless otherwise approved by the Stormwater Administrator, buildings, additions, accessory structures, other permanent structures, including but not limited to swimming pools, retaining walls, and brick walls, shall:\n\nNot be allowed within a stormwater-related easement.\nNot be allowed within 7.5 feet of the centerline of storm drainage pipes that convey runoff from a public street.\n\nAdditional requirements may apply to this minimum standard where there are conditions such as deep pipes, building foundation load plane influence above or into the side of a pipe, or other engineering or maintenance concerns. The City may require a cross-section plot that demonstrates that the building foundation load plane crosses below any adjacent existing or proposed storm pipes. If determined to be necessary, any of the following may be required as determined by the Stormwater Administrator:\n\nThe minimum required distance of the structure from the piped underground storm drainage may be expanded.\nAn extended (deep) footer may be required to ensure that the load plane is moved below the pipe.\n\n\n\n\nNot be allowed within ten feet of the centerline of a storm drainage ditch, swale or channel that conveys runoff from a public street.\n\n\nUnless otherwise approved by the Stormwater Administrator, it shall be unlawful to obstruct or in any way interfere or conflict with storm drainage located in a street right-of-way or within an SDE. The City may require the property owner or person responsible for the obstruction to remove it within a reasonable period. The City shall take into consideration the technology, quantity of work required, degree of risk or harm, and shall set reasonable and attainable time limits. The City may, at its option, remove an obstruction and charge the expense of the removal, restoration, and repair to the person who places or maintains the obstruction.\nIf any part of a proposed lot or development connects to an existing drainage system within a street right-ofway or within a stormwater-related easement, construction methods and materials within the street right-of-way or within a stormwater-related easement shall meet the City’s requirements, which may be satisfied using details provided in the Charlotte Land Development Standards Manual (CLDSM) or other designs reviewed and approved by the Stormwater Administrator.\nB. Management of Stormwater Runoff and Conveyance\nStorm drainage shall be provided to allow for the disposal of surface water runoff. To the maximum extent practicable, storm drainage shall function to protect streets, buildings and structures, and to provide positive drainage for all developed and graded areas.\nDrainage of any surface on the property, whether pervious or impervious, shall not be discharged in a manner that creates flooding.\nLand disturbing activities shall not restrict or block the storm drainage so as to obstruct or interrupt the natural flow of waters on the property, create standing water thereon, or cause flooding of neighboring properties. Grading activities shall not block the natural flow of drainage.\nNew or modified storm drainage that conveys runoff from a publicly-maintained street shall comply the City’s requirements, which may be satisfied using designs contained in the current edition of the CLDSM and the Charlotte-Mecklenburg Storm Water Services Design Manual or other designs reviewed and approved by the Stormwater Administrator. Where existing public or private storm drainage is reasonably available, the new or modified storm drainage shall connect to the existing public or private storm drainage (including all grading and structures necessary to properly connect). When connecting to existing storm drainage systems on another property, good faith efforts shall be made to obtain permission for offsite work. If improving an existing drainage system to meet standards creates adverse hydraulic impacts on the upstream or downstream drainage system, the City may allow alternatives.\nStorm drainage that meets the Charlotte-Mecklenburg Storm Water Services Design Manual shall be provided throughout a subdivision.\nStorm drainage installed or modified that conveys runoff from a publicly maintained street shall provide an SDE. The widths for SDE’s shall meet the City’s requirements. The CLDSM shows acceptable minimum widths for easements. The SDE shall be shown on a plat for the property. The purpose of the SDE is to provide stormwater conveyance. Buildings are not permitted in the SDE area. Any other objects that impede storm water flow or system maintenance are also prohibited. Maintenance of the storm drainage within the easement is the responsibility of the property owner unless conveyed to and accepted by the City of Charlotte or Mecklenburg County.\nC. Properties Subject to FloodingAll streams in the City that drain one square mile or greater are regulated by the floodplain regulations of Article 27. However, flooding also occurs in areas that drain less than one square mile. This section applies to those areas not regulated by Article 27 that are expected to drain 50 cubic feet (50ft3) per second or more for the 100-year storm (hereinafter referred to as “properties subject to flooding”).\nAn applicant shall be required to determine the 100-year (1%) flood elevation where any part of an existing property or proposed lot is subject to flooding, and construction of any new habitable building or structure, or an expansion to an existing habitable building or structure is proposed. The 100-year (1%) flood elevation shall include all areas of the site where a flood has a 1% chance of being equaled or exceeded in any given year in accordance with generally accepted engineering practice, which is to be submitted with the seal and signature of a Licensed Professional Engineer as part of the storm drainage plan. The elevation one foot above the 100-year (1%) flood elevation shall be known and identified as the “100+1 Stormwater Elevation Line (SWEL).”\nAll habitable buildings or structures shall be located outside the SWEL or the lowest usable and functional part of the building or structure shall not be below the Stormwater Protection Elevation (SWPE). “Usable and functional part of the building or structure” shall be defined as being inclusive of, but not limited to, living areas, basements, sunken dens, basement utility rooms, crawlspaces, attached carports, attached garages and mechanical appurtenances such as furnaces, air conditioners, water pumps, electrical conduits and wiring, but shall not include water lines or sanitary sewer traps, piping and clean-outs, provided openings serving the structure are above the SWPE.\nNo proposed property that is wholly or partly subject to flooding shall be approved unless the SWEL is established on the final plat by field survey. Such line shall be known and identified on the final plat as the “100+1 Stormwater Elevation Line (SWEL).” In addition, the SWPE for each property subject to flooding shall be noted on the plan and plat based on, either of the following, whichever is greater:\n\nThe SWEL; or\nFor properties upstream of street crossings, the low elevation of the street plus one foot.\n\n\nAlso, the plat for all properties subject to flooding shall include the following note:\n\n“This property is subject to flooding during heavy rainfall, and the construction of buildings or structures below the stormwater protection elevation is prohibited.”\n\n\n\nThe Stormwater Administrator may waive this requirement if all of the following conditions exist:\n\nThe SWEL does not exceed the required minimum front, side, or rear setback line.\nThe estimated runoff or proposed modifications to a storm water conveyance would not create a hazard for the adjacent properties or residents.\nThe flood limits would not be of such magnitude that adjacent property owners should be informed of these limits.\n\n\nSubdivisions\nFor subdivisions, where only a portion of a proposed lot is subject to flooding as defined herein, such lot may be approved only if there will be available for building a usable lot area of not less than 1,200 square feet. The usable lot area shall be determined by deducting from the total lot area the area of all setbacks required by the applicable zoning district regulations and any remaining area of the lot lying below the SWEL.During the construction of a subdivision, the developer shall maintain the streambed of each stream, creek, or backwash channel contiguous to the subdivision in an unobstructed state and shall remove from the channel and banks of the stream all debris, logs, timber, junk and other accumulations of a nature that would, in time of flood, clog or dam the passage of waters in their downstream course. Installation of appropriately sized stormwater drains, culverts, bridges or erosion control devices will not be construed as obstructions in the stream.", "metadataJson": "{\"section_url\": \"/articles/article-24-drainage/#243-storm-drainage-standards\"}"}, {"title": "24.4 ADMINISTRATION", "text": "A. Appeals and variances of this article shall be subject to Article 37.B. Inspections and enforcement actions of this article shall be subject to Article 39.", "metadataJson": "{\"section_url\": \"/articles/article-24-drainage/#244-administration\"}"}, {"title": "24.5 STORMWATER ADMINISTRATOR", "text": "A. DesignationThe Director of the City of Charlotte department responsible for management of the City’s NPDES MS4 Stormwater permit has been designated as the Stormwater Administrator. The Stormwater Administrator, or their designee, is authorized to administer and enforce Article 24.B. Powers and DutiesIn addition to the powers and duties that may be conferred by other provisions of this Unified Development Ordinance and other laws, the Stormwater Administrator shall have the following powers and duties under this article:\nTo review and approve or disapprove applications submitted pursuant to Article 24.\nTo make determinations and render interpretations of Article 24.\nTo establish application requirements and schedules for submittal and review of applications and appeals.\nTo enforce Article 24 in accordance with its enforcement provisions in Article 39.\nTo maintain records, maps, and official materials as they relate to the adoption, amendment, enforcement, or administration of Article 24.\nTo provide expertise and technical assistance upon request to the City Council and the UDO Board of Adjustment.\nTo designate appropriate other person(s) who shall carry out the powers and duties of the Stormwater Administrator.\nTo provide information and recommendations relative to variances and information as requested by the UDO Board of Adjustment in response to appeals.\nTo prepare and make available to the public a Stormwater Regulations Administrative Manual.\nTo take any other action necessary to administer the provisions of Article 24.\n", "metadataJson": "{\"section_url\": \"/articles/article-24-drainage/#245-stormwater-administrator\"}"}]}