{"title": "Article 21. Loading Spaces & Service Areas", "metadataJson": "{\"base_url\": \"article-21-loading-spaces-service-areas\"}", "section": [{"title": "21.1 REQUIRED LOADING SPACES", "text": "A. The minimum number of off-street loading spaces shall be provided in accordance with the requirements of Table 21-1: Minimum Required Off-Street Loading Spaces. Nothing herein prevents the construction of additional loading spaces above the required minimums.B. The minimum required number of off-street loading spaces may be part of a loading dock or may be freestanding.C. No more than five loading spaces are required for any single building.D. Loading spaces shall be required for new construction. Existing buildings without loading spaces or with fewer loading spaces than required by this section, as of the effective date of this Ordinance, are exempt from these loading space requirements.", "metadataJson": "{\"section_url\": \"/articles/article-21-loading-spaces-service-areas/#211-required-loading-spaces\"}"}, {"title": "21.2 DESIGN OF REQUIRED LOADING SPACES", "text": "A. A loading space shall be located on the site it serves, shall not be located within any required setback, and shall be a minimum size of 10’ by 25’.B. Any area required for maneuvering a vehicle utilizing a loading space shall be of an adequate size and design to accommodate that maneuverability entirely on the same site as the use it serves, not on any public right-of-way, network-required private street, or other site, and shall not be located within any required setback.C. If a parcel has multiple frontages, then exterior loading spaces or driveway access to loading spaces shall not be located on a primary frontage. If this requirement creates a public safety issue or impacts operations, the Zoning Administrator may modify this requirement or provide an alternative standard. If all frontages are primary frontages, the Zoning Administrator will determine the frontage where it shall be located with minimal disruption to vehicles and pedestrians in the right-of-way.D. Loading spaces may be located in a surface parking lot.E. Loading spaces may be located on the exit portion of a driveway stem when the driveway has two points of ingress and egress. Loading spaces shall be located a minimum of 20 feet behind any required setback and any sidewalk or other pedestrian facilities. The requirement for two access points may be waived if the loading vehicle is able to turn around on the site.F. Loading space design shall be shown on all site plans including, but not limited to, loading space location and dimension, clearance, driveway access to loading spaces, and maneuvering areas and access aisles.G. Loading spaces shall not be utilized for placement or storage of any large waste or recycling containers. LOADING SPACES ON DRIVEWAY STEM", "metadataJson": "{\"section_url\": \"/articles/article-21-loading-spaces-service-areas/#212-design-of-required-loading-spaces\"}"}, {"title": "21.3 REQUIRED SOLID WASTE AND RECYCLING SERVICE AREAS", "text": "The purpose of the solid waste and recycling service area standards is to provide safe and convenient access for users and service providers during the depositing and collection of solid waste and recyclable materials and to encourage waste reduction. Where the standards of this section for required solid waste and recycling service areas conflict with Chapter 10, Chapter 10 of the City Code shall control. In addition to the standards below, Mecklenburg County has a separate Commercial Source Separation Ordinance, which may also apply. Nothing herein prevents the construction of additional solid waste service areas above the required minimums.A. Residential Development1. ApplicabilityMulti-family dwellings, both stacked and attached, are required to construct on-site space for each large waste container and each recycling station as required by this section.2. Large Waste ContainersSpaces for large waste containers shall be required as follows:\nDevelopments of 11 Dwelling Units or LessNo space is required to be constructed if a large waste container is not used for collection. Where any such development does use a large waste container for collection, the minimum space constructed shall be large enough to fit an eight cubic yard dumpster-type large waste container.\nDevelopments of 12 Dwelling Units or MoreThe minimum space constructed shall be large enough to fit an eight cubic yard dumpster-type large waste container per every 30 units or an eight cubic yard compactor-type large waste container per every 90 units. Large waste containers may be distributed throughout the development. For developments eligible to utilize a compactor-type large waste container, nothing in this section shall preclude such development from utilizing a compactor-type large waste container larger than eight cubic yards by volume.\n3. Recycling Stations\nThe number of residential recycling station spaces shall be provided in accordance with Table 21-2: Required Residential Recycling Station Spaces.\nEach required residential recycling station represents space constructed for five 96 gallon carts and is approximately 144 square feet. Recycling stations may be distributed throughout the development. However, space constructed for each individual recycling station shall be a minimum of 144 square feet in area with a minimum width of 34 inches and accommodate five 96 gallon carts.\nB. Nonresidential DevelopmentIf large waste containers and recycling stations are provided within a nonresidential development, service areas shall be constructed on-site for each large waste container and each recycling station as follows:\nAny service area in a nonresidential development constructed for a large waste container shall be large enough to fit an eight cubic yard dumpster-type large waste container or compactor-type large waste container. If more than one large waste container is provided per this standard (dumpster-type or compactor-type), then the minimum service area constructed shall be large enough to accommodate all the large waste containers on the lot. Sufficient space to allow a collection vehicle to service the container shall be required as per Section 21.4.\nThe service area in a nonresidential development constructed for recycling shall be at least of equal size as the service area constructed for solid waste containers as required in item 1 above. Sufficient space to allow a collection vehicle to service the container shall be required as per Section 21.4.\n", "metadataJson": "{\"section_url\": \"/articles/article-21-loading-spaces-service-areas/#213-required-solid-waste-and-recycling-service-areas\"}"}, {"title": "21.4 DESIGN OF REQUIRED SOLID WASTE AND RECYCLING SERVICE AREAS", "text": "Where the standards of this section for the design of required solid waste and recycling service areas conflict with Chapter 10, Chapter 10 of the City Code shall control.A. All large waste container and recycling station spaces shall be located entirely on the same site as the use it serves and shall be located a minimum of 25 feet from: 1) any property in a Neighborhood 1 Place Type or Neighborhood 2 Place Type; 2) public streets; and 3) network-required private streets.\nSolid waste and recycling service areas may be located on the exit portion of a driveway stem when the driveway or the development has two points of ingress and egress. Container placement shall be located a minimum of 20 feet behind any required setback and any sidewalk or other pedestrian facilities. See illustration example in Section 21.2. The requirement for two access points may be waived if the loading vehicle is able to turn around on the site.\nB. If a parcel has multiple frontages, large waste container and recycling station spaces located outside shall not be located on a primary frontage. If this requirement creates a public safety issue or impacts operations, the Zoning Administrator may modify this requirement or provide an alternative standard. If all frontages are primary frontages, the Zoning Administrator will determine the frontage where it shall be located with minimal disruption to vehicles and pedestrians in the right-of-way.C. Any area required for maneuvering a vehicle for the collection of waste containers and recycling stations shall be of an adequate size and design to accommodate that maneuverability entirely on the same site as the use it serves, and not on any public right-of-way, network-required private street, or other site, and shall not be located within any required setback.\nSolid waste service vehicle maneuvering areas are allowed to back-up within the site when maneuvering, but shall not encroach into the setback, sidewalk, or public right-of-way.\nD. The CDOT Director, in consultation with the Solid Waste Director, may modify the requirement for providing required on-site maneuvering space for large waste containers and/or recycling stations and the containers may be located on-street for pick-up for multi-family developments that either do not provide on-site parking or provide all parking within a parking structure, under the following scenarios:\nMulti-family developments of 50 units or less where all the following conditions are met:\n\nThe collection containers shall not obstruct vehicular and/or pedestrian traffic. Sidewalks shall remain unobstructed.\nThe collection containers shall be removed from their on-street collection location and returned to the building or structure on the same day of collection.\nThe collection containers are serviced from a collector or local street.\n\n\nThe site is located in an IC-2, RC, IMU, NC, CAC-1, CAC-2, RAC, UE, UC, TOD-CC, TOD-NC, or TOD-UC Zoning District where all the following conditions are met:\n\nThe standards of items 1.a, 1.b, and 1.c above are met.\nIt shall be demonstrated that on-site collection cannot be provided due to site constraints or unusual circumstances.\nIt shall be demonstrated that Section 21.4.B.1 cannot be reasonably accommodated on the site.\nIf the street does not already include curb-to-curb dimensions of a collector or office/commercial wide street, the curb shall be moved to reflect the office/commercial wide cross-section along the affected frontage. If the exception listed in Section 32.7.C.3.b.iii applies and the curb-to-curb dimension cannot be provided, the exception shall not apply.\nOn-street collection spaces shall be clearly marked and designed to prevent intrusion into adjacent parking spaces.\n\n\nE. Solid waste service and maneuvering areas shall be shown on all site plans. Information to be provided shall include, but is not limited to, service area locations and dimensions, any required height clearance, driveway access to service areas, and maneuvering areas and access aisles.", "metadataJson": "{\"section_url\": \"/articles/article-21-loading-spaces-service-areas/#214-design-of-required-solid-waste-and-recycling-service-areas\"}"}]}