{"title": "Article 34. Other Infrastructure", "metadataJson": "{\"base_url\": \"article-34-other-infrastructure\"}", "section": [{"title": "34.1 DRAINAGE", "text": "Adequate storm drainage shall be provided, in the public interest, to allow the proper regulation and disposal of surface water runoff. Storm drainage shall be constructed in accordance with the Charlotte-Mecklenburg Storm Water Services Design Manual, the Charlotte Land Development Standards Manual (CLDSM), and Article 24.", "metadataJson": "{\"section_url\": \"/articles/article-34-other-infrastructure/#341-drainage\"}"}, {"title": "34.2 WATER SUPPLY", "text": "Water supply facilities shall be installed in accordance with one of the following provisions:A. Via a public water system owned and operated by Charlotte Water and meeting the requirements of Charlotte Water, including the standards and specifications of:\nCharlotte Water, Water and Sewer Design and Construction Standards.\nMecklenburg County Groundwater Well Regulations\nCity code.\nState regulations.\nB. Via a water system owned and operated by a private entity. A private system providing water to any structure shall be reviewed and approved by the applicable agencies with jurisdiction over such approval.\nGroundwater well systems shall meet the requirements of the Mecklenburg County Groundwater Well Regulations.\n", "metadataJson": "{\"section_url\": \"/articles/article-34-other-infrastructure/#342-water-supply\"}"}, {"title": "34.3 WASTEWATER SEWER", "text": "Wastewater sewer facilities shall be installed in accordance with one of the following provisions:A. Via a public wastewater system owned and operated by Charlotte Water and meeting the requirements of Charlotte Water, including the standards and specifications of:\nCharlotte Water, Water and Sewer Design and Construction Standards.\nCity code.\nState regulations.\nB. Via a wastewater system owned and operated by a private entity. A private system providing wastewater collection to any structure shall be reviewed and approved by the applicable agencies with jurisdiction over such approval.", "metadataJson": "{\"section_url\": \"/articles/article-34-other-infrastructure/#343-wastewater-sewer\"}"}, {"title": "34.4 UNDERGROUND UTILITIES", "text": "A. Required Underground Utility LinesAny new utility lines required as part of a subdivision, as defined per Section 30.3.A, or development project, shall be buried in all zoning districts except the following:\nCG and CR Zoning Districts\nML-1 and ML-2 Zoning Districts\nMHP Zoning District\nB. ExemptionsElectrical power lines shall not be required to be installed underground for subdivisions, as defined per Section 30.3.A, if the following conditions exist:\nThe electrical power lines existed above ground at the time of first approval of a plat or development plan, whether or not the power lines are subsequently relocated during construction of the subdivision or development plan; and\nThe power lines are located outside the boundaries of the parcel of land that contains the subdivision, or the property covered by the development plan.\n‍", "metadataJson": "{\"section_url\": \"/articles/article-34-other-infrastructure/#344-underground-utilities\"}"}]}