{"title": "Article 35. Ordinance Bodies & Administrators", "metadataJson": "{\"base_url\": \"article-35-ordinance-bodies-administrators\"}", "section": [{"title": "35.1 CITY COUNCIL", "text": "A. Powers and DutiesThe City Council shall have the following powers and duties to be carried out in accordance with this Ordinance that include, but are not limited to, the following:\nTo initiate and make amendments to the text of this Ordinance and to the Zoning Map.\nTo hear, review, and adopt or reject amendments to the text of this Ordinance and to the Zoning Map.\nTo take any such other action not delegated to the Planning Commission or the UDO Board of Adjustment as the City Council may deem desirable and necessary to implement the provisions of this Ordinance.\nB. Conflicts of InterestEach member shall comply with the conflicts of interest standards in Section 35.6.", "metadataJson": "{\"section_url\": \"/articles/article-35-ordinance-bodies-administrators/#351-city-council\"}"}, {"title": "35.2 PLANNING COMMISSION", "text": "A. Powers and DutiesThe Planning Commission, or applicable committee of the Planning Commission, in accordance with this Ordinance, shall have the following powers and duties that include, but are not limited to, the following:\nTo initiate, review, and make recommendations to the City Council regarding UDO amendments and zoning map amendments as per the applicable general statutes and the Interlocal Cooperation Agreement between the City of Charlotte and Mecklenburg County, as may be amended from time to time.\nTo adopt such rules of procedure necessary for the administration of its responsibilities consistent with these regulations.\nB. Membership, Hearings, and Procedures\nMembers of the Planning Commission shall be appointed and removed in accordance with the Interlocal Cooperation Agreement and its adopted rules of procedure.\nThe Planning Commission membership shall meet the proportional extraterritorial representation requirements of N.C.G.S. § 160D-307.\nThe rules of procedure adopted by the Planning Commission will be kept on file at the Planning Department, at the City Clerk’s office, and posted on the Planning Department website.\nEach member shall comply with the conflicts of interest standards in Section 35.6.\nC. Staff\nThe Planning Department staff shall provide support for the Planning Commission in accordance with the Interlocal Cooperation Agreement.\nPlanning Department staff shall comply with the conflicts of interest standards in Section 35.6.\n", "metadataJson": "{\"section_url\": \"/articles/article-35-ordinance-bodies-administrators/#352-planning-commission\"}"}, {"title": "35.3 UDO BOARD OF ADJUSTMENT", "text": "A. Powers and DutiesThe UDO Board of Adjustment, having been established in accordance with Chapter 160D of the North Carolina General Statutes and any applicable legislation, shall have the following powers and duties that include, but are not limited to, the following:\nTo hear and decide appeals of administrative decisions by staff, administrators, directors, and designees in accordance with the appeal provisions of Section 37.8.B.\nTo hear and decide petitions for variances from these regulations in accordance with the provisions of Section 37.8.A.\nTo adopt such rules of procedure necessary for the administration of its responsibilities consistent with these regulations.\nTo recommend approval to the North Carolina Environmental Management Commission (NCEMC) for major watershed variances to the state required watershed regulations or to deny a major watershed variance from the state required watershed regulations per Section 37.8.A.12.\nTo assume any other duties assigned by the City Council.\nEach member shall comply with the conflicts of interest standards in Section 35.6.\nB. Membership, Hearings, and Procedures\nMembers of the UDO Board of Adjustment shall be appointed and removed in accordance with the City Council procedures. Each member shall take an oath of office prior to assuming their duties.\nThe UDO Board of Adjustment membership shall meet the proportional extraterritorial representation requirements of N.C.G.S. § 160D-307.\nRules of procedure adopted by the UDO Board of Adjustment will be available to the public at the Planning Department and at the City Clerk’s office, and posted on the Planning Department website.\nThe UDO Board of Adjustment shall follow the statutory procedures for evidentiary hearings, procedures, and quasi-judicial decisions in Sections 37.8.A. for variances and 37.8.B. for appeals.\nThe UDO Board of Adjustment does not have the jurisdiction to address or rule upon constitutional and federal and state statutory issues or any other legal issues beyond its statutory authority.\nC. Staff\nStaffing for the UDO Board of Adjustment shall be provided by the UDO Administrator.\nStaff shall comply with the conflicts of interest standards in Section 35.6.\n", "metadataJson": "{\"section_url\": \"/articles/article-35-ordinance-bodies-administrators/#353-udo-board-of-adjustment\"}"}, {"title": "35.4 HISTORIC DISTRICT COMMISSION", "text": "A. Powers and DutiesThe Historic District Commission, in accordance with these regulations, shall have the following powers and duties that include, but are not limited to the following:\nTo hear, review, and decide on applications for certificates of appropriateness.\nTo develop and adopt design standards for development within designated historic districts.\nTo adopt rules of procedure necessary for the administration of its responsibilities not inconsistent with these regulations.\nB. Membership, Hearings, and Procedures\nMembers of the Historic District Commission shall be appointed and removed in accordance with the resolutions adopted by the Charlotte City Council and the Mecklenburg County Board of County Commissioners.\nThe officers of the Historic District Commission shall be a Chairperson, a Vice Chairperson, and a Second Vice Chairperson.\nThe Chairperson shall preside at all meetings, appoint all standing and temporary committees, make assignments to design review committee meetings, have the right to vote, and may call special or emergency meetings of the Historic District Commission. The Chairperson or their designee is authorized to sign certificates of appropriateness.\nThe Vice Chairperson shall preside at meetings in the absence of the Chairperson and may call special or emergency meetings of the Historic District Commission. In the absence of both the Chairperson and the Vice Chairperson, the Second Vice Chairperson shall preside and may call special or emergency meetings of the Historic District Commission.\nAt the first regular meeting in June, the Historic District Commission shall elect officers for a term of one year. Officers shall take office on the following July 1st. If an office becomes vacant during a term, the Historic District Commission shall elect one of its members to serve the remaining portion of the unexpired term. Officers shall be eligible for reelection.\nNew Historic District Commission members shall complete the Historic District Commission orientation before voting at a hearing and shall take an oath of office prior to assuming their duties.\nA majority of the members of the Commission shall have demonstrated special interest, experience, or education in history, architecture, archaeology, or related fields.\nRules of procedure adopted by the Historic District Commission shall be available to the public at the Planning Department and in the City Clerk’s office, and posted on the Planning Department website.\nEach member shall comply with the conflicts of interest standards in Section 35.6.\nC. Staff\nStaff shall be provided in accordance with the resolutions adopted by the Charlotte City Council and the Mecklenburg County Board of County Commissioners, and provided by the Planning Department.\nStaff shall comply with the conflicts of interest standards in Section 35.6.\n", "metadataJson": "{\"section_url\": \"/articles/article-35-ordinance-bodies-administrators/#354-historic-district-commission\"}"}, {"title": "35.5 ADMINISTRATORS AND DIRECTORS", "text": "A. AdministratorsThe following individuals, including their designees, are responsible for the administration and enforcement of specific articles in this Ordinance:\nThe UDO Administrator is responsible for the overall administration of the Ordinance. In addition, the UDO Administrator has the following responsibilities:\n\nIn the case of conflicting regulations within this Ordinance, the UDO Administrator shall make the final determination of how the regulations are applicable.\nManage the operation of the UDO Board of Adjustment.\n\n\nThe Zoning Administrator is responsible for enforcing and administering the zoning regulations in Articles 3 through 22, including Section 14.1 (HDO Historic District Overlay) and Section 14.2 (HDO-S) Streetside Historic District Overlay. Additional responsibilities of the Zoning Administrator are found in Articles 37, 38, and 39.\nThe Historic District Administrator is responsible for administering the historic district regulations in Section 14.1 (HDO Historic District Overlay) and Section 14.2 (HDO-S) Streetside Historic District Overlay.\nThe Stormwater Administrator is responsible for enforcing and administering Articles 23 through 26 and Article 28. Additional responsibilities of the Stormwater Administrator are found in Sections 39.1.B, 39.1.D, 39.1.E, 39.2.D, 39.2.F, and 39.2.G.\nThe Floodplain Administrator is responsible for enforcing and administering Article 27. Additional responsibilities of the Floodplain Administrator are found in Section 39.2.B.\nThe Chief Urban Forester is responsible for enforcing and administering Sections 20.13 through 20.18 and Section 39.2.J.\nThe Subdivision, Streets and Infrastructure Administrator is responsible for enforcing and administering Articles 29 through 34. Additional responsibilities of the Subdivision, Streets, and Infrastructure Administrator are found in Sections 39.1.F and 39.2.H.\nB. DirectorsCity of Charlotte and Mecklenburg County department directors, including their designees, are permitted to make certain determinations of requirements within this Ordinance, as described within the Articles.", "metadataJson": "{\"section_url\": \"/articles/article-35-ordinance-bodies-administrators/#355-administrators-and-directors\"}"}, {"title": "35.6 CONFLICTS OF INTEREST", "text": "The North Carolina General Assembly has adopted rules in N.C.G.S. § 160D-109 regarding conflicts of interest for governing boards, appointed boards, and administrative staff:A. City CouncilA City Council member shall not vote on any legislative decision regarding a development regulation, adopted pursuant to this Ordinance where the outcome of the matter being considered is reasonably likely to have a direct, substantial, and readily identifiable financial impact on the member. A City Council member shall not vote on any zoning map amendment if the landowner of the property subject to a zoning map amendment or the applicant for a text amendment is a person with whom the member has a close familial, business, or other associational relationship.B. Appointed BoardsMembers of appointed boards shall not vote on any advisory recommendation or quasi-judicial decision regarding a development regulation adopted pursuant to this Ordinance where the outcome of the matter being considered is reasonably likely to have a direct, substantial, and readily identifiable financial impact on the member. Members shall not vote on any zoning map amendment recommendation if the property owner subject to a zoning map amendment or an applicant for a text amendment is a person with whom the member has a close familial, business, or other associational relationship.C. Administrative StaffNo staff member shall make a recommendation to an elected or appointed board or final administrative decision required by this Ordinance if the outcome of that decision would have a direct, substantial, and readily identifiable financial impact on the staff member or if the applicant or other person subject to that decision is a person with whom the staff member has a close familial, business, or other associational relationship. If a staff member has a conflict of interest under this section, the decision shall be assigned to the supervisor of the staff person or such other staff person as may be designated by the development regulation or other ordinance. No staff member shall be financially interested or employed by a business that is financially interested in a development subject to regulation under this Ordinance unless the staff member is the owner of the land or building involved. No staff member or other individual or an employee of a company contracting with the City to provide staff support shall engage in any work that is inconsistent with his or her duties or with the interest of the City, as determined by the City.D. Quasi-Judicial DecisionsA member of any board exercising quasi-judicial functions pursuant to this Ordinance shall not participate in or vote on any quasi-judicial matter in a manner that would violate affected persons’ constitutional rights to an impartial decision maker. Impermissible violations of due process include, but are not limited to, a member having a fixed opinion prior to hearing the matter that is not susceptible to change, undisclosed ex-parte communications, a close familial, business, or other associational relationship with an affected person, or a financial interest in the outcome of the matter.E. Familial RelationshipFor the purposes of this section, a “close familial relationship” means a spouse, parent, child, brother, sister, grandparent, or grandchild. The term also includes the step, half, and in-law relationships.", "metadataJson": "{\"section_url\": \"/articles/article-35-ordinance-bodies-administrators/#356-conflicts-of-interest\"}"}]}