{"title": "Article 32. Required New Streets & Transportation Improvements", "metadataJson": "{\"base_url\": \"article-32-required-new-streets-transportation-improvements\"}", "section": [{"title": "32.1 COMPREHENSIVE TRANSPORTATION REVIEW (CTR)", "text": "A. PurposeThe purpose of the Comprehensive Transportation Review (CTR) is to identify the transportation improvements necessary to: mitigate increased demand on transportation infrastructure by a proposed development, preserve public investment in the transportation system, and support the sustained growth and prosperity of an area. To appropriately address multimodal and context-based impacts and mitigations, the CTR includes three types of analyses, including Multimodal Assessments, Transportation Demand Management (TDM), and Traffic Impact Studies (TIS).B. RequirementThe CTR, including specific thresholds and requirements, is included in the Charlotte Streets Manual (Streets Manual). A CTR is required for any development project that meets or exceeds any specified threshold. The developer shall procure the CTR at their own expense, and the CTR shall satisfy all applicable requirements.C. MitigationBased on the results or recommendations of a CTR, the developer shall provide any required mitigation and shall also abide by all applicable CTR procedures and requirements in providing such mitigation. Any mitigation required by the CTR shall be included along with all other transportation requirements of the proposed development as required by this Ordinance and other applicable law.", "metadataJson": "{\"section_url\": \"/articles/article-32-required-new-streets-transportation-improvements/#321-comprehensive-transportation-review-(ctr)\"}"}, {"title": "32.2 TRANSPORTATION ADJUSTMENTS", "text": "A. Upon an applicant’s request, if the City determines that one or more of the requirements identified in Table 32-1: Transportation Adjustments are unrelated to the proposed development’s anticipated transportation impacts or are not roughly proportional to those anticipated impacts, the City may modify or waive one or more of those requirements to the extent necessary to make them related to the proposed development’s anticipated transportation impacts and roughly proportional to those anticipated impacts.B. Table 32-1: Transportation Adjustments states the sections for which adjustments can be requested, the standard that may be adjusted, the official with authority to determine any adjustments to be made, and any applicable provisions of the standards not eligible for adjustment.C. Any determinations and decisions pursuant to this section may be appealed to the UDO Board of Adjustment as per Article 37.1 In consultation with the Planning Director2 Charlotte Area Transit System (CATS)3 In consultation with the CDOT Director4 The perimeter tree planting requirements of Article 20 shall apply and shall not be adjusted.5 Eligible adjustments for the installation of curb and gutter for Uptown Streets to be made in consultation with the Planning Director.", "metadataJson": "{\"section_url\": \"/articles/article-32-required-new-streets-transportation-improvements/#322-transportation-adjustments\"}"}, {"title": "32.3 RAPID TRANSIT CORRIDOR RESERVATION", "text": "A. If any portion of a Rapid Transit Corridor alignment, including transit station locations, that has been adopted by the Metropolitan Transit Commission (MTC) is located within the boundaries of a development project, that portion of the Rapid Transit Corridor alignment, as applicable, shall be deemed a Transit Reservation Area for purposes of this section.B. None of the following shall be developed or otherwise located or modified anywhere within a Transit Reservation Area:\nAny part of a new building or structure; or\nAnything that, if removed in whole or in part, would damage a pre-existing building or structure or would prevent full and effective utilization of that pre-existing building or structure.\nC. Within a Transit Reservation Area, only the following uses are allowed on an interim basis, and only if they fully comply with this section: surface parking, open space, and recreational areas. These uses:\nShall not involve any development that would violate item B above.\nShall not place anything within the Transit Reservation Area that, if wholly or partially eliminated or removed, would cause the development project or the underlying property, or any portion of the development project or the underlying property, to violate this Ordinance or any other applicable ordinance, law, or regulation.\nD. Any use allowed within a Transit Reservation Area shall be promptly discontinued and removed from the Transit Reservation Area at the expense of the property owner, and without damaging the underlying property, whenever title to all or a portion of the Transit Reservation Area is acquired by the City.E. Before developing or locating an otherwise permissible interim use within a Transit Reservation Area, the property owner shall obtain the City’s written approval of plans for that interim use. Such plans shall be sufficient to demonstrate that:\nThe interim use shall fully satisfy this section, including item C above.\nThe property owner has made sufficient plans and preparations and has demonstrated financial capability to discontinue and remove the interim use when required by this section.\nF. Except where a Transit Reservation Area is located on property zoned a UC Zoning District or a Transit Oriented Development Zoning District, the Transit Reservation Area will automatically expire 18 months after the property owner obtains land development approval.G. Where a Transit Reservation Area is located on property zoned a UC Zoning District or a Transit Oriented Development Zoning District, the Transit Reservation Area shall expire on the earlier of:\nThe City acquiring title to the Transit Reservation Area; or\nA formal rescission by the MTC of the adoptions granted by the MTC for all Rapid Transit Corridor alignments, including any transit station locations, as applicable, that gave rise to that Transit Reservation Area.\nH. The CATS Director, in consultation with the Planning Director, may reduce the size or duration (or both) of a Transit Reservation Area arising under this section if the CATS Director, in their discretion, determines that the reduction will not frustrate, delay, inhibit, or otherwise interfere with any City plans for a transit corridor or transit facility.", "metadataJson": "{\"section_url\": \"/articles/article-32-required-new-streets-transportation-improvements/#323-rapid-transit-corridor-reservation\"}"}, {"title": "32.4 BUS STOP AND AMENITY REQUIREMENTS", "text": "A. PurposeIn order to maintain and improve access to the Charlotte Area Transit System (CATS), development, as specified below, located along bus routes is required to provide bus transit amenity infrastructure.B. Existing CATS Bus Stops and Amenities\nApplicabilityConstruction of a new principal structure on a site with existing CATS bus stop(s) and amenities, either on the subject development site or in the rights-of-way adjacent to the subject development site, except for construction of a new single-family, duplex, triplex, and quadraplex structure.\nExisting CATS Bus Stops and Amenities Standards\n\nExisting CATS bus stops and amenities shall be retained without relocation or modification and connected to an accessible pedestrian route via a bus loading zone pad consistent with the CATS Bus Stop Special Details, unless relocation, modification, or removal is approved by the CATS Director.\nIf the existing CATS bus stop location, or access to the existing CATS bus stop location, is not Americans with Disabilities Act (ADA) compliant, the stop and/or access route shall be constructed to meet ADA standards. No relocation, modification, or removal of existing CATS bus stop(s) and amenities shall occur unless approved by the CATS Director, and in consultation with the CDOT Director.\nAll CATS bus stop(s) and amenities relocated or modified with the approval of the CATS Director shall be ADA compliant upon their relocation or modification.\n\n\nAdjustments to Existing CATS Bus Stops and Amenities\n\nRelocation, modification, or removal of an existing CATS bus stop or amenities may be approved by the CATS Director in their discretion, and in consultation with the CDOT Director. In considering a request to relocate, modify, or remove an existing CATS bus stop or amenity, the CATS Director shall review:\n\nThe impact on the safety of pedestrian activity, and\nThe impact on transit service and vehicular traffic.\n\n\n\n\nC. New CATS Bus Stops and Amenities\nApplicability\n\nNew nonresidential, mixed-use, or multi-family development that meets all the following:\n\nThe development is located along a bus route as indicated on an MTC adopted Transit Service Plan, and\nThe development will generate the minimum number of trips to trigger a Multimodal Assessment, per the CTR.\n\n\n\n\nThresholds for New CATS Bus Stops and Amenities\n\nFor development meeting the applicability of Section 32.4.C.1 above, a minimum of one CATS bus stop, and any associated amenities, is required. All new CATS bus stops and any associated amenities shall require, if necessary, an easement for such bus stops and any associated amenities, which shall be recorded.\nTwo CATS bus stops, and any associated amenities, are required for developments meeting the applicability of item 1 above and that also meet the following:\n\nGenerate the minimum number of trips to trigger a Traffic Impact Study, per the CTR.\nHave frontage on more than one public street with bus stops located on each street.\nAre served by more than one CATS bus route.\n\n\nA new CATS bus stop shall not be required if an existing stop is within a walking distance of 1,320 feet of the site and located on the same side of the street with the same facilities that a new CATS bus stop would be required to provide. This exemption shall not be allowed for a childcare center, educational facility, healthcare institution, residential care facility, or continuum care retirement community (CCRC).\n\n\nLocation and Infrastructure Requirements for New CATS Bus Stops and Amenities\n\nThe location of required new CATS bus stops, and any associated amenities, shall be determined by the CATS Director, and shall be consistent with the following:\n\nThe CATS bus stop location shall allow for safe connectivity with the pedestrian network including access to sidewalks, the presence of crosswalks within 1,320 feet of the stop, and suitable visibility for pedestrian and vehicular traffic.\nThe CATS bus stop location shall be designed to accommodate efficient bus operations, including but not limited to, bus stop spacing, curb clearance, placement in relation to streets, abutting property owner/tenant parking restrictions and regulations at and near the bus stop, vehicle turning radii, street lane widths and surfaces, and intersection design topography.\n\n\nSidewalks shall be constructed to connect the bus stop to the nearest sidewalk or public street intersection.\nThe CATS bus stop and access to the bus stop shall meet ADA standards.\nA concrete pad is required for all installations. Additional amenities, if required, shall be determined by the CATS Director based on the MTC Transit Service Guidelines and the CATS Bus Stop Special Details.\n\n\nExceptions\n\nA CATS bus stop and amenities will not be required when a feasible location cannot be provided due to physical site constraints such as:\n\nSteep slopes in excess of 15%.\nPotential intersection or driveway sight distance conflicts.\nUnsafe condition for the transit vehicle, motor vehicles, or pedestrians.\n\n\nThe CATS Director will determine when physical site constraints make location and installation of a CATS bus stop and amenities infeasible or unsafe.\n\n\nD. CATS Bus Stop and Amenity Design StandardsNew CATS bus stops and amenities, and changes to existing CATS bus stops and amenities, are required to comply with the CATS Bus Stop Special Details.E. Private Bus Stops and Amenities Served by CATSBus stops and amenities located on private property and served by CATS shall be reviewed and approved by CATS and shall be located so there are no negative impacts to public safety, and all sight distance requirements are met. Bus stops, and any of their accompanying amenities, located in the public rights-of-way will be regulated by CDOT and/or the North Carolina Department of Transportation (NCDOT), as applicable. These stops shall also comply with all other applicable requirements of this UDO.F. Non-CATS Bus Stops and AmenitiesBus stops and amenities located on private property and that are not served by CATS shall be located so there are no negative impacts to public safety, and all sight distance requirements are met. Bus stops, and any of their accompanying amenities located in the public rights-of-way, will be regulated by CDOT and/or NCDOT, as applicable. These stops shall also comply with all other applicable requirements of this UDO.", "metadataJson": "{\"section_url\": \"/articles/article-32-required-new-streets-transportation-improvements/#324-bus-stop-and-amenity-requirements\"}"}, {"title": "32.5 REQUIRED NEW STREETS", "text": "A. Required New StreetsNew streets are required when either of the following occur:\nSubdivision as defined by Section 30.3.A.\nConstruction of a new principal structure.\nB. Street StandardsAll new streets shall comply with the requirements of Article 33 as well as with any other applicable provisions of this Ordinance, including but not limited to perimeter tree planting requirements in Article 20.C. Limited Access Roads and Arterials\nRight-of-way for new limited access roads and arterials shown on the Charlotte Streets Map (Streets Map) shall be reserved for 18 months beginning when land development approval is obtained. Right-of-way shall meet the requirements of the Streets Map.\n\nThe appropriate agency shall have 18 months from the date of land development approval to enter into a contract to purchase the reservation area or to initiate condemnation proceedings.\nIf, at the end of the 18 month period, neither of the actions listed above has commenced, the developer may consider the land free of any reservation.\nThe developer may choose to dedicate the area to be reserved at any time during the reservation period.\n\nIf right-of-way for the construction of new limited access roads and arterials is dedicated, rather than reserved, the developer may reduce minimum lot size required by the zoning standards of the Neighborhood 1 Place Type by 10%. The dedication of the right-of-way for construction of new limited access roads or arterials shall be to the City or to NCDOT, as may be appropriate.\n\n\n\n\nA new collector or local street may be constructed within the right-of-way of a future limited access road or arterial. City staff shall approve the horizontal and vertical location of the collector or local street within the right­of-way to ensure that the location of the collector or local street will accommodate future construction of the limited access road or arterial. The entire width of the future limited access road or arterial right-of-way shall be dedicated.\nD. Main Streets\nMain Streets are shown on the Streets Map. A developer may propose a new Main Street, based on the following conditions:\n\nThe street it is not located in a Neighborhood 1 Place Type, Manufacturing and Logistics Place Type, or within a N2-A Zoning District.\nThe street will connect directly to an arterial.\nThe street will be at least three blocks in length.\n\n\nWhere these conditions are met for the proposed street, the developer shall construct the Main Street and dedicate the right-of-way. The Streets Map will be amended to reflect new approved Main Streets.\nE. Collectors\nNew collectors are required to be constructed, and the right-of-way dedicated, when the collector is shown on the Streets Map.\nIn addition, if a new street meets any of the criteria below, the street shall be designated as a collector, shall be constructed, and the right-of-way for the collector shall be dedicated.\n\nThe street directly intersects with an arterial and provides access to an area with:\n\nAn overall density of one residential lot per acre; or\nMore than 125 residential lots; or\nMore than 125 dwelling units.\n\n\nThe street, by its general configuration in relation to the existing development of the area, in effect serves a collector function.\n\n\nF. Local Streets\nA new local public street shall be constructed and dedicated as per the conditions below:\n\nAs required by Article 31.\nWhen a developer provides a public street not required by Article 31.\n\n\nA new local street shall be constructed as a public street unless allowed by Article 31 to be a network-required private street.\nWhen a developer is allowed per Article 31 to construct a network-required private street instead of a public street, a permanent public access easement shall be recorded.\nG. Sight Distance\nAll streets shall meet sight distance requirements as described in the Streets Manual.\nAll streets shall meet current American Association of State Highway and Transportation Officials (AASHTO) standards.\nH. Street Signs and Barricades\nStandard street markers shall be installed at one corner of all street intersections in a subdivision, as defined by Section 30.3.A, as well as any other network-required private streets, before any certificates of occupancy may be issued for buildings or residences along those streets. The design, material, location, and installation of the signs shall be in accordance with standards specified in the Charlotte Land Development Standards Manual (CLDSM).\nBarricades shall be installed at the end of all street stubs. Design, material, location, and installation of the barricades shall be in accordance with standards specified in the CLDSM.\n", "metadataJson": "{\"section_url\": \"/articles/article-32-required-new-streets-transportation-improvements/#325-required-new-streets\"}"}, {"title": "32.6 REQUIRED OFF-STREET PUBLIC PATHS", "text": "A. ApplicabilityOff-street public paths are required when either of the following occur:\nSubdivision as defined by Section 30.3.A.\nConstruction of a new principal structure, except for construction of a new single-family, duplex, triplex, or quadraplex structure.\nB. Off-Street Public Path StandardsAll new off-street public paths shall comply with the requirements of Article 33 as well as with any other applicable provisions of this Ordinance.C. Transit Trail\nA transit trail shall be built when such trail is identified in a Council or MTC adopted transit trail plan and located along an existing operating transit line.\nWhen a transit trail is identified in a Council or MTC adopted transit trail plan but is not located along an existing operating transit line, an 18 month reservation of land for construction of a transit trail is required. The 18 month reservation shall begin when land development approval is obtained.\n\nThe City shall have 18 months from the date of land development approval to acquire the reservation area by purchase, by receipt of a dedication, or by initiating condemnation proceedings.\nIf, at the end of the 18 month period, none of the actions listed above has commenced, the developer may consider the land free of any reservation.\n\n\nThe developer may choose to dedicate the area to be reserved. If area for the construction of a transit trail is instead dedicated to CATS, rather than reserved, such area shall count toward the required minimum open space requirement of the site under development. See Section 16.5 for open space requirements.\nD. Greenway TrailAn 18 month reservation of land for construction of a greenway trail is required when identified in the adopted Mecklenburg County Greenway Master Plan. The area reserved for construction of a greenway trail shall be the minimum area needed as identified by Mecklenburg County Park and Recreation. The 18 month reservation shall begin when land development approval is obtained.\nMecklenburg County shall have 18 months from the date of land development approval to acquire the reservation area by purchase, by receipt of a dedication, or by initiating condemnation proceedings.\nIf, at the end of the 18 month period, none of the actions listed above has commenced, the developer may consider the land free of any reservation.\nThe developer may choose to dedicate the area to be reserved. If area for the construction of a greenway trail is instead dedicated to Mecklenburg County Park and Recreation, rather than reserved, such area shall count toward the required minimum open space requirement of the site under development. See Section 16.5 for open space requirements.\nE. Connections to Off-Street Public Paths or Parks\nA connection from a public or network-required private street to a park or off-street public path shall be provided for parcels that meet both of the following conditions:\n\nThe parcel is located between a public or network-required private street and either a park or off-street public path; and\nThe parcel has boundaries along a public or network-required private street equal to or greater than the preferred block length in Table 32-1.\n\n\nThe connection shall include an easement for public access for the entity having jurisdiction over the facility being connected to and may be combined with other required access such as fire, loading, or service access, provided these connections to the park or off-street public path can adequately and safely provide for both purposes.\nAll new connections shall comply with the requirements of Article 33 as well as with any other applicable provisions of this Ordinance.\nThe developer shall consult with staff of the entity having jurisdiction over the facility being connected, to in order to determine the connection location, design, and/or width of the connection when combined with other transportation facilities.\nThe entity having jurisdiction over the park or off-street public path being connected to may modify the connection location, design, or width, or eliminate the connection, due to ADA considerations, topography, concerns for public health, safety, or welfare, or other site-specific conditions.\n", "metadataJson": "{\"section_url\": \"/articles/article-32-required-new-streets-transportation-improvements/#326-required-off-street-public-paths\"}"}, {"title": "32.7 IMPROVEMENTS TO EXISTING STREETS", "text": "A. When improvements are required on existing streets per this section, the required right-of-way, per the Streets Map or the CLDSM, shall be dedicated on public streets and a permanent easement shall be recorded on network-required private streets.B. Construction of sidewalks and drainage facilities required per this Article shall be accomplished along the entire length of the frontage of the property abutting each publicly maintained street except as otherwise specified in this Article.C. Curb and Gutter\nInstallation of New Curb and GutterInstallation of new curb and gutter and the associated storm drainage, where none currently exists, is required on public streets when any of the following conditions exist:\n\nA CTR as defined by Section 32.1 requires installation.\nApproval of a subdivision as defined by Section 30.3.A.\nA new principal structure is constructed, except for residential development on properties zoned in an N1-A, N1-B, N1-C, N1-D, or N1-E Zoning District.\nA principal structure is expanded by 10% or more, except for expansion of a residential structure on property an N1-A, N1-B, N1-C, N1-D, or N1-E Zoning District.\nAn existing structure that is 5,000 square feet or more in gross floor area has:\n\nA change of use from one use category to another use category; or\nA change of use to a transportation-intensive use within the same use category. See Table 32-2: Transportation-Intensive Uses for Each Use Category.\n\n\n\n\n2. Exceptions for New Curb and Gutter Installation\nWhen the cumulative built-upon area will be less than 25% of the total area of the parcel, new curb and gutter may not be required. However, the CDOT Director, in consultation with the Stormwater Manager, may require certain improvements if the improvements are determined to be needed for adequate drainage or to ensure public safety.\nA fee may be required instead of installation of any of the improvements included in this section if a funded Community Investment Plan (CIP) project is in place that will construct the required improvements to an existing street. Right-of-way dedication shall still be required.\nFor streets maintained by NCDOT, CDOT will coordinate with NCDOT to determine whether curb and gutter is required.\n3. Relocation of Existing Curb and Gutter\nWhere existing curb and gutter is not located at the required future back-of-curb location (see Table 33-1 as reference), for both public and network-required private streets, relocation to the future location is required when any of the following conditions exist:\n\nA CTR as defined by Section 32.1 requires relocation.\nWhen land development approval requires turn lanes that cannot be constructed to the standard without moving the existing curb.\nWhen an exception for on-street waste collection has been approved per Section 21.4.E.\nApproval of a subdivision as defined by Section 30.3.A. (See exceptions in item b below.)\nA new principal structure is constructed, except for residential development on properties in an N1­A, N1-B, N1-C, N1-D, or N1-E Zoning District. (See exceptions in item b below.)\nA principal structure is expanded by 50% or 5,000 square feet, whichever is greater, except for expansion of a residential structure on property in an N1-A, N1-B, N1-C, N1-D, or N1-E Zoning District. (See exceptions in item b below.)\n\n\nThe following exceptions apply to items a.iv, a.v, and a.vi above.\n\nFor parcels located in the Neighborhood 2 Place Type, Neighborhood Center Place Type, Community Activity Center Place Type, Regional Activity Center Place Type, or Innovation Mixed-Use Place Type, or zoned the IC-2 or RC Zoning District, the following exceptions apply.\n\nArterial StreetsIf the property frontage is less than half the preferred block length (Table 31-1), relocation of existing curb and gutter is not required unless:\n\nThe property frontage is within a distance equal to or less than the preferred block length from a curb on the same side of the street located per the Streets Map; or\nThe property frontage is within a distance equal to or less than the preferred block length from a frontage that includes existing bicycle facilities and/or on-street parking, if these facilities are required for the subject parcel.\n\n\nCollector and Local StreetsAll properties are exempt, but on-street parking shall be prohibited if there is not adequate space to accommodate it.\n\n\nFor parcels located in the Neighborhood 1 Place Type, Commercial Place Type, Manufacturing and Logistics Place Type, or Parks and Preserves Place Type, or in the IC-1 or OFC Zoning District, the following exceptions apply.\n\nArterial StreetsRelocation of existing curb and gutter is not required if any of the following apply:\n\nThe property frontage is less than the full preferred block length (Table 31-1).\nThe property frontage is located more than a full preferred block length (Table 31-1) from a curb on the same side of the street located per the Streets Map.\nThe property frontage includes existing bicycle facilities and/or on-street parking, if these facilities are required for the subject parcel.\n\n\nCollector and Local StreetsAll properties are exempt, but on-street parking shall be prohibited if there is not adequate space to accommodate it.\n\n\nAdditional exceptions are listed below. However, any modifications granted from these exceptions shall not override the future curb line location as determined by the standards in Article 33.\n\nCurb and gutter relocation may be waived if it is determined by the CDOT Director that the required cross-section elements can be safely and functionally provided in the interim with the existing curb location.\nA fee may be required instead of relocation of any of the improvements included in this section if a funded CIP project will construct the required improvements to an existing street. Right-of-way dedication shall still be required.\nOn local and collector streets, curb and gutter relocation may be waived if the required relocation will not accommodate the preservation of any heritage trees and/or any City trees meeting heritage tree criteria as defined by Article 20 that meet acceptable standards for tree health, structural integrity, and risk level as determined by the Chief Urban Forester. The CDOT Director, in consultation with the Chief Urban Forester, shall determine any required modifications.\nOn arterials, the transportation facilities necessitating the movement of the curb and gutter may be modified to accommodate the preservation of heritage trees and/or any City trees meeting heritage tree criteria as defined by Article 20 that meet acceptable standards for tree health, structural integrity, and risk level as determined by the Chief Urban Forester. However, if the Planning Director, in consultation with the CDOT Director, determines the accommodation cannot be safely and functionally implemented for a critical transportation facility, the curb and gutter shall be moved.\nWhere a required curb and gutter relocation will significantly impede the safe and effective conveyance of storm water or otherwise adversely affect storm drainage, the developer shall produce engineering design plans for a solution to make curb and gutter relocation feasible. If these plans demonstrate a construction scope that will cause an unusual and unnecessary hardship on the applicant or will otherwise be disproportional to the scale of the development, the CDOT Director, in consultation with the Director of Stormwater Services, may modify the requirement to relocate the curb and gutter.\nThe requirement for relocation of curb and gutter, and the location of the curb and gutter, may be modified if it can be determined by CDOT in consultation with the Planning Department and Stormwater Services, that significant topographical constraints, unusual site-specific conditions related to the land, or significant utility constraints make such improvements infeasible. Significant utility constraints are limited to the presence of high voltage transmission structures.\n\n\n\n\nWhere existing curb and gutter is required to be relocated, the associated sidewalk shall be located and designed consistent with Article 33, street pavement shall be extended to the relocated curb and gutter per CLDSM standards, and the associated drainage per Section 34.1 shall be provided.\nD. Sidewalk and Amenity Zone/Planting Strip\nNew Streetscape\n\nAll new streetscape installations shall comply with the requirements of Article 33 as well as with any other applicable provisions of this UDO. All new streetscape elements shall be located behind the future back of curb or, for Parkways, behind the right-of-way, the required amenity zone or planting strip shall be located between the future back of curb and the required sidewalk or shared-use path. All newly constructed streetscape shall also comply with any perimeter tree planting requirements as per the tree regulations in Article 20.\nWhere there is no existing sidewalk/shared-use path on public and network-required private streets, the required sidewalk/shared-use path and amenity zone/planting strip shall be provided when any of the below conditions exist:\n\nA CTR as defined by Section 32.1 requires installation.\nApproval of a subdivision as defined by Section 30.3.A.\nCurb and gutter are required to be installed or relocated by Section 32.7.C.\nnew principal structure is constructed.\nFor an existing structure that is 1,500 square feet or more in gross floor area when there is a change of use that:\n\nIs from one use category to another use category and that increases trips; or\nIs to a transportation-intensive use within the same use category (Table 32-2) and that increases trips.\n\n\nAn existing building is expanded by 1,000 or more square feet.\nAdditional parking is added that requires a new sidewalk in order to provide a complete pedestrian connection between the parking area and the principal use of the parcel.\nOutdoor dining of 1,000 or more square feet is installed or outdoor dining is expanded by 1,000 or more square feet.\n\n\nThe following exceptions to new streetscape requirements apply:\n\nResidential uses in the Neighborhood 1 Place Type are exempt from items b.iv, b.vi, and b.vii above, except when part of an approval of a new subdivision as defined by Section 30.3.A.\nA fee may be required instead of installation of any of the improvements included in this section if a funded CIP project is in place that will construct the required improvements to an existing street. Right­of-way dedication shall still be required.\n\n\nThe requirement to construct new streetscape and the associated streetscape standards found in Article 33 may be modified if it can be determined by the Planning Department, in consultation with CDOT, that significant topographical constraints, unusual site-specific conditions related to the land, or significant utility constraints make such improvements infeasible. Significant utility constraints are limited to the presence of high voltage transmission structures.\n\n\nExisting Streetscape\n\nExisting sidewalks/shared-use paths and amenity zones/planting strips on public and network-required private streets shall be updated to meet current standards, including those of Article 33 and any other applicable provisions of this UDO, when any of the below conditions exist. All updated streetscape shall be located behind the future back of curb, and the required amenity zone or planting strip shall be located between the future back of curb and the required sidewalk or multi-use path. All updated streetscape shall also comply with any perimeter tree planting requirements as per the tree regulations in Article 20.\n\nA CTR as defined by Section 32.1 requires streetscape updates.\nApproval of a subdivision as defined by Section 30.3.A.\nCurb and gutter are required to be installed or relocated by Section 32.7.C.\nA new principal structure is constructed.\n\n\nSidewalks/shared-use paths are substandard when they are two feet or more less than the required minimum width. Amenity zones/planting strips are substandard if they are less than six feet in width. Substandard sidewalks/shared-use paths and amenity zone/planting strips shall be updated to meet current standards if any of the following conditions exist:\n\nFor an existing structure that is 5,000 square feet or more in gross floor area when there is a change of use that:\n\nIs from one use category to another use category and that increases trips, or\nIs to a transportation-intensive use within the same use category (Table 32-2) and that increases trips; or\n\n\nAn existing building is expanded by 1,000 square feet or more.\nFour or more parking spaces are added and the additional parking requires a new sidewalk in order to provide a complete pedestrian connection between the parking area and the principal use of the property.\nOutdoor dining of 1,000 or more square feet is installed or outdoor dining is expanded by 1,000 or more square feet.\nAny development which removes any portion or portions of substandard sidewalk along an arterial, greater than 30 linear feet, during construction shall be required to replace that removed sidewalk with a sidewalk and planting strip that meets the standards of Article 33.\nAny development which removes or damages any portion or portions of substandard sidewalk along an arterial street, which amounts to more than 50% of that property’s frontage width along that arterial, shall be required to replace all substandard sidewalk along that property’s arterial frontage with a sidewalk and planting strip that meets the standards of Article 33.\n\n\nThe following exceptions apply to the requirements to improve the existing streetscape:\n\nResidential uses in the Neighborhood 1 Place Type are exempt from items a.iv and b.ii above for the following:\n\nDevelopment on collector and local streets.\nDevelopment of a single-family, duplex, triplex, or quadraplex dwelling on an arterial street.\n\n\nNonresidential uses in the Neighborhood 1 Place Type are exempt from items b.i, b.ii, and b.iii above for collector and local frontages.\nA fee may be required instead of the required improvements included in this section if a funded CIP project is in place that will construct the required improvements to an existing street. Right-of-way dedication shall still be required.\nThe requirement to update existing streetscape and the associated streetscape standards found in Article 33 may be modified if it can be determined by the Planning Department, in consultation with CDOT, that significant topographical constraints, unusual site-specific conditions related to the land, or significant utility constraints make such improvements infeasible. Significant utility constraints are limited to the presence of high voltage transmission structures.\n\n\n\n\nStreetscape Modifications for Tree PreservationThe Chief Urban Forester, in consultation with the CDOT Director, may modify the streetscape requirements and the associated streetscape standards found in Article 33 to accommodate the preservation of trees meeting acceptable standards for tree health, structural integrity, and risk level as determined by the Chief Urban Forester. If a modification to the location of the required sidewalk is necessary, then the location of the required sidewalk shall be prioritized in descending order as follows:\n\nSidewalk located between trees and building.\nSidewalk located between curb and trees, with substandard planting strip permitted.\nSidewalk located at the back of curb, with an additional foot of width added.Sidewalk widths may be modified to no less than five feet. On arterials with sidewalks located at back of curb, sidewalk widths may be modified to no less than six feet. Modification for sidewalk location or width shall be for the minimum length of sidewalk necessary to accommodate the preservation of trees meeting acceptable standards for tree health, structural integrity, and risk level as determined by the Chief Urban Forester.\n\n\nConstrained SpaceThe following constrained space standards shall be used where there is less than the required space for a complete streetscape between the face of an existing building that will not be replaced and the back of curb.\n\nWhere a sidewalk is required and there is ten feet or more between the face of the building and the back of curb, the available space shall be evenly divided between sidewalk and amenity zone/planting strip. When less than ten feet is available between the face of the building and the back of curb, see Table 32-3: Constrained Space Division When Sidewalk Required to determine use of space.\n\n\n\nWhere a shared-use path is required, the available space shall be evenly divided between a shared use path and amenity zone/planting strip. If, after evenly dividing the constrained space there is more than eight feet available allocated to the amenity zone/planting strip, then such extra space shall then be allocated to the shared-use path.\nWhen less than 16 feet is available between the face of the existing building that will not be replaced and the back of curb, see Table 32-4: Constrained Space Division When Shared-Use Path Required to determine use of space.\n\nIf the Chief Urban Forester determines that there is not adequate room for tree planting between the building and the curb after the required sidewalk or shared-use path area is deducted and if on-street parking is not provided, the sidewalk/shared-use path may extend across the full width of the area, or the remainder of the area shall be planted with grass or groundcover. Grass or groundcover shall not be used when less than two feet remain after the sidewalk area is deducted.\nIf the Chief Urban Forester determines that there is not adequate room for tree planting between the building and the curb after the required sidewalk or shared-use path area is deducted and if on-street parking is provided, the sidewalk/shared-use path shall extend across the full width of the area.\n", "metadataJson": "{\"section_url\": \"/articles/article-32-required-new-streets-transportation-improvements/#327-improvements-to-existing-streets\"}"}, {"title": "32.8 EXISTING UNIMPROVED RIGHTS-OF-WAY", "text": "Where residential development occurs on an existing lot of record abutting unimproved right-of-way, and that right-of­way is the only access to the lot, the provisions below shall apply:A. The right-of-way shall be graded only to the extent necessary to provide clear driveway access to the lot.B. An access driveway shall be constructed of gravel, asphalt, or concrete.C. Any existing utilities in the right-of-way shall be identified prior to construction and either left undisturbed or relocated, as determined in consultation with the appropriate utility provider.D. Any new utilities required for service to the lot shall not block access for other lots adjoining the right-of-way.E. If the unimproved access currently has a barricade, such barricade shall be removed subject to City approval.F. If there is sufficient right-of-way, and the property owner agrees to construct a street with the appropriate cross-section as shown in the CLDSM, the street may be eligible to be maintained by the applicable agency (or agencies) with jurisdiction over such approval.", "metadataJson": "{\"section_url\": \"/articles/article-32-required-new-streets-transportation-improvements/#328-existing-unimproved-rights-of-way\"}"}]}