{"title": "Article 17. Accessory Structures", "metadataJson": "{\"base_url\": \"article-17-accessory-structures\"}", "section": [{"title": "17.1 GENERAL STANDARDS FOR ACCESSORY STRUCTURES", "text": "All accessory structures are subject to the following regulations, unless otherwise permitted or restricted by specific regulations of this article and this Ordinance.A. Accessory structures are permitted in all zoning districts, unless otherwise restricted by this article.B. No accessory structure shall be constructed before the principal structure or use receives building permit or zoning use approval. A constructed accessory structure shall not be deemed to give authorization to a principal use not permitted in the zoning district. Construction of an accessory structure may be approved in conjunction with approval of construction of the principal use. Such accessory structure shall not be occupied or used until all permits for the principal structure are passed and closed, and a certificate of compliance or occupancy is obtained. Private docks and piers may be allowed prior to the principal structure in Neighborhood 1 Zoning Districts.C. A zoning use permit is required for all permanent accessory structures, except for those permanent structures that require a building permit. In addition, certain accessory structures that do not qualify as permanent also require a zoning use permit per this article unless otherwise noted.D. Accessory structures are subject to the following locational requirements:\nNo accessory structure is permitted in the established setback along a frontage except as follows:\n\nMailboxes, utility poles, light poles, and other similar accessory structures are allowed within an established setback along a frontage.\nSpecific accessory structures may only be allowed in an established setback along a frontage by specific provisions of this article. When permitted in an established setback, an accessory structure shall not locate in the required setback along a frontage unless it is also specifically allowed by this article.\nAccessory structures may be located in an established front or corner side setback along a street for a single-family detached dwelling if such dwelling is set back from the right-of-way a minimum of 150 feet and provided the accessory structure is set back a minimum of 50 feet from the right-of-way and is subject to the required side setback for the zoning district.\nIn the case of a through lot, one of the front setbacks, or setbacks along a frontage as applicable, shall be considered a rear setback for the purposes of the accessory structure regulations of this article only, and no accessory structure shall be allowed within this dimension.\n\n\nAccessory structures in an established side or rear setback shall be located a minimum of three feet from a lot line except as follows:\n\nAccessory structures with a height of 24 feet or more, or under 24 feet but with a height taller than the principal structure, shall be setback from any rear lot line a minimum of 15 feet and from any side lot line by the dimension of the required side setback for the zoning district.\nIf a specific accessory structure’s location in the established side or rear setback is further restricted by the provisions of this article, the more stringent standard shall apply.\n\n\nExcept as otherwise permitted by these regulations, no accessory structure shall be permitted which obstructs or otherwise interferes with use of a public or network-required private street.\nE. A detached accessory structure connected to a principal structure by a breezeway (see Article 18) is considered detached and subject to all applicable dimensional and locational requirements for detached accessory structures.F. For lots in residential use, the cumulative square footage of all accessory structures on a lot shall not exceed the total square footage of the heated area located on the first floor of the principal structure. Accessory structures open to the sky such as, but not limited to, pools and tennis courts, do not count towards this square footage limitation.", "metadataJson": "{\"section_url\": \"/articles/article-17-accessory-structures/#171-general-standards-for-accessory-structures\"}"}, {"title": "17.2 STANDARDS FOR SPECIFIC ACCESSORY STRUCTURES", "text": "The standards of Section 17.1 shall apply unless otherwise permitted or restricted by this section.A. Amateur (ham) Radio Equipment\nAmateur (ham) radio equipment towers with antennas are limited to a maximum height of 90 feet, as measured to the top of the tower or attached antenna, whichever is greater.\nAmateur (ham) radio equipment towers with antennas shall be set back as follows:\n\nUp to 24 feet in height: Three feet from a side and rear lot line.\n24 feet or more in height up to the maximum principal building height of the zoning district: 15 feet from a side and rear lot line.\nAbove the maximum principal building height of the zoning district up to 90 feet: 15 feet from a side and rear lot line plus an additional one foot of setback from side and rear lot lines for every two feet in height above the maximum height of the zoning district.\n\n\nBuilding-mounted antennas for amateur (ham) radio equipment are limited to a maximum height of 20 feet above the structure.\nB. Carport, Detached\nDetached carports shall not be located in an established front or corner side setback along a street or frontage. Detached carports shall be set back a minimum of 20 feet from the right-of-way or back of sidewalk, whichever is greater, to allow a driveway or parking pad with a minimum length of 20 feet.\nA detached carport shall be constructed as a permanent structure. No tent structure shall be permitted as a carport.\nC. Donation Boxes\nOnly one donation box is permitted per development site and a zoning use permit is required. Donation boxes are only permitted as accessory to the principal use of the site.\nDonation boxes shall be located to the rear of the principal building and entirely on private property. No donation box may be located within a required parking space, required on-site open space, on-site pedestrian pathway, tree save area, or area for stormwater control measures.\nDonation boxes may be located in a parking structure.\nDonation boxes shall be maintained in good condition and appearance with no structural damage, holes, or visible rust.\nThe name and contact information of the operator shall be indicated on the front of each donation box.\nDonation boxes shall not create nuisance conditions in violation of the City’s Health and Sanitation Ordinance.\nAll items received by the donation box shall fit fully within in the box structure. Outdoor storage areas are prohibited.\nD. Fences and Walls\nGeneral RequirementsThe regulations of this section (item 1) apply to fences and walls in all zoning districts. Where the requirements within the landscape regulations of Article 20 have specific standards for fencing that conflict with these regulations, the standards of Article 20 shall control.\n\n\n\n\n\nNo fence or wall shall be constructed within a storm drainage easement which will block or materially impede the flow of stormwater runoff.\nNo fence or wall shall obstruct sight distance triangles as defined in Section 31.3.D.\nPermitted materials for the construction of a fence, gate, or wall are as follows. Fences, gates, or walls in Neighborhood 1 Zoning Districts are not limited to these permitted materials.\n\nTreated wood or redwood\nSimulated wood\nDecorative brick\nStone\nSimulated stone\nFinished masonry\nWrought iron\nAluminum or steel designed to simulate wrought iron\nVinyl\nChain link; fence slats are prohibitedThe Zoning Administrator has the authority to approve alternative materials deemed to be similar to the materials in the approved materials list.\n\n\n\n\nWhen located on top of a retaining wall, fence height is measured on the fill (high) side.\nThe capital of a fence post or column may extend up to two feet above the maximum height limit.\nWhere prescribed conditions, accessory structure standards, landscape requirements, and/or screening requirements contain fencing requirements that conflict with this section, those specific requirements control. Unless such requirements specifically state the type of fence or wall material required, item b above continues to apply to permitted fence materials.\nFence wraps displaying signage when affixed to perimeter fencing at a construction site are exempt from zoning regulation per N.C.G.S. § 160D-908.\n\n\nNeighborhood 1 Zoning Districts, Neighborhood 2 Zoning Districts, and MHP Zoning District StandardsThe following standards apply, unless a different standard is required by the landscape regulations of Article 20.\n\nA fence or wall located in the established front setback or setback along a frontage shall be limited to a maximum height of five feet above grade.\nA fence or wall located in the established side setback between the established front setback and established rear setback shall be limited to a maximum height of six feet above grade.\nA fence or wall located in the established rear setback shall be limited to a maximum height of eight feet above grade.\nSound barrier walls along the interstate are allowed to exceed the height limitations of this section.\n\n\nOther Zoning District StandardsThe following standards apply, unless a different standard is required by the landscape regulations of Article 20.\n\nFences and walls in an established setback along a frontage may be a maximum of eight feet in height; however, that portion of the fence or wall above three feet in height shall be constructed to be a minimum of 75% open.\n\n\nE. Garage, DetachedDetached garages shall not be located in an established setback along a frontage. Detached garages shall be set back a minimum of 20 feet from the right-of-way or back of sidewalk, whichever is greater, to allow a driveway or parking pad with a minimum length of 20 feet.F. Mechanical EquipmentThe following standards apply to mechanical equipment related to the operation of the structure; mechanical equipment does not include accessory utility equipment, which is regulated separately by item K below. Examples of mechanical equipment include heating, ventilation, and air conditioning (HVAC) equipment, personal electrical generators, and swimming pool pumps and filters. These regulations do not apply to window-mounted or through-the-wall air conditioners.\nGround-Mounted Mechanical Equipment: Single-Family, Duplex, Triplex, and Quadraplex Dwellings\n\nGround-mounted mechanical equipment shall not be located in the established setback along a frontage.\nGround-mounted mechanical equipment may encroach into a required side or rear setback by no more than 50% of the width of that required setback.\n\n\nGround-Mounted Mechanical Equipment: All Other Uses\n\nGround-mounted mechanical equipment shall not be located in the established setback along a frontage.\nIf ground-mounted mechanical equipment is located in an established side or rear setback abutting a Neighborhood 1 Place Type or is visible from an abutting frontage, it shall be screened by a fence that is designed as 25% or less open or by a decorative wall.\nThe height of the wall or fence shall be at least the height of the mechanical equipment being screened and may exceed this height by no more than one foot.\n\n\nRoof-Mounted Mechanical Equipment in All Zoning DistrictsRoof-mounted mechanical equipment shall be screened by an architectural element so that it is not visible from an abutting frontage.\nG. Private Docks and PiersPrivate docks and piers, including any associated water-dependent accessory structures, may be located in any required setback that abuts a body of water.H. Retail and Shipping Service Lockers\nRetail and shipping service lockers not operated by a principal use on the site are permitted only on lots used for nonresidential uses, including nonresidential uses in a mixed-use development.\nRetail and shipping service lockers may be placed against the exterior of the principal building and shall not be located in any required setback. A freestanding locker may be located within the associated parking lot or structure. All required on-site open space, on-site pedestrian pathways, and required parking spaces shall remain unobstructed.\nA retail and shipping service locker shall be located on private property and cannot encroach into any required build-to zone or side or rear setback.\nRetail or shipping service lockers shall not obstruct any door. A minimum clear width for pedestrian traffic of eight feet shall be maintained at all doors and along any sidewalks.\nA retail and shipping service locker structure cannot exceed seven feet in height, six feet in depth, and 20 feet in length.\nI. Security Gate or Guard Station\nA security gate may be located in an established setback along a frontage only with approval from the Charlotte Department of Transportation (CDOT), the North Carolina Department of Transportation (NCDOT), the Charlotte-Mecklenburg Police Department, the Charlotte Fire Department, and other applicable agencies. Such agencies may place additional requirements on the siting of the gate and any ancillary facilities for reasons of public safety.\nA minimum of 40 feet shall be provided between any card reader and the street right-of-way or back-ofsidewalk, whichever is greater.\nJ. Satellite Dish (Large)The following satellite dish regulations apply to large satellite dish antennas, which are those greater than one meter (3.28 feet) in diameter.\nSatellite dishes shall be permanently installed on a building, on the ground, or on a permanent foundation, and shall not be mounted on a portable or movable structure.\nSubject to operational requirements, the dish shall be of a neutral color, such as white or grey. No additional signs or advertising are permitted on the satellite dish itself, aside from the logos of the satellite dish service provider and/or dish manufacturer.\nSatellite dishes no longer in use shall be immediately removed.\nSatellite dishes are permitted only in the established rear setback and shall be set back a distance from all lot lines that is at least equal to the height of the dish, but in no case less than ten feet from any lot line.\nRoof-mounting is permitted and shall be screened by an architectural element so that it is not visible from an abutting frontage.\nA ground-mounted satellite dish shall be screened so that it cannot be readily seen from public rights-of-way or abutting properties as follows:\n\nA satellite dish shall be screened by a solid fence or wall.\nThe height of screening shall be at least the height of the satellite dish being screened and may exceed this height by no more than two feet.\n\n\nK. Utilities, Above Ground and Wall-Mounted Accessory Structures\nAbove Ground Utility Accessory Structures\n\nAbove ground accessory utility structures may be located in the established side or rear setback. When visible from a frontage or from abutting property, all above ground accessory utility structures shall be screened on three sides by a fence that is designed as 25% or less open, wall, row of evergreen shrubs, or wall extension of the principal building, which is not required to be structural, equal to or a maximum of one foot greater than the height of the utilities. The enclosure shall be gated on the fourth side. Such gate shall be solid. Alternatively, a row of evergreen shrubs may be used to screen on-site utilities to meet this standard. Such row of shrubs shall be planted to create a visual barrier and exceed the height of utilities by one foot within three years of planting.\nAbove ground accessory utility structures may be located in an established setback along a frontage, but not within the required setback along a frontage, if fully enclosed on three sides using the principal building wall and an extension of the principal building wall, which is not required to be structural, equal to or a maximum of one foot greater than the height of the utilities. The enclosure shall be gated on the fourth side. Gates shall visually conceal the contents of the enclosure and shall remain closed except to gain access to the equipment as needed.\nScreening as described in items a and b above is not required for above ground accessory utility structures if such structures do not exceed any of the following dimensions: three feet in height, three feet in length, or three feet in depth. If such structure exceeds any of these dimensions, it shall be subject to the screening requirements of item a or b above, as applicable.\nUtility boxes may be wrapped or painted with artwork installed on all sides and covering the entire box as an alternative to screening, unless prohibited by the utility company. Such artwork may not function as a sign. Such wrapping or painting shall be maintained in good condition. If such artwork is removed, screening is required.\n\n\nWall-Mounted UtilitiesWall-mounted accessory utility structures, including gas and electric meters, shall not be installed on any façade located along a frontage. This restriction shall not apply to single-family dwellings. In the case of a building with all facades located along a frontage, wall-mounted utilities shall be located on a secondary frontage and screened by an opaque fence, or evergreen shrubs that exceed the height of the equipment by one foot within three years of planting.\nL. Wind Turbines\nWind turbines may be designed as either vertical or horizontal axis turbines, with or without exposed blades, including designs that combine elements of the different types of turbines.\nWind turbines are subject to the following height restrictions:\n\nThe maximum height of a ground-mounted wind turbine is 24 feet.\nThe maximum height of any wind turbine mounted upon a structure is 15 feet above the established height of such structure.\nMaximum height is the total height of the turbine system, including the tower and the maximum vertical height of the turbine blades. Maximum height therefore is calculated measuring the length of a prop at maximum vertical rotation to the base of the tower. The maximum height of any ground-mounted wind turbine is measured from grade to the length of a prop at maximum vertical rotation.\nNo portion of exposed turbine blades may be within ten feet of the ground. Unexposed/enclosed turbine blades may be within ten feet of the ground.\n\n\nGround-mounted wind turbines are permitted only to the rear of the principal building but may not be located within a required side or rear setback. No part of the wind turbine system structure, including guy wire anchors, may be located within a required setback. \nSTRUCTURE-MOUNTED WIND TURBINES‍GROUND-MOUNTED WIND TURBINES‍", "metadataJson": "{\"section_url\": \"/articles/article-17-accessory-structures/#172-standards-for-specific-accessory-structures\"}"}]}