{"title": "Article 23. Water Supply Watershed Protection", "metadataJson": "{\"base_url\": \"article-23-water-supply-watershed-protection\"}", "section": [{"title": "23.1 PURPOSE", "text": "A. Mountain Island Lake WatershedThe purpose of the Mountain Island Lake Watershed standards is to provide for the protection of public water supplies as required by the North Carolina Water Supply Watershed Classification and Protection Act (N.C.G.S. §143-214.5) and regulations promulgated thereunder. The Mountain Island Lake Watershed standards apply in any zoning district. The Mountain Island Lake Watershed standards supplement the use permissions and development standards of the base zoning district within the Mountain Island Lake Watershed Protection Area to ensure protection of public water supplies. All other uses and regulations for the base zoning district remain in effect for properties within the Mountain Island Lake Watershed.B. Lake Wylie WatershedThe purpose of the Lake Wylie Watershed standards is to provide for the protection of public water supplies as required by the North Carolina Water Supply Watershed Classification and Protection Act (N.C.G.S. §143-214.5) and regulations promulgated thereunder. The Lake Wylie Watershed standards apply in any base zoning district. The Lake Wylie Watershed standards supplement the use permissions and development standards of the base zoning district within the Lake Wylie Watershed Protection Area to ensure protection of public water supplies. All other uses and regulations for the base zoning district remain in effect for properties within the Lake Wylie Watershed.C. Lower Lake Wylie WatershedThe purpose of the Lower Lake Wylie Watershed standards is to support the protection of Lake Wylie’s water quality and to provide protection to public water supplies. The Lower Lake Wylie Watershed standards may apply in any base zoning district. The Lower Lake Wylie Watershed standards supplement the use permissions and development standards of the base zoning district within the Lower Lake Wylie Watershed Protection Area to ensure protection of public water supplies. All other uses and regulations for the base zoning district remain in effect for properties within the Lower Lake Wylie Watershed.", "metadataJson": "{\"section_url\": \"/articles/article-23-water-supply-watershed-protection/#231-purpose\"}"}, {"title": "23.2 APPLICABILITY", "text": "A. ApplicabilityThe requirements of this article apply to all development and redevelopment within the City of Charlotte and its extraterritorial jurisdiction (ETJ), unless exempted below.B. Exemptions\nExisting DevelopmentExisting development is not subject to the requirements of this article. Redevelopment or expansions to structures classified as existing development shall meet the requirements of this article. However, the built-upon area (BUA) of existing development is not required to be included in impervious area density calculations. Existing development, as defined for the purposes of this article, means projects for which a certificate of compliance has been issued, projects for which a building permit has been issued, property which has been subdivided by a recorded instrument, or projects which have obtained vested rights as of the date of adoption of the applicable watershed regulations listed in item 2.c below.‍\nLots Previously Recorded‍\n\nAny lot recorded prior to the dates specified below that has not been developed may be developed as a single-family dwelling subject only to the applicable water quality buffer requirements of this article, unless it is part of a larger common plan of development.\nFor the purposes of this section, a lot previously recorded is a lot that:\n\nIs part of an approved subdivision; or\nHas a plat which has been recorded in the Office of the Register of Deeds; or\nIs described by metes and bounds, the description of which has been recorded in the Office of the Register of Deeds.\n\n\nThe effective dates of a lot’s applicable watershed regulations are:\n\nFor Lower Lake Wylie Watershed: July 1, 2001 (approved by the Charlotte City Council).\nFor Lake Wylie Watershed: June 21, 1993 (approved by the Charlotte City Council).\nFor Mountain Island Watershed: June 21, 1993 (approved by the Mecklenburg Board of County Commissioners).\n\n\n\n\nExisting Public UtilitiesExisting public utilities may expand without being subject to the standards and regulations of this article provided that such expansions shall comply with all applicable laws and regulations of the State of North Carolina, including the minimum statewide water supply watershed management requirements adopted by the North Carolina Environmental Management Commission (EMC). For Mountain Island Lake and Lake Wylie (not including Lower Lake Wylie), discharges associated with the existing public utilities may be expanded. However, the pollutant load shall not be increased beyond presently permitted levels.\nC. DefinitionsThe definitions of Section 23.10 only apply to this article. Unless specifically defined in Section 23.10, other words or phrases used in this article are as defined in Article 2 for general definitions or Article 15 for use definitions. In the case of a conflict between a term defined in Article 2 or Article 15 and this article, the definition in Section 23.10 controls.", "metadataJson": "{\"section_url\": \"/articles/article-23-water-supply-watershed-protection/#232-applicability\"}"}, {"title": "23.3 AREAS AND SUB-AREAS ESTABLISHED", "text": "A. Water Supply Watershed Protection DistrictsStandards for development and redevelopment vary depending on the watershed district in which a project is located as described below:\nMountain Island LakeThe Mountain Island Lake Watershed Protection Area is that area within Mecklenburg County that contributes surface drainage into Mountain Island Lake.‍\nLake WylieThe Lake Wylie Watershed Protection Area is that area within Mecklenburg County that contributes surface drainage into that portion of the Catawba River known as Lake Wylie and its tributaries upstream of the Paw Creek watershed.‍\nLower Lake WylieThe Lower Lake Wylie Watershed Protection Area is that area within Mecklenburg County that contributes surface drainage into that portion of the Catawba River known as Lake Wylie and its tributaries, including Paw Creek.\nB. Mountain Island Lake Watershed\nCritical Areas (CA)\n\nCA1 Lower Gar CreekCA1 is the area from the full pond elevation of Mountain Island Lake extending up Gar Creek to Beatties Ford Road and to approximately the ridgeline along the north side of Gar Creek and to Mt. Holly-Huntersville Road on the south side of Gar Creek.‍\nCA4 Lake FrontCA4 is the area extending landward one-half mile from the full pond elevation along Mountain Island Lake and the Catawba River between the Cowan’s Ford Dam and the Mountain Island Lake Dam.‍\n\n\nProtected Areas (PA)\n\nPA1PA1 is the area beginning at the outer limits of the critical areas of five hydrologic miles from the full pond elevation of Mountain Island Lake\n\n\nC. Lake Wylie Watershed\nCritical AreaThe Critical Area extends one-half mile inland from the full pond elevation of Lake Wylie from Mountain Island Dam to the upstream side of the Paw Creek Arm (“Paw Creek Cove”).\nProtected AreaThe Protected Area extends from the outer boundaries of the Critical Area to approximately five miles from the Lake upstream in the Long Creek drainage basin.\nD. Lower Lake Wylie Watershed\nCritical AreaThe Critical Area extends one-half mile inland from the full pond elevation of 569.4 feet above sea level of Lower Lake Wylie from the upstream side of the Paw Creek Arm (“Paw Creek Cove”) to the South Carolina state line.\nProtected AreaThe Protected Area extends from the outer boundaries of the Critical Area to the extent of the watershed or approximately five miles from the Lake upstream in the Paw Creek drainage basin, whichever is less.\n", "metadataJson": "{\"section_url\": \"/articles/article-23-water-supply-watershed-protection/#233-areas-and-sub-areas-established\"}"}, {"title": "23.4 USES AND ACTIVITIES", "text": "A. Mountain Island Lake Watershed\nCritical AreasThe intent of the Critical Area is to require higher standards because of the greater risk of water quality degradation from pollution. All principal and accessory uses and activities permitted in the base zoning district, are allowed except as specified below. This section applies to the CA1 and CA4 areas. Any allowed uses and activities in the Mountain Island Lake Watershed Critical Areas shall meet the standards of this article and all other requirements of this Ordinance.\n\nProhibited Uses and Activities\n\nWaste including sewage, industrial and other wastes unless allowed per 15A NCAC 02B .0104\nIndustrial process discharges, new or expanded, requiring National Pollutant Discharge Elimination System (NPDES) permits.\nLand clearing and inert debris landfills (LCID): off-site\nLandfills, sanitary\nNonresidential development, new or expanded, unless allowed by item b below\nTreatment or disposal of petroleum contaminated soils (land farming)\nSludge application\nStormwater Control Measures (SCMs)\nNew wastewater treatment facilities; privately owned, requiring NPDES permits.\n\n\nAllowed Uses and Activities Under Specific Conditions\n\nFarms, subject to the provision of the Food Security Act of 1985 and the Food, Agricultural, Conservation, and Trade Act of 1990\nPlaces of worship\nSilviculture, subject to the provisions of the Forest Practices Guidelines Related to Water Quality (15 NCAC IT.6101-.0209)\nMarinas, as an accessory use, provided that:\n\nThere will be no fuel dispensing facilities.\nPump-out facilities will be provided if it serves more than 50 dwelling units.\n\n\nLand clearing and inert debris landfills (LCID): on site, as an accessory use, not within any floodplain or water quality buffer area\nPetroleum storage, accessory to the principal use, subject to the Fire Prevention Code of the National Fire Protection Association.\nWastewater treatment facilities, accessory to the principal use, provided that:\n\nNo new industrial process discharges into any stream in the Mountain Island Lake Watershed Area.\nNo new wastewater treatment systems requiring NPDES permits in the Mountain Island Lake Watershed that discharge directly into Mountain Island Lake or any of its tributaries.\nExpansion of existing privately-owned wastewater treatment systems shall not increase the pollutant load beyond their presently permitted limits.\n\n\n\n\n\n\nProtected AreasThe intent of the Protected Areas is to allow development with fewer restrictions than in the Critical Areas because the risk of water quality degradation from pollution is less than in the Critical Areas. All principal and accessory uses and activities permitted in the base zoning district, are allowed except as specified below. This section applies to the PA1 area. Any allowed uses and activities in the Mountain Island Lake Watershed Protected Areas shall meet the standards of this article and all other requirements of this Ordinance.\n\nProhibited Uses and Activities\n\nIndustrial process discharges, new, requiring NPDES permits\nLand clearing and inert debris landfills (LCID): off-site (only in PA1)\nLandfills, sanitary (only in PA1)\nTreatment or disposal of petroleum contaminated soils (land farming)\nWastewater treatment facilities, new, privately owned, requiring NPDES permits (only in PA1)\n\n\nAllowed Uses and Activities Under Specific Conditions\n\nStorage of hazardous materials, subject to the filing of a spill/failure containment plan with Fire Marshal\nSCMs, where allowed under the High-Density Option, subject to regulations of this article\n\n\n\n\nB. Lake Wylie Watershed\nCritical AreaThe intent of the Critical Area is to require higher standards because of the greater risk of water quality degradation from pollution. All principal and accessory uses and activities permitted in the base zoning district, are allowed except as specified below. This section applies to the Critical Area. Any allowed uses and activities in the Lake Wylie Watershed Critical Area shall meet the standards of this article and all other requirements of this Ordinance.\n\nProhibited Uses\n\nLandfills, sanitary\nTreatment or disposal of petroleum contaminated soils (land farming)\nSludge applications\nWastewater treatment plants, new, privately owned or operated for domestic waste requiring NPDES permit\n\n\nAllowed Uses and Activities Under Specific Conditions\n\nStorage of hazardous materials, subject to the filing of a spill/failure containment plan with the Fire Marshal\nSCMs, where required by any article of this Ordinance. BUA credit will only be allowed for Low- Density sites.\n\n\n\n\nProtected AreaThe intent of the Protected Area is to allow development with fewer restrictions than in a Critical Area because the risk of water quality degradation from pollution is less than in a Critical Area. All principal and accessory uses and activities permitted in the base zoning district, are allowed except as specified below. This section applies to the Protected Area. Any allowed uses and activities in the Lake Wylie Watershed Protected Area shall meet the standards of this article and all other requirements of this Ordinance.\n\nProhibited Uses\n\nWastewater treatment plants, new, privately owned or operated for domestic waste requiring NPDES permit\n\n\nAllowed Uses and Activities Under Specific Conditions\n\nStorage of hazardous materials, subject to the filing of a spill/failure containment plan with the Fire Marshal\nSCMs, where required by any article of this Ordinance. BUA credit will only be allowed for Low- Density sites.\n\n\n\n\nC. Lower Lake Wylie Watershed\nCritical AreaThe intent of the Critical Area is to require higher standards because of the greater risk of water quality degradation from pollution. All principal and accessory uses and activities permitted in the base zoning district, are allowed except as specified below. This section applies to the Critical Area. Any allowed uses and activities in the Lower Lake Wylie Watershed Critical Area shall meet the standards of this article and all other requirements of this Ordinance.\n\n Prohibited Uses and Activities\n\nLandfills, sanitary, construction and demolition, land clearing and inert debris\nTreatment or disposal of petroleum contaminated soils (land farming)\nSludge applications\nWastewater treatment plants, new, privately owned or operated for domestic or industrial waste requiring NPDES permit\nLand application for treatment and disposal of domestic or industrial waste\n\n\nAllowed Uses and Activities Under Specific Conditions\n\nStorage of hazardous materials, subject to the filing and approval of a spill/failure containment plan with the Mecklenburg County Fire Marshal\nSCMs, where required by any article of this Ordinance. BUA credit will only be allowed for Low- Density sites.\nIrrigation with tertiary treated domestic wastewater effluent\nPublicly controlled wastewater treatment plants requiring an NPDES permit\n\n\n\n\nProtected AreaThe intent of the Protected Area is to allow development with fewer restrictions because the risk of water quality degradation from pollution is less than in a Critical Area. All principal and accessory uses and activities permitted in the base zoning district, are allowed except as specified below. This section applies to the Protected Area. Any allowed uses and activities in the Lower Lake Wylie Watershed Protected Area shall meet the standards of this article and all other requirements of this Ordinance.\n\nProhibited Uses and Activities\n\nLandfills: sanitary, construction and demolition\nTreatment or disposal of petroleum contaminated soils (land farming)\nSludge applications\nWastewater treatment plants and associated discharges, new, privately owned or operated for domestic or industrial waste requiring NPDES permit\nLand application for treatment and disposal of domestic or industrial waste\n\n\nAllowed Uses and Activities Under Specific Conditions\n\nStorage of hazardous materials, subject to the filing and approval of a spill/failure containment plan with the Fire Marshal\nSCMs, where required by any article of this Ordinance. BUA credit will only be allowed for Low-Density sites.\nIrrigation with tertiary treated domestic wastewater effluent\nPublicly controlled wastewater treatment plants requiring an NPDES permit\nLand clearing and inert debris landfills requiring a state permit\n\n\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-23-water-supply-watershed-protection/#234-uses-and-activities\"}"}, {"title": "23.5 DEVELOPMENT STANDARDS", "text": "A. Mountain Island Lake WatershedAll uses and activities allowed in the Mountain Island Lake Watershed Subareas shall meet the applicable development standards established in Table 23-1: Mountain Island Lake Watershed Development Standards. Unless otherwise provided in Table 23-1, the standards established by the base zoning district apply.1 Projects that are subject to Article 25 (Post Construction Stormwater Regulations) are limited to a 12% maximum percentage built-upon area.B. Lake Wylie Watershed\nAll uses permitted in the Lake Wylie Watershed Subareas shall meet the applicable development standards established in Table 23-2: Lake Wylie Watershed Development Standards. Unless otherwise provided in Table 23-2, the standards established by the base zoning district apply.\nThe maximum percentages for built-upon area apply on an individual lot basis for lots of record established on or before June 21, 1993. Lots of record established after this date will be subject to these percentages unless otherwise specified on a recorded plat or on a subdivision plan approved by the Planning Department.\nC. Lower Lake Wylie Watershed\nAll uses permitted in the Lower Lake Wylie Watershed Subareas shall meet the applicable development standards established in Table 23-3: Lower Lake Wylie Watershed Development Standards. Unless otherwise provided in Table 23-3, the standards established by the base zoning district apply.\nThe maximum percentages for built-upon area apply on an individual lot basis for lots of record established on or before June 21, 1993. Lots of record established after this date will be subject to these percentages unless otherwise specified on a recorded plat or on a subdivision plan approved by the Planning Department.\n", "metadataJson": "{\"section_url\": \"/articles/article-23-water-supply-watershed-protection/#235-development-standards\"}"}, {"title": "23.6 WATER QUALITY BUFFER REQUIREMENTS", "text": "A. Mountain Island Lake WatershedVegetative buffers are required along the shoreline of Mountain Island Lake measured from the full pond elevation and along all perennial streams measured from the top of bank on each side of the stream. Required minimum buffer widths are indicated in Table 23-4.B. Lake Wylie WatershedVegetative buffers are required along the shoreline of the Lake Wylie measured from the full pond elevation and along all perennial streams measured from the top of bank on each side of the stream. Required minimum buffer widths are indicated in Table 23-5.C. Lower Lake Wylie Watershed\nVegetative buffers are required along the shoreline of the Lower Lake Wylie measured from the full pond elevation and along all perennial streams measured from the top of bank on each side of the stream. Required minimum buffer widths are indicated in Table 23-6.\n\nRequired Water Quality Buffer Width IncreaseRequired minimum buffer width shall be increased by 50% for new developments under the High-Density Option located along the lakeshore that have average slopes equal to or greater than 50% within the 100 foot buffer. The average slope is calculated by measuring the slope from the highest and lowest elevations at the 100 foot buffer to the 569.4 foot full pond elevation of Lake Wylie. The sum of the two measurements is divided by two to determine the average slope within the 100 foot buffer. The additional buffer area is applied in areas of the tract where slopes are greatest to obtain the maximum benefit from the increased buffer area.\nShoreline Stabilization RequiredIf a building permit is required for property improvement under the High-Density Option, which will result in an increase in built-upon area (BUA), shoreline stabilization is required as needed and allowed when unstable shorelines are present, and as approved on a plan submitted to Charlotte-Mecklenburg Storm Water Services (CMSWS) and as allowed by Duke Energy Lake Services.\nMitigationUnless exempted below, water quality buffer impacts are allowed only with the approval of a site-specific mitigation plan by CMSWS and/or approval of a variance per Article 37, if a variance is required. The following techniques are available for mitigation. Specifications for these pre-approved mitigation techniques are provided in the Charlotte-Mecklenburg Water Quality Buffer Implementation Guidelines.\n\nInstallation of Stormwater Control Measures (SCMs)If not required by another City ordinance or regulation of this Ordinance, the installation of an on-site SCM designed to achieve specified pollutant removal targets will allow for water quality buffer impacts on the specific site. The SCM should remain outside the Stream Side Zone if practical. A detailed SCM design plan shall be submitted to CMSWS for approval based on specifications and pollutant removal targets contained in the Charlotte-Mecklenburg Stormwater Control Measure Design Manual (SCM Design Manual). This plan shall also include a long-term maintenance strategy for the SCM complete with the establishment of adequate financing to support the proposed maintenance practices.\nWater Quality Buffer RestorationThe owner may restore and preserve the buffer area on any stream of equivalent or greater drainage area, the condition of which is determined to be qualified for restoration by CMSWS. This restored buffer area shall be equal or greater in size than the buffer area to be mitigated.\nWater Quality Buffer PreservationThe owner may purchase, fee simple, other stream segments at equivalent or greater drainage area on a 1:1 linear foot basis and convey fee simple and absolute title to the land to the City of Charlotte, Mecklenburg County, or approved conservation organization. Staff may consider other means for preserving these areas on a case-by-case basis.\nMitigation CreditsThe purchase of mitigation credits on a 1:1 basis utilizing area of water quality buffer impacted and the prevailing rate of purchase as established by CMSWS shall allow for water quality buffer impacts on the specific site. Mitigation credits purchased under any other program (i.e., U.S. Army Corp of Engineers) shall not cover this requirement unless the issuing agency agrees to relinquish the funds to CMSWS.\n\n\nD. Additional Water Quality Buffer Requirements (All Watersheds)\nNo permanent structures, built upon areas, septic systems, or any other disturbance of existing vegetation is allowed within the water quality buffer except as follows:\n\nNo trees larger than a two-inch caliper are to be removed except for dead or diseased trees. Trees less than a two-inch caliper and undergrowth may be removed to be replaced by an effective stabilization and filtering groundcover based upon the “Charlotte-Mecklenburg Water Quality Buffer Implementation Guidelines.”\nStream bank or shoreline stabilization is allowed as approved on a plan submitted to CMSWS.\nWater dependent structures and public projects, such as transportation crossings, public utilities, and greenway paths, are allowed where no practical alternative exists. These activities should minimize builtupon area, direct runoff away from surface waters, and maximize the utilization of nonstructural BMPs and pervious materials.\nNon-impervious recreational development and non-impervious pedestrian trails may be allowed in the required water quality buffer if located a minimum of 30 feet from the stream bank. This provision does not apply to the Mountain Island Lake Watershed Critical Areas.\n\n\nThe following may be located within water supply water quality buffers when they meet the minimum requirements of this article and the articles listed below:\n\nRequired open space per Article 16.\nLandscape yard per Article 20.\nAmenitized tree areas per Article 20.\nTree save per Article 20.\nInternal trees per Article 20.\nPerimeter trees per Article 20.\nWater supply water quality buffer per Article 23.\nPost-construction water quality buffer per Article 25.\nSWIM water quality buffer per Article 26.\nFloodplain per Article 27.\nAreas for greenways or parks per Article 32 offered for dedication and accepted by Mecklenburg County Park and Recreation.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-23-water-supply-watershed-protection/#236-water-quality-buffer-requirements\"}"}, {"title": "23.7 HIGH-DENSITY OPTION", "text": "The High-Density Option allows for a greater development density, provided SCMs are installed.A. High-Density Development Permit Application\nA High-Density Development Permit shall be required for new development exceeding the threshold of the Low-Density Option.\nApplication for a High-Density Development Permit shall be submitted as follows:\n\nFor development plans subject to subdivision (Article 30) and soil erosion and sedimentation control (Article 28) and reviewed by the Planning Department, the High-Density Development Permit shall be submitted to the Subdivision, Streets, and Infrastructure Administrator (SSI Administrator), as part of the subdivision review application process.\nFor development plans not subject to the subdivision (Article 30), the High-Density Development Permit shall be submitted to CMSWS as part of the sediment and erosion control requirements of the building permit application process.\nApplications for the High-Density Option shall include the following information:\n\nRequired number of development plans and specifications of the SCMs.\nSubmittal of a sediment and erosion control plan to the appropriate agency.\nPermit application fees.\n\n\n\n\nB. Stormwater Control Measures (SCMs)\nAll Stormwater Control Measures (SCMs) shall be designed based on the SCM Design Manual. Stormwater controls shall only be required on redeveloped BUA as allowed by state law.\nSurety for Completion of SCMs\n\nSubdivisions – Performance Security for InstallationThe City may require the submittal of a performance guarantee with surety, cash escrow, letter of credit, or other acceptable legal arrangement prior to approval and recordation of a plat in accordance with the provisions contained in the Stormwater Regulations Administrative Manual (Administrative Manual).\nAll Other ProjectsCertificate(s) of Occupancy for buildings or other improvements constructed or being constructed on the site may be withheld until the City of Charlotte has approved the as-built for the SCM\n\n\nMaintenance of SCMs\n\nMaintenance of SCMs, other than those maintained by the City, shall be the responsibility of the property owner.\nSingle-Family Residential SCMs Accepted for Maintenance: The City shall accept maintenance responsibility (as specified in the Stormwater Regulations Administrative Manual) of SCMs that are installed pursuant to this article following a warranty period of two years from the date of as-built certification described in the Stormwater Management Permit, provided the SCM:\n\nOnly serves a single-family detached residential site or townhouses all of which have public street frontage.\nIs satisfactorily maintained during the two-year warranty period by the owner or designee.\nMeets all the requirements of this article and the SCM Design Manual.\nIncludes adequate and perpetual access and sufficient area, by easement or otherwise, for inspection, maintenance, repair, or reconstruction.\n\n\nThe Stormwater Administrator shall receive an application for transfer of maintenance responsibilities for the SCM along with the Stormwater Management Permit application. The Stormwater Administrator will develop and distribute this application as a component of the Administrative Manual.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-23-water-supply-watershed-protection/#237-high-density-option\"}"}, {"title": "23.8 ADMINISTRATION", "text": "\nAppeals and variances of this article shall be subject to Article 37, however, administrative adjustments per Article 37.4 are not permitted for Water Supply Watershed Protection standards.\nInspections and enforcement actions of this article shall be subject to Article 39.\n", "metadataJson": "{\"section_url\": \"/articles/article-23-water-supply-watershed-protection/#238-administration\"}"}, {"title": "23.9 STORMWATER ADMINISTRATOR", "text": "\nDesignationThe Director of the City of Charlotte department responsible for management of the City’s NPDES MS4 Stormwater permit has been designated as the Stormwater Administrator. The Stormwater Administrator is authorized to administer and enforce Article 23.\nPowers and DutiesIn addition to the powers and duties that may be conferred by other provisions of this Ordinance and other laws, the Stormwater Administrator shall have the following powers and duties under this article:\n\n*1.* To review and approve or disapprove applications submitted pursuant to Article 23. \n*2.* To make determinations and render interpretations of Article 23.\n*3.* To establish application requirements and schedules for submittal and review of applications and appeals. \n*4.* To enforce Article 23 in accordance with its enforcement provisions in Article 39.\n*5.* To maintain records, maps, and official materials as they relate to the adoption, amendment, enforcement, or administration of Article 23. \n*6.* To provide expertise and technical assistance upon request to the City Council and the UDO Board of Adjustment. \n*7.* To designate appropriate other person(s) who shall carry out the powers and duties of the Stormwater Administrator. \n*8.* To provide information and recommendations relative to variances and information as requested by the UDO Board of Adjustment in response to appeals. \n*9.* To prepare and make available to the public a Charlotte-Mecklenburg Storm Water Services Design Manual, an SCM Design Manual, and a Stormwater Regulations Administrative Manual. \n*10.* To take any other action necessary to administer the provisions of Article 23\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-23-water-supply-watershed-protection/#239-stormwater-administrator\"}"}, {"title": "23.10 DEFINITIONS", "text": "The definitions of this section apply only to this article. Unless specifically defined in this section, other words or phrases used in this article are as defined in Article 2 for general definitions or Article 15 for use definitions. In the case of a conflict between a term defined in Article 2 or Article 15 and this article, the definition in this section controls.\nDevelopment. Land-disturbing activity that creates built-upon area or that otherwise decreases the infiltration of precipitation into the soil.\nIndustrial Discharge. The discharge of industrial process treated wastewater or wastewater other than sewage and includes:\n\nWastewater resulting from any process of industry or manufacture, or from the development of any natural resource.\nWastewater resulting from processes of trade or business, including wastewater from laundromats and car washes, but not wastewater from restaurants/bars.\nStormwater will not be considered industrial wastewater unless it is contaminated with industrial wastewater.\nWastewater discharged from a municipal wastewater treatment plant requiring a pretreatment program.\n\n\nPerennial Stream. A stream or creek containing a continuous natural flow of water throughout the year except possibly under exceptionally dry conditions. Such streams are defined by a certified professional using U.S. Army Corps of Engineers and N.C. Division of Water Quality methodology and shall be confirmed (as needed) by Charlotte-Mecklenburg Storm Water Services.\nRedevelopment. Any land-disturbing activity that does not result in a net increase in built-upon area and that provides greater or equal stormwater control than the previous development.\n‍", "metadataJson": "{\"section_url\": \"/articles/article-23-water-supply-watershed-protection/#2310-definitions\"}"}]}