{"title": "Article 16. General Development Standards", "metadataJson": "{\"base_url\": \"article-16-general-development-standards\"}", "section": [{"title": "16.1 LOT DEVELOPMENT RESTRICTIONS", "text": "A. Number of Structures on a Lot\nLots used for single-family, duplex, triplex, and quadraplex dwellings are limited to one principal structure per lot unless specifically permitted as follows:\n\nSuch dwellings are part of a multi-dwelling development.\nSuch dwellings are part of a cottage court development in a Neighborhood 1 Zoning District.\n\n\nFor all other uses, there may be more than one principal building on a lot, but all buildings shall comply with all standards of the zoning district.\nB. Every Lot Shall Abut a StreetNo building, structure, or use of land may be placed on a lot that does not abut a public street with the following exceptions:\nLand that meets the use definition and any applicable prescribed conditions for a farm in Article 15.\nA single-family detached dwelling may be constructed on a lot existing prior to June 1, 2023 that does not abut a street, provided that the lot is at least two acres in size, and that the lot is provided with access to a public street by a permanent recorded or platted easement at least 20 feet in width for the exclusive use of the dwelling. Such easement shall be maintained in a condition passable for emergency and service vehicles.\nBuildings within a cottage court development.\nBuildings within a multi-dwelling development may be placed on a lot that does not abut a street, provided that each building is within 400 feet of a public, network-required private, or non-network required private street that furnishes direct access to the property.\nLots within a nonresidential or mixed-use development site need not abut a street so long as the overall development site abuts a public, network-required private, or non-network required private street and is designed in such a manner that access is furnished to all interior lots or building sites. Vehicular access to interior lots or building sites shall only be across property zoned for such development.\nDriveways providing access to uses which are located on lots not abutting a street may cross through any zoning district, except for the following zoning districts: Neighborhood 1 Zoning Districts, Neighborhood 2 Zoning Districts, and the MHP Zoning District.\nFor cul-de-sac lots, the minimum lot frontage at the right-of-way shall be no less than 15 feet.\nC. Flag Lots ProhibitedThe creation of new flag lots shall be prohibited.D. Elevated Pedestrian WalkwaysElevated pedestrian walkways, including those over public rights-of-way and public access easements, may be located in a required setback provided they do not create a visual obstruction for motor vehicle traffic and have all other applicable government agency approvals for the location over the public right-of-way or public access easement. These walkways shall be as nearly perpendicular to the required setback as possible.E. Interpretation of Irregular Lot SetbacksThe location of required setbacks on irregularly shaped lots will be determined by the Zoning Administrator. The determination will be based on the spirit and intent of this Ordinance to achieve an appropriate spacing and location of buildings on individual lots.", "metadataJson": "{\"section_url\": \"/articles/article-16-general-development-standards/#161-lot-development-restrictions\"}"}, {"title": "16.2 EXTERIOR LIGHTING", "text": "The following exterior lighting requirements apply to lighting for multi-family dwellings, mixed-use development, and nonresidential uses on private property. These lighting regulations do not apply to lighting in the right-of-way or the illumination of signs.A. Maximum Lighting RegulationsThe maximum allowable foot-candle is as follows:\nAny lot abutting a Neighborhood 1 or Neighborhood 2 Place Type: Zero foot-candle at the lot line.\nAny lot abutting any other Place Type: One foot-candle at the lot line.\nB. Lighting Design\nAll lighting shall be of full cut-off or semi cut-off luminaire design.\nThe maximum total height of a freestanding full cut off or semi cut off luminaire is 26 feet. However, in the Commercial Place Type and Manufacturing and Logistics Place Type, a luminaire is limited to a maximum total height of 35 feet.\nFlashing lighting is prohibited.\nAll exterior lighting shall be located, screened, or shielded in a manner as not to cause glare or impair the vision of motorists.\nC. Exceptions to Lighting Standards\nWhen additional security lighting is required per federal, state, or local regulations that exceeds the standards of this section, the lighting is permitted to meet the requirements of such regulations.\nAll temporary emergency lighting required by public safety agencies, other emergency services, or construction are not subject to the requirements of this section.\nBecause of unique requirements for nighttime visibility and limited hours of operation, outdoor recreational fields such as, but not limited to, football fields, soccer fields, baseball fields, driving ranges, and other similar uses are subject to the following:\n\nRecreational fields are permitted a total luminaire height of 65 feet in any zoning district. Luminaires greater than 65 feet in total height may only be approved by the Zoning Administrator when a taller height will result in less light trespass to adjacent lots.\nAll lighting shall be directed onto the field or range.\nThe recreational field lighting shall be extinguished one hour following the end of a scheduled event or the close of the business to the public, whichever is applicable.\nLighting outside the recreational field, such as for parking areas, shall comply with the requirements of items 16.2.A and 16.2.B above. Lighting outside the recreational field is not subject to the timeframe limitation of item c above.\n\n\nCertain temporary uses may use lighting that does not meet the requirements of this section. When such temporary uses are allowed, approval of the lighting plan is required as part of the temporary use approval.\n", "metadataJson": "{\"section_url\": \"/articles/article-16-general-development-standards/#162-exterior-lighting\"}"}, {"title": "16.3 DEVELOPMENT BONUS", "text": "To achieve the “Maximum Height with Bonus” standard or to reduce the required open space within the UE, RAC, CAC-1, CAC-2, NC, IMU, TOD-UC, TOD-CC, TOD-NC, TOD-TR, N2-C, CG, CR, IC-1, IC-2, OFC, and RC Zoning Districts, a development shall meet the standards as described below and in Table 16-1: Bonus Menu.A. Bonus MenuAdditional building height or a reduction in required on-site open space shall be allowed through a voluntary bonus system. In order to obtain a development bonus, one or more actions in Table 16-1 are required.B. Bonus Actions\nHeight Bonus\n\nWith the exception of certain affordable housing bonuses, bonuses for additional height correlate to the number of points acquired per Table 16-1. Points may be earned in one or more categories. A height bonus for affordable housing is applied as indicated in Table 16-1.\nFor the building height bonus, one point is required for one foot of additional building height. The final height of the building cannot exceed the “Maximum Height with Bonus” standard indicated in the zoning district standards. Unless specifically indicated otherwise, building height bonus points may be distributed to one or more buildings on the lot.\n\n\nOpen Space Reduction\n\nReduction of required on-site open space (Section 16.5) may only be achieved through the provision of affordable housing, as indicated in Table 16-1.\nThe reduction of required on-site open space (Section 16.5) is applied to the lot as a whole.\n\n\nC. AdministrationAdministration requirements are found in the UDO Zoning Administration Manual.", "metadataJson": "{\"section_url\": \"/articles/article-16-general-development-standards/#163-development-bonus\"}"}, {"title": "16.4 AFFORDABLE HOUSING DEVELOPMENT ALLOWANCES", "text": "The purpose of the development allowances provided below is to encourage the development of affordable housing within the City and the ETJ.\nAffordable housing developments that meet the following requirements shall be permitted the additional development allowances listed in item B below.\n\n*1.* Affordability period: 30 years\n*2.* Minimum units of affordable housing: Five units\n*3.* Percentage of development (one of the following):\n\n15% at 60% AMI; or\n\n\n\n30% at 80% AMI; or\n\n\n\n20% at 80% AMI in areas of high housing cost per the UDO Zoning Administration Manual\n\n\n\n\nThose affordable housing developments that meet the requirements of item A above shall be permitted the following development allowances:\n\n*1.* If zoned the N2-A Zoning District, to build to the N2-B Zoning District standards.\n*2.* If zoned the N2-C or NC Zoning District, to build to the N2-A or N2-B Zoning District standards.\n*3.* A new street, in whole or in part, shall not be required, per Section 32.5, if that street or a portion of such street does not provide access to the affordable housing development, as determined by the SSI Administrator, and that street does not connect to an existing street on an abutting property. In lieu of construction the street or portion of such street, right-of-way shall be dedicated for future construction of the street or portion of such street.\n*4.* Projects may use Tier 1 Green Area Credits per Section 20.15.\n*5.* Where mitigation is required for removal of heritage trees, planting of twice the number of required mitigation trees shall be allowed in lieu of the mitigation fee per Article 20. The mitigation trees may also be counted towards perimeter tree plantings per Section 20.17.C when they meet all perimeter tree planting requirements.\n\n\nWhere 20% of units are provided at 60% AMI or below for 15 years, with a minimum of five units of affordable housing, costs related to construction of sidewalks required on public streets per Section 32.7.D shall be reimbursed by the City.\nIn the N1-A, N1-B, N1-C, and N1-D Zoning Districts, voluntary mixed-income residential developments per Section 4.5.B may receive a bonus allowing for the development of property in accordance with the standards of the next zoning district of greater intensity in exchange for setting aside affordable housing units.\n", "metadataJson": "{\"section_url\": \"/articles/article-16-general-development-standards/#164-affordable-housing-development-allowances\"}"}, {"title": "16.5 DESIGN OF ON-SITE OPEN SPACE", "text": "A. Open Space Requirements\nWhen required within the zoning district regulations, open space shall meet the design requirements of Table 16-2: Design of Open Space, organized by type of open space.\nDriveways, parking areas, required bicycle parking areas, above ground utility areas, mailboxes, and landscape yards do not count toward on-site open space requirements. However, sidewalks that traverse a required open space area shall count towards the minimum required open space.\nThe following may be counted toward open space requirements when they meet the minimum requirements of this article and any applicable articles listed below:\n\nAmenitized tree areas per Article 20.\n50% of the open space may be tree save areas per Article 20, so long as such tree save area abuts the remaining required open space and includes allowed amenities to provide passive recreation.\nA green roof per Article 20 that is designed to allow passive recreation.\nInternal trees per Article 20.\nWater supply water quality buffer per Article 23.\nPost-construction water quality buffer per Article 25.\nSWIM water quality buffer per Article 26.\nFloodplain per Article 27.\nAreas for greenways or parks per Article 32 offered for dedication and accepted by Mecklenburg County Park and Recreation.\n\n\nThe area used to calculate the required open space does not include existing and dedicated street rights-ofways, utility easements, existing ponds and lakes, and railroad easements and rights-of-way.\nWhen located within a required on-site open space area, a commercial structure no greater than 500 square feet in gross floor area or 10% of the total open space area, whichever is less, is allowed and may be included in the calculation of total on-site open space. The use of such commercial structure shall be a use allowed within the zoning district as per the Use Matrix in Article 15.\nB. Exemptions from Required On-Site Open Space\nUses within the categories of Open Space, Recreation, and Agricultural Uses, Infrastructure Uses, or Transportation Uses in the Use Matrix in Article 15 are not required to provide on-site open space.\nSingle-family, duplex, triplex, and quadraplex dwellings are not required to provide on-site open space.\nC. Open Space Dedication and Fee-in-Lieu AlternativesWhen open space is required within the zoning district regulations, as an alternative to the required on-site open space, the property owner may select one of the following options, or a combination thereof, per the UDO Zoning Administration Manual:\nDedicate land required for on-site open space to Mecklenburg County Park and Recreation, so long as the land meets Park and Recreation standards. If selecting this option, and dedicating all required on-site open space, the amount of open space dedicated may be reduced by 10%.\nProvide a fee-in-lieu of the required on-site open space to Mecklenburg County Park and Recreation, so long as the fee is accepted by Park and Recreation. The payment of such funds shall be used to acquire or develop recreation areas in the surrounding area for which the fee-in-lieu is paid.\n", "metadataJson": "{\"section_url\": \"/articles/article-16-general-development-standards/#165-design-of-on-site-open-space\"}"}, {"title": "16.6 ON-SITE PEDESTRIAN CONNECTIVITY", "text": "A. Residential DevelopmentsResidential dwellings require a pedestrian connection from the primary entry as follows:\nSingle-family, duplex, triplex, and quadraplex dwellings: For new construction, a pedestrian connection that is a minimum of four feet in width is required from the primary entry to the adjacent public sidewalk or on-site driveway. This includes a connection to a required public sidewalk not yet constructed.\nAll other residential dwellings and developments: For new construction or a change of use from a nonresidential use to a residential use, a pedestrian connection that is a minimum of five feet in width is required to the adjacent public sidewalk, between buildings, and from buildings to all on-site facilities (parking areas, bicycle facilities, plazas, and open space, etc.). This includes a connection to a required public sidewalk not yet constructed. A connection from an individual residential dwelling to the common pedestrian connection to the public sidewalk shall be a minimum of four feet in width.\nB. Nonresidential and Mixed-Use DevelopmentsPedestrian connections are required for new construction or a change of use as follows:\nA pedestrian connection that is a minimum of five feet in width is required from the primary entry to the adjacent public sidewalk. This includes a connection to a required public sidewalk not yet constructed. An individual sidewalk connection will not be required for a nonresidential building if it would result in a sidewalk length of 1,320 feet or more.\nInternal sidewalk connections are required between buildings and from buildings to all on-site facilities (parking areas, bicycle facilities, plazas, and open space, etc.). All internal sidewalks shall have a hard surface constructed of concrete, asphalt, or other similar material and shall be at least five feet in width. In the event that such connection would disturb or impair any significant environmental features of the site, this requirement may be modified by the Zoning Administrator.\n", "metadataJson": "{\"section_url\": \"/articles/article-16-general-development-standards/#166-on-site-pedestrian-connectivity\"}"}, {"title": "16.7 PERFORMANCE STANDARDS", "text": "All uses shall comply with the performance standards established in this section unless any federal, state, or local law, ordinance, or regulation establishes a more restrictive standard, in which case, the more restrictive standard applies.A. NoiseNo use shall be operated so as to generate recurring noises that are unreasonably loud, cause injury, or create a nuisance to any person of ordinary sensitivities. Within the City’s boundaries, noise occurring activities shall also be in conformance with Chapter 15, Article III of the City Code. The standards of Chapter 15, Article III of the City Code shall apply in the City’s ETJ.B. VibrationNo use shall be operated so as to generate inherent or recurring ground vibrations detectable at the property line which create a nuisance to any person of ordinary sensitivities on another property.C. DustDust, borne by the wind from sources such as storage areas, yards, roads, conveying equipment and the like, within lot boundaries, shall be mitigated by appropriate landscape, screening, sheltering, paving, fencing, wetting, collecting, or other acceptable means.D. Odors and FumesNo use shall emit fumes, gasses, or odors in concentrations or amounts that cause injury or create a nuisance to any person of ordinary sensitivities on another property.", "metadataJson": "{\"section_url\": \"/articles/article-16-general-development-standards/#167-performance-standards\"}"}]}