{"title": "Article 36. General Processes", "metadataJson": "{\"base_url\": \"article-36-general-processes\"}", "section": [{"title": "36.1 APPLICATION REQUIREMENTS", "text": "A. Initial Application SubmittalAll applications for development approval shall be submitted to the City in accordance with the requirements of this Ordinance, and other established guidelines, and shall be filed according to the requirements of each department, review body, or respective administrator.B. Application DeadlinesComplete applications shall be submitted in accordance with the City’s filing deadline calendar for each type of application, as applicable.C. Determination of CompletenessAn application will not be considered properly filed until it is deemed complete and accurate by the designated administrator.", "metadataJson": "{\"section_url\": \"/articles/article-36-general-processes/#361-application-requirements\"}"}, {"title": "36.2 WRITTEN INTERPRETATIONS", "text": "A. PurposeThe purpose of the provisions for a written interpretation of this Ordinance is to ensure that review for conformance with this Ordinance is consistent and predictable.B. Initiation of InterpretationAny person may request a written interpretation of the intent, meaning, or application of the stated provisions of this Ordinance. Such requests shall be submitted to the applicable administrator.C. Written Interpretation\nThe administrator(s) making the interpretation shall provide a written notice of the interpretation to the applicant and the property owner, if the property owner is not the applicant and the question of interpretation is related to a specific tract of land, and to any other relevant staff as necessary, within 30 days of receipt of the request.\nThe notice shall be delivered by personal delivery, electronic mail, or by first-class mail to the applicant and to the last address listed for the owner of the affected property on the county tax listing. In the absence of evidence to the contrary, notice given by first-class mail is deemed received on the third business day following deposit of the notice for mailing with the United States Postal Service.\nAn official record of written interpretations shall be kept on file in the office of the applicable administrator and shall be available for public inspection during normal business hours of the respective department.\nD. AppealsAny person with standing under N.C.G.S. § 160D-1402(c) may file an appeal of a written interpretation with the UDO Board of Adjustment as described in Section 37.8.B.", "metadataJson": "{\"section_url\": \"/articles/article-36-general-processes/#362-written-interpretations\"}"}]}