{"title": "Article 33. Standards for Streets, Off-Street Public Paths, & Cross Access", "metadataJson": "{\"base_url\": \"article-33-standards-for-streets-off-street-public-paths-cross-access\"}", "section": [{"title": "33.1 TECHNICAL STANDARDS", "text": "Construction and technical details for streets, including in-street drainage and water and sewer utilities, off-street public paths, and cross-access are available in one or more of the following:A. Charlotte Land Development Standards Manual (CLDSM)B. Charlotte-Mecklenburg Storm Water Services Design ManualC. Charlotte Water, Water and Sewer Design and Construction StandardsD. CATS Bus Stops – Special DetailsE. Other city code, state, or federal regulations", "metadataJson": "{\"section_url\": \"/articles/article-33-standards-for-streets-off-street-public-paths-cross-access/#331-technical-standards\"}"}, {"title": "33.2 CHARLOTTE STREETS MAP", "text": "The Charlotte Streets Map (Streets Map) shows the location of existing and planned future arterial and collector streets, and any shared-use paths located along local streets. Collector streets not indicated on the Streets Map shall be located per the standards of Section 32.5.E.", "metadataJson": "{\"section_url\": \"/articles/article-33-standards-for-streets-off-street-public-paths-cross-access/#332-charlotte-streets-map\"}"}, {"title": "33.3 STREET DESIGN", "text": "A. Table 33-1: Street Design provides a reference for the required location, dimensions, and standards for each street classification.1 The minimum right-of-way is measured to the back of the required sidewalk/shared-use path. If building is two feet or more behind the required shared-use path, the right-of-way shall be increased by two feet or shall be put in a sidewalk utility easement (SUE).‍2 Or as reflected on a recorded public access easement for private local streets.B. Table 33-2: Local Street Matrix describes the type of local street required within each Place Type.C. Table 33-3: Streetscape Reference provides a reference for the required sidewalk/shared-use path and amenity zone or planting strip for each street classification.1 Any pedestrian facilities on Limited Access roads and Parkways will be in the form of a shared-use path located either in a sidewalk utility easement outside the right-of-way or, with NCDOT approval, at the back of the right-of-way.2 Where the area between the sidewalk and the back of curb is three feet or more than the required minimum width of an amenity zone, grass or groundcover is permitted in the area that exceeds the required minimum width. If the area between the sidewalk and the back of curb is three feet or less than the required minimum width of an amenity zone, the amenity zone shall extend to the back of curb.3 Location of trees may be required to be outside the clear zone for North Carolina Department of Transportation (NCDOT) facilities.4 If the Charlotte Streets Map requires an amenity zone, a planting strip is permitted instead of an amenity zone for the TOD-TR Zoning District.5 If the Chief Urban Forester determines that planting trees in the required planting strip or amenity zone is not feasible due to shallow depth of existing underground utilities, the required trees may be relocated behind the sidewalk. In that case, a minimum four foot planting strip, planted with grass or groundcover, shall be retained for collector and local streets. A minimum eight foot planting strip planted with grass or groundcover shall be retained for arterials.D. Table 33-4: Sidewalk Dimensions – Collector and Local Streets contains the required dimensions for sidewalks on collector and local streets based on Place Type. For collector and local streets, a shared-use path shall be required instead of a sidewalk when shown on the Charlotte Streets Map.E. Table 33-5: Amenity Zone or Planting Strip – Collector and Local Streets indicates when amenity zones or planting strips are required and allowed based on Place Type.1 Planting strips are the standard requirement for these Place Types. Amenity zones may be allowed if the Chief Urban Forester, in consultation with the CDOT Director and Planning Director, determines installation of an amenity zone supports the listed urban forest characteristics for the corresponding Place Type while also supporting other key interests (transportation, sidewalks, etc.)2 Planting strips are permitted instead of an amenity zone in the TOD-TR Zoning District.3 Planting strips are permitted for any zoning district located within the Water Supply Watershed Protection Areas per Article 23.", "metadataJson": "{\"section_url\": \"/articles/article-33-standards-for-streets-off-street-public-paths-cross-access/#333-street-design\"}"}, {"title": "33.4 UPTOWN STREETSCAPE DESIGN", "text": "Table 33-6: Uptown Streetscape Design Elements contains the required dimensions for sidewalks and amenity zones and indicates streetscape requirements for amenity zone elements, pavers, lighting, and curb design for Uptown Streets.1 Tryon Street (within Uptown) shall follow existing Tryon Street Mall Streetscape Guidelines for amenity zone elements, pavers, lighting, and curb design but shall otherwise be classified as an Uptown Signature Street.2 Utilities are required in Tree Grates.3 Concrete paver blocks in herringbone are permitted under encroachment agreement from applicable agency.4 Pedestrian lighting spacing is based on proximity to trees and street lighting, as determined by CDOT. Typically, where trees are spaced 40’ apart, provide lighting at 80’ spacing, alternating between pedestrian lighting and street lighting. Where trees are spaced 30’ apart, provide lighting at 60’ spacing with one street light for every two pedestrian lights.", "metadataJson": "{\"section_url\": \"/articles/article-33-standards-for-streets-off-street-public-paths-cross-access/#334-uptown-streetscape-design\"}"}, {"title": "33.5 OFF-STREET PUBLIC PATHS", "text": "A. Transit Trail\nThe minimum width of a transit trail, and any required planting strip or other elements, are based on the applicable Council-adopted transit trail plan.\nNo tree planting associated with the construction of a transit trail is required unless indicated by a Counciladopted transit trail plan.\nB. Connections to Off-Street Public Paths or ParksThe minimum width of a connection to an off-street public path or park is twelve feet. If combined with other required access such as fire, loading, or service access, then the connection shall meet the greater of the required dimensions. The developer shall consult with the staff of the entity having jurisdiction over the facility being connected to in order to determine if any design and/or width modifications are necessary to ensure that any intended purposes can be provided adequately and safely.C. Pedestrian and Bicycle Connection\nFor parcels located in the Neighborhood 2 Place Type, Neighborhood Center Place Type, Community Activity Center Place Type, Regional Activity Center Place Type, or Innovation Mixed-Use Place Type, or zoned the IC-2 or RC Zoning District, the minimum width of a pedestrian and bicycle connection shall be twelve feet, with five feet abutting each side of the path.\n\nNo buildings or structures shall be in the five foot area abutting each side of the path.\nNo fixed obstacles to pedestrian or bicycle traffic shall be within two feet of the path’s edge.\n\n\nFor parcels located in the Neighborhood 1 Place Type, Commercial Place Type, or Manufacturing and Logistics Place Type, or zoned the IC-1 or OFC Zoning District, the minimum width of a pedestrian and bicycle connection shall be eight feet, with four feet abutting each side of the path.\n\nNo buildings or structures shall be in the four foot area abutting each side of the path.\nNo fixed obstacles to pedestrian or bicycle traffic shall be within two feet of the path’s edge.\n\n\nCONNECTIONS TO OFF-STREET PUBLIC PATHS OR PARKSPEDESTRIAN AND BICYCLE CONNECTION", "metadataJson": "{\"section_url\": \"/articles/article-33-standards-for-streets-off-street-public-paths-cross-access/#335-off-street-public-paths\"}"}, {"title": "33.6 CROSS-ACCESS", "text": "A cross-access connection shall have a minimum 20 foot wide two-way paved connection.", "metadataJson": "{\"section_url\": \"/articles/article-33-standards-for-streets-off-street-public-paths-cross-access/#336-cross-access\"}"}]}