{"title": "Article 37. Amendments & Development Approvals", "metadataJson": "{\"base_url\": \"article-37-amendments-development-approvals\"}", "section": [{"title": "37.1 AMENDING THE UNIFIED DEVELOPMENT ORDINANCE", "text": "\n*A.* PurposeThe purpose of this section is to provide the process for amending the text of this Unified Development Ordinance. The purpose of an amendment to this Ordinance is to make adjustments to address changed conditions or updates to adopted policy, or to make changes intended to achieve the purposes of these regulations.\n*B.* AuthorityThe City Council shall have the authority to amend this Ordinance.\n*C.* Pre-Submittal MeetingBefore submitting a petition for an amendment to this Ordinance, the petitioner shall meet with the UDO Administrator and the designated administrator(s) and Planning Department staff related to the article(s) for which changes are being proposed. The purpose of the meeting is to share the nature of the proposed Ordinance amendment and any standards or requirements that are being proposed to be amended.\n*D.* Petition Requirements\n\nInitiationAn amendment to this Ordinance may be initiated by the City Council on its own motion, the Planning Commission on its own motion, City staff, or the public.\nPetition SubmittalAll petitions for an Ordinance amendment shall be in the form prescribed by the Planning Department, accompanied by the fee established by City Council, and submitted to the Planning Department. Petitions shall be submitted in accordance with the requirements of this Ordinance and other established guidelines, and shall include all required documents.\nPetition DeadlineComplete petitions shall be submitted in accordance with the City’s filing deadline calendar.\nDetermination of CompletenessPetitions will not be considered properly filed until deemed complete and accurate by the designated administrator.\n\n\n*E.* Staff Review and Recommendation for Ordinance Amendments\n\nThe Planning Department staff shall provide copies of the proposed amendment to other appropriate City and County departments and agencies for review and comment.\nThe Planning Department staff shall provide to the City Council and Planning Commission, prior to the scheduled hearing, a prehearing staff analysis and recommendation setting forth whether the amendment is recommended for approval or denial and the reasons for such recommendation.\n\n\n*F.* Scheduling of Public Hearing and Published Hearing Notice\n\nThe Planning Department staff shall schedule a public hearing for the amendment when all requirements have been met and after there has been adequate time for staff of the Planning Department and other City and County departments and agencies to review and provide comment on the proposed amendment.\nBefore amending this Ordinance, a legislative public hearing by the City Council is required. A notice of the hearing shall be given once a week for two successive calendar weeks in a newspaper having general circulation in the area. The notice shall be published the first time not less than ten days nor more than 25 days before the date scheduled for the hearing. In computing such period, the day of publication is not to be included but the day of the hearing shall be included.\n\n\n*G.* Legislative Public HearingThe public hearing shall be conducted by the City Council and shall be in accordance with the rules and procedures adopted by the City Council.\n*H.* Referral to Planning Commission and Recommendation from the Planning Commission\n\nAfter the public hearing and prior to the adoption of an amendment, the proposed amendment shall be submitted to the Planning Commission, or applicable committee of the Planning Commission, for review and recommendation. Hereinafter, any reference to the Planning Commission shall include any applicable committee of the Planning Commission per the Interlocal Agreement between the City of Charlotte and Mecklenburg County.\nThe Planning Commission shall review the proposed Ordinance amendment. Upon completion of review, the Planning Commission shall make a written recommendation regarding adoption of the amendment to the City Council.\nThe recommendation from the Planning Commission shall include a written statement of plan consistency. The statement shall advise and comment on whether the proposed amendment is consistent with any Comprehensive Plan that has been adopted and any other officially adopted plan that is applicable. A statement by the Planning Commission, or applicable committee of the Planning Commission, that a proposed amendment is inconsistent with the comprehensive plan and any other applicable adopted plan shall not preclude consideration or approval of the proposed amendment by City Council.\nIf no written recommendation and statement of plan consistency is received from the Planning Commission within 30 days of the public hearing, the City Council may act on the amendment without the Planning Commission recommendation.\nThe City Council is not bound by the recommendation, if any, of the Planning Commission.\n\n\n*I.* City Council Decision\n\nAfter the Planning Commission, or applicable committee of the Planning Commission, has taken action, the Planning Department staff shall place the proposed Ordinance amendment on the agenda for the next regularly scheduled City Council meeting for rezoning hearings and decisions.\nPlanning Department staff shall forward the Planning Commission’s, or applicable committee of the Planning Commission’s, written recommendation and statement of consistency to the City Council, along with an updated staff review and recommendation.\nIf any person submits a written statement regarding a proposed Ordinance amendment to the City Clerk at least two business days prior to the scheduled vote on the proposed amendment, the City Clerk shall deliver such written statement to the City Council members before action is taken.\nWhen adopting or rejecting an Ordinance amendment, the City Council shall approve a plan consistency statement describing whether the action is consistent or inconsistent with the Comprehensive Plan and any other adopted land-use plans or policies that are applicable.\nThe City Council shall either reject the proposed amendment or adopt an Ordinance enacting the proposed amendment\n\n\n*J.* Withdrawal or Modification of a Pending Ordinance Amendment\n\nWithdrawalA request to withdraw a proposed amendment shall be made to the UDO Administrator. A petition can be withdrawn by the petitioner at any time prior to the day of the first publication of the public hearing notice. After that time, the City Council shall decide, on the date scheduled for the hearing, whether to allow the withdrawal.\nModification\n\nA petitioner shall not be allowed to modify a proposed amendment after a public hearing has been scheduled unless such modification(s) are submitted to the UDO Administrator no later than four weeks prior to the scheduled public hearing. No modifications to the proposed text amendment shall be accepted in the intervening weeks prior to the public hearing. Also, no modifications to the Ordinance amendment shall be made at the public hearing; however, potential modifications proposed by the petitioner, Planning Commission, City Council, and other interested parties may be considered by the City Council at the time of the hearing, if offered.\nIf modification to the petition is proposed by the petitioner after the public hearing, and before the Planning Commission recommendation, the Planning Commission shall evaluate whether a modification is substantial enough to recommend another public hearing and make a recommendation to the City Council.\nIf the Planning Commission does not recommend another public hearing of a modified petition, it may defer action on the petition to a set date in order for staff and other interested parties to have the opportunity to review and comment on the amendment to the petition.\nIf the Planning Commission recommends that the modified petition move forward without recommending a deferral or new public hearing, the Planning Commission shall consider the revised petition and forward its recommendation to the City Council.\nIf a modification to the petition is proposed by the petitioner after the public hearing and the Planning Commission recommendation, the Planning staff shall evaluate whether the modification is substantial enough to recommend another public hearing and make a recommendation to the City Council.\nIf the Planning Commission or Planning staff recommends a new public hearing for a modified petition, this recommendation shall be provided to the City Council at the next scheduled City Council meeting for rezoning hearings and decisions.\nEven if the Planning Commission or Planning staff does not recommend a new public hearing, the City Council may, at its discretion, schedule the modified petition for a new public hearing, preceded by the notice required in Section 37.2.I.\nIf the petitioner wishes to modify the proposed Ordinance amendment after the Planning Commission recommendation and prior to a vote by the City Council, then prior to the time of the vote, the City Council shall refer the modified petition to the Planning Commission for a new review and a potentially updated recommendation unless the City Council, by a three-fourths vote of all members present, except members properly excused from voting, determines that the nature of the modification is such that the Planning Commission review and potential updated recommendation is not necessary.\n\n\n\n\n*K.* Expiration of Ordinance Amendment PetitionsIf a decision on a proposed Ordinance amendment has not been reached within two years from the submittal date of the petition, the petition shall become null and void.\n", "metadataJson": "{\"section_url\": \"/articles/article-37-amendments-development-approvals/#371-amending-the-unified-development-ordinance\"}"}, {"title": "37.2 ZONING MAP AMENDMENTS", "text": "\n*A.* PurposeThe purpose of this section is to provide a means for amending the zoning district designation of any parcel of land identified on the Official Zoning Map.\n*B.* AuthorityThe City Council shall have the authority to amend the district designation of any parcel of land, as indicated on the Official Zoning Map.\n*C.* Types of Zoning Map AmendmentsApplications for a zoning map amendment fall into three categories:\n\nConventional Zoning Map AmendmentA conventional zoning map amendment is a legislative process in which an applicant proposes changing the zoning district designation on a property or group of properties to a conventional zoning district, and the City Council considers whether to approve or deny the zoning map amendment. Conventional zoning districts allow a variety of uses permitted under the development standards of the zoning district.\nConditional Zoning Map AmendmentA conditional zoning map amendment is a legislative process in which a petitioner proposes, and the City Council considers, a zoning map amendment to a conditional zoning district that includes a site plan and individualized additional site-specific commitments. Site-specific conditions may also be proposed by the petitioner or the City, but only those site-specific conditions approved by the City and consented to by the petitioner in writing may be incorporated into the petition. Site-specific conditions shall be limited to those that address the conformance of the development and use of the site, per the Ordinance regulations, or the impacts reasonably expected to be generated by the development or use of the site.\nException (EX) District Zoning Map AmendmentAn exception (EX) district zoning map amendment is also considered a conditional zoning map amendment. An exception (EX) district zoning map amendment serves as a mechanism for altering or modifying the quantitative zoning and street cross-section standards for proposed development; however, the standards cannot be waived in their entirety. No modifications shall be made to the uses or maximum height regulations, with the exception of the height limitations when adjacent to the Neighborhood 1 Place Type. It provides a mechanism for City Council to review and consider new development concepts, innovative designs, special problems, and other unique proposals or circumstances that cannot be accommodated by the standards of a zoning district, while addressing the conformance of the development and use of the site to other applicable standards, the Comprehensive Plan, and/or the impacts reasonably expected to be generated by the development or use of the site.\n\nDistricts AllowedThe establishment of an exception (EX) district is allowed in the following districts:\n\nIn the following Transit Oriented Development Zoning Districts: TOD-UC, TOD-NC, TOC-CC, and TOD-TR. An exception (EX) district will be referred to as TOD-UC(EX), TOD-NC(EX), TOD-CC(EX) or TOD-TR(EX), depending on the base zoning district.\nIn the following Regional Activity Center Zoning Districts: UC, UE, and RAC. An exception (EX) district will be referred to as UC(EX), UE(EX), or RAC(EX), depending on the base zoning district.\nIn the following Community Activity Center Zoning Districts: CAC-1, CAC-2. An exception (EX) district will be referred to as CAC-1(EX) or CAC-2(EX), depending on the base zoning district.\nIn the following Neighborhood Center Zoning Districts: NC. An exception (EX) district will be referred to as NC(EX).\nIn the following Innovation Mixed-Use Zoning Districts: IMU. An exception (EX) district will be referred to as IMU(EX).\nIn the following Campus Zoning Districts: IC-2 and RC. An exception (EX) district will be referred to as IC-2(EX) or RC(EX), depending on the base zoning district.\nIn the following Neighborhood 2 Zoning Districts: N2-C. An exception (EX) district will be referred to as N2-C(EX).\n\n\nException (EX) District Public Benefits RequiredAn exception (EX) district is required to provide public benefits. Public benefits shall include one or more actions from at least two of the following categories: 1) sustainability; 2) public amenity; and 3) city improvement. Where an exception (EX) district utilizes a bonus system, actions cannot apply to both the bonus action and the public benefit.\n\nSustainability\n\n*(A)* The following qualify as sustainability actions. Such actions shall exceed the minimum requirements of this Ordinance and the City Code of Ordinances, if applicable.\n\n*(1)* Use of sustainable design and architecture that meets established standards, such as Leadership in Energy and Environmental Design (LEED), Energy Star, Earthcraft, etc.\n*(2)* Adaptive reuse of existing buildings.\n*(3)* Preservation of on-site environmental features.\n*(4)* On-site renewable energy generation.\n\n\n*(B)* Additional actions that further sustainability of the development not listed above may be allowed during the review and approval of an exception (EX) district zoning map amendment.\n\n\nPublic Amenity\n\n*(A)* The following qualify as a public amenity action. Such actions shall exceed the minimum Ordinance requirements, if applicable.\n\n*(1)* Creation of publicly accessible open space, including parks and playgrounds, dog parks, public plazas and festival spaces, and similar outdoor recreational features.\n*(2)* Incorporation of an affordable housing set-aside.\n\n\n*(B)* Additional public amenities not listed above may be allowed during the review and approval of the exception (EX) district zoning map amendment.\n\n\nCity ImprovementsThe following qualify as city improvements actions:\n\n*(A)* Public improvements above those required by this Ordinance, following consultation with staff and other applicable public entities, such as Mecklenburg County or state authorities.\n*(B)* These improvements include, but are not limited to, new construction or improvements to existing streets, medians, pedestrian pathways, bike paths, pedestrian drop-off areas, and transit stops. Improvements shall not include driveway-related improvements in excess of those allowed in N.C.G.S. § 136-18(29) and N.C.G.S. § 160A-307, or other unauthorized limitations on the development or use of land.\n\n\n\n\n\n\n\n\n*D.* Pre-Submittal MeetingBefore filing a petition for a zoning map amendment(s), the petitioner shall meet with the Planning Department staff to discuss the nature of the proposed zoning map amendment, the standards for development under the existing and proposed zoning district, and concerns that persons residing in the vicinity of the property may have regarding the proposed zoning map amendment, if known.\n*E.* Petition Requirements\n\nInitiationInitiation of zoning map amendments shall be as follows:\n\nConventional Zoning DistrictsPetition applications for a zoning map amendment may be initiated by City Council, any property owner with a legal interest in the property, anyone authorized in writing to act on the owner’s behalf, any person having an interest in the property by reason of a written contract with the owner, or any non-owner, including City and County staff.\nConditional Zoning Districts and Exception (EX) DistrictsPetition applications for a zoning map amendment to a conditional district, including an exception (EX) district, may only be initiated by the owner of a legal interest in the affected property, any person having an interest in the property by reason of a written contract with owner, or an agent authorized in writing to act on the owner’s behalf.\nDown-ZoningExcept for a City or County initiated zoning map amendment, no zoning map amendment that down-zones property shall be initiated nor is it enforceable without the written consent of all property owners whose property is the subject of the down-zoning amendment.\n\n\nPetition Submittal\n\nAll petitions for a zoning map amendment shall be in the form prescribed by the Planning Department, accompanied by the fee established by City Council, and submitted to the Planning Department. Petitions shall be submitted in accordance with the requirements of this Ordinance and other established guidelines, and shall include all required documents.\nPetitions for a conditional zoning map amendment shall be submitted and signed by the owners of all of the property to be included in the conditional district.\n\n\nPetition DeadlineComplete petitions shall be submitted in accordance with the City’s filing deadline calendar.\nAdditional Documents for Conditional District Zoning Map Amendments\n\nA petition for conditional zoning shall include a site plan, drawn to scale, and supporting information and text that specifies the actual use or uses intended for the property and any rules, regulations, and conditions that, in addition to all Ordinance requirements, will govern the development and use of the property. Conditions and site-specific standards shall be limited to those that address the conformance of the development and use of the site to City ordinances and the adopted Comprehensive Plan, or other adopted plans, and the impacts reasonably expected to be generated by the development or use of the site. Any such conditions should relate to items regulated by the Ordinance, as well as the type of development and other matters that the City Council may find appropriate or the petitioner may propose. The following information, including dimensions shall be provided and labeled, if applicable:\n\nA tax parcel identification number for all whole parcel(s) and a boundary survey for any partial parcel(s).\nA vicinity map showing the property’s total acreage, its zoning district designation(s), the general location in relation to major streets, railroads, and/or waterways, the date, and north arrow.\nAll existing easements, reservations, and rights-of-way.\nLocation of new public and network-required private streets.\nAreas in which structures will be located and location of structures that will remain.\nProposed use of all land and structures, including the number of residential units and the total square footage of any nonresidential development.\nAll setbacks, landscape yards, screening, and other landscaping required by these regulations or proposed by the petitioner.\nAll existing and proposed points of access to public streets and network-required private streets.\nWater quality buffers, pursuant to Article 26, and delineation of areas within the regulatory floodplain as shown on the Official Flood Hazard Boundary Maps for Mecklenburg County.\nProposed phasing, if any.\nThe location of existing and proposed storm drainage patterns and facilities intended to serve the proposed development.\nGeneralized traffic, parking, and circulation plans.\nTree survey, if required by Section 20.18.\nTree requirements of Sections 20.13 through 20.18.\nTransportation improvements required in Articles 29 through 34.\n\n\nThe Planning Director has the authority to waive any requirement where the type of use or scale of proposal makes providing that information unnecessary or impractical.\nIn the course of evaluating the proposed use, the Planning Department and other departments reviewing the proposal, Planning Commission, or City Council may request additional information from the petitioner. This information may include the following:\n\nProposed number and general location of all structures.\nProposed screening, buffers, and landscaping over and above that required by these regulations, as well as proposed treatment of any existing natural features.\nExisting and general proposed topography, if available, at five foot contour intervals or less.\nThe location of significant trees on the subject property.\nScale of buildings relative to abutting property.\nHeight of structures.\nExterior features of proposed development.\nAny other information needed to demonstrate compliance with these regulations.\nProposed number and location of signs.\n\n\n\n\nAdditional Documents for Exception (EX) District Zoning Map Amendments\n\nA petition for an exception (EX) district zoning map amendment shall include a site plan, drawn to scale, and supporting information and text that specifies the actual use or proposed use for the property and any rules, regulations, and conditions that, in addition to all Ordinance requirements, will govern the development and use of the property. The following information shall be provided:\n\nA tax parcel identification number for all whole parcel(s) and a boundary survey for any partial parcel(s).\nA vicinity map showing the property’s total acreage, its zoning district designation(s), the general location in relation to major streets, railroads, and/or waterways, the date, and north arrow.\nAll existing easements, reservations, and rights-of-way.\nLocation of new public and network-required private streets.\nPublic benefits associated with the proposal, per Section 37.2.C.3.b.\nOther information needed to assess the request as determined by the Planning Director.\n\n\n\n\nDetermination of CompletenessPetitions will not be considered properly filed until deemed complete, and accurate by the designated administrator.\n\n\n*F.* Community Meeting\n\nA community meeting shall be required for all zoning map amendment petitions, as outlined/determined by City policy.\nBefore a public hearing may be held on a petition, the petitioner shall file a written report with the City Clerk stating that at least one community meeting was held by the petitioner. The report shall include, among other things, a listing of those persons and organizations contacted about the meeting and the manner and date of contact, the date, time and location of the meeting, a roster of the persons in attendance at the meeting, a summary of issues discussed at the meeting, and a description of any changes to the rezoning petition made by the petitioner as a result of the meeting.\nIf a public hearing has not been held within six months of a community meeting, then another community meeting shall be held.\n\n\n*G.*  Staff Review and Recommendation of Zoning Map Amendments\n\nThe Planning Department staff shall provide copies of the proposed amendment to other appropriate City and County departments and agencies for review and comment.\nThe Planning Department staff shall provide to the City Council and Planning Commission, or the applicable committee of the Planning Commission, prior to the scheduled hearing, a prehearing staff analysis and recommendation setting forth whether the amendment is recommended for approval or denial and the reasons for such recommendation.\n\n\n*H.* Scheduling of Public Hearing\n\nThe Planning Department staff shall schedule a public hearing for the zoning map amendment when all requirements have been met and after there has been adequate time for staff of the Planning Department and other City and County departments and agencies to review and provide comment on the proposed amendment.\nBefore approving a zoning map amendment, a legislative public hearing by the City Council is required. A notice of the hearing shall be given once a week for two successive calendar weeks in a newspaper having general circulation in the area. The notice shall be published the first time not less than ten days nor more than 25 days before the date scheduled for the hearing. In computing such period, the day of publication is not to be included but the day of the hearing shall be included.\n\n\n*I.* Legislative Hearing NoticeThe legislative hearing notices shall be in compliance with N.C.G.S. § 160D-602, as follows:\n\nMailed NoticeProperty owners of parcels of land included in the zoning map amendment and the owners of land adjacent to the parcel(s) of land shall be mailed a notice of the hearing on a proposed zoning map amendment by first-class mail at the last addresses listed for such owners on the Mecklenburg County tax abstract. The notice shall be deposited in the mail at least ten but not more than 25 days prior to the date of the hearing.\nPublished Notice\n\nZoning Map Amendment NoticeA notice of the legislative hearing shall be given once a week for two successive calendar weeks in a newspaper having general circulation in the area. The notice shall be published the first time not less than ten days nor more than 25 days before the date scheduled for the hearing. In computing such period, the day of publication is not to be included but the day of the hearing shall be included.\nOptional Notice for Large-Scale Zoning Map AmendmentsThe first-class mail notice required under item 1 above is not required if the zoning map amendment proposes to change the zoning designation of more than 50 properties, owned by at least 50 different property owners, and the City elects to use the expanded published notice provided for in this section. The City may elect to make the mailed notice provided for in item 1 above or, as an alternative, elect to publish notice of the hearing as required by N.C.G.S. § 160D-602(b), provided that each advertisement shall not be less than one-half of a newspaper page in size. The advertisement is effective only for property owners who reside in the area of general circulation of the newspaper that publishes the notice. Property owners who reside outside of the newspaper circulation area, according to the address listed on the most recent property tax listing for the affected property, shall be notified according to the provisions of item a above.\n\n\nPosted NoticeA notice of the hearing shall be prominently posted on the site proposed for the zoning map amendment or on an adjacent street or highway right-of-way. The notice shall be posted within the same time period specified for mailed notices of the hearing. When multiple parcels are included within a proposed zoning map amendment, a posting on each individual parcel is not required but the City shall post sufficient notices to provide reasonable notice to interested persons.\n\n\n*J.* Legislative Public HearingThe legislative public hearing shall be conducted by the City Council and shall be in accordance with any rules and procedures adopted by the City Council.\n*K.* Referral to Planning Commission and Recommendation from the Planning Commission\n\nAfter the public hearing and prior to the adoption of a zoning map amendment, the proposed amendment shall be submitted to the Planning Commission for review and recommendation. Hereinafter, any reference to the Planning Committee shall include any applicable committee of the Planning Commission per the Interlocal Agreement between the City of Charlotte and Mecklenburg County.\nThe Planning Commission shall review the proposed zoning map amendment. The review shall consider the zoning evaluation criteria in Sections 37.2.L, 37.2.M, and 37.2.N, as applicable. Upon completion of the review, the Planning Commission shall make a written recommendation regarding adoption of the amendment to the City Council.\nThe recommendation from the Planning Commission shall include a written statement of plan consistency. The statement shall advise and comment on whether the proposed amendment is consistent with the Comprehensive Plan and any other adopted plan or policies that are applicable. A statement by the Planning Commission that a proposed amendment is inconsistent with the Comprehensive Plan or other applicable plans or policies shall not preclude consideration or approval of the proposed amendment by City Council.\nIf no written recommendation and statement of plan consistency is received from the Planning Commission within 30 days of the public hearing, the City Council may act on the amendment without the Planning Commission recommendation. If the Planning Commission does not make a recommendation within 30 days after the petition has been referred to it, then the Planning Commission shall be considered to have made a favorable recommendation, unless action was taken to defer.\nThe City Council is not bound by the recommendation, if any, of the Planning Commission.\n\n\n*L.* Zoning Evaluation Criteria – Conventional Zoning Map Amendments\n\nWhen considering a petition for a zoning map amendment to a conventional zoning district, the City Council and Planning Commission shall not evaluate the petition based on any specific proposal for the use or development of the affected property and the petitioner shall refrain from using any graphic materials or descriptions of the proposed use or development except for those which would apply to any use permitted in the requested zoning district.\nIn considering any petition for a zoning map amendment to a conventional zoning district, the City Council and Planning Commission may consider the following:\n\nWhether the proposed zoning map amendment is consistent with the purposes, goals, objectives, and policies of the Comprehensive Plan and any other adopted plans or policies that are applicable.\nWhether all the uses allowed by the proposed zoning district would be acceptable uses within the context of the area and ensure compatibility with the use and enjoyment of neighboring properties.\nThe adequacy of public facilities and services intended to serve the subject property.\nWhether the proposed rezoning will adversely affect a known archaeological, environmental, historical, or cultural resource.\nWhether the proposed rezoning will further City goals of sustainability and resiliency. Zoning Evaluation Criteria -Conditional Zoning Map Amendment\n\n\n\n\n*M.* Zoning Evaluation Criteria -Conditional Zoning Map Amendment\n\nIn considering any petition for a zoning map amendment to a conditional zoning district, the City Council may consider the following:\n\nWhether the proposed zoning map amendment is consistent with the purposes, goals, objectives, and policies of the adopted Comprehensive Plan and any other adopted plans or policies that are applicable.\nWhether the proposed zoning map amendment is compatible with the overall character of existing development in the vicinity of the subject property, and the uses acceptable within the context of the area.\nThe adequacy of public facilities and services intended to serve the subject property.\nWhether the proposed zoning map amendment will adversely affect a known archaeological, environmental, historical, or cultural resource.\nWhether the proposed rezoning will further City goals of sustainability and resiliency.\n\n\nWhen considering any petition for a zoning map amendment to a conditional district, the City Council and Planning Commission shall not discriminate against affordable housing units for families or individuals with incomes below 80% of area median income. Rezoning of property by the City Council based on considerations of limiting high concentrations of affordable housing is permissible.\n\n\n*N.* Zoning Evaluation Criteria -Exception (EX) District Zoning Map Amendment\n\nIn considering an exception (EX) district zoning map amendment, the City Council may consider the following:\n\nThe evaluation criteria for conditional zoning map amendments in Section 37.2.M.1 above.\nThe public purpose to be served by permitting the requested modifications.\nConsistency with any applicable adopted City Council policies for the area.\nCompatibility with surrounding development or protection of unique existing elements.\nWhether the proposed rezoning will further City goals of sustainability and resiliency.\nWhether the modification is the minimum necessary.\nThe quality of the design of the structures and the site, including innovative development techniques.\nWhether the district allows for new forms of architecturally and/or environmentally innovative design.\nWhether the district encourages the redevelopment, restoration, and/or adaptive reuse of existing structures, if applicable.\n\n\nWhen considering any petition for a zoning map amendment to an exception (EX) district, the City Council and Planning Commission shall not discriminate against affordable housing units for families or individuals with incomes below 80% of area median income. Rezoning of property by the City Council based on considerations of limiting high concentrations of affordable housing is permissible.\n\n\n*O.* City Council Decision\n\nAfter the Planning Commission or the applicable committee of the Planning Commission has taken action, the Planning Department staff shall place the proposed zoning map amendment on the agenda for the next regularly scheduled City Council meeting for rezoning hearings and decisions.\nPlanning Department staff shall forward the Planning Commission, or the applicable committee of the Planning Commission, written recommendation and statement of consistency for the zoning map amendment to the City Council, along with an updated staff review and recommendation.\nIf any person submits a written statement regarding a proposed zoning map amendment to the City Clerk at least two business days prior to the scheduled vote on the proposed amendment, the City Clerk shall deliver such written statement to the City Council members before action is taken.\nPrior to a City Council decision, the petitioner for any conditional, including an exception (EX) district, zoning map amendment, shall agree in writing to the conditions submitted for the proposed map amendment.\nThe City Council shall review the proposed zoning map amendment. City Council’s review shall consider the zoning map amendment evaluation criteria of this section.\nOnly those conditions approved by the City Council and consented to by the petitioner in writing may be incorporated into a conditional or exception (EX) district zoning map amendment. Unless consented to by the petitioner in writing, the City may not require, enforce, or incorporate into the zoning regulations any condition or requirement not authorized by applicable law.\nWhen adopting or rejecting any zoning map amendment, the City Council shall approve a statement of plan consistency and reasonableness.\n\nPlan Consistency\n\nThe statement of plan consistency shall describe whether the City Council’s action is consistent or inconsistent with an adopted Comprehensive Plan.\nIf a zoning map amendment is adopted and the action was deemed inconsistent with the Comprehensive Plan, the zoning map amendment shall have the effect of also amending the adopted Policy Map and any applicable area plans that have been adopted.\n\n\nStatement of Reasonableness\n\nA statement analyzing the reasonableness of the proposed rezoning shall be approved by the City Council. The statement of reasonableness may consider, among other factors:\n\n*(A)* The size, physical conditions, and other attributes of the area proposed to be rezoned.\n*(B)* The benefits and detriments to the landowners, the neighbors, and the surrounding community.\n*(C)* The relationship between the current actual and permissible development on the tract and adjoining areas and the development that would be permissible under the proposed amendment.\n*(D)* The action taken is in the public interest.\n*(E)* Any changed conditions warranting the amendment.\n\n\n\n\n\n\nIf the City Council approves the zoning map amendment, it shall adopt an ordinance enacting the proposed amendment.\nIn approving a zoning map amendment to a conventional district, or with the consent of the petitioner in the rezoning to a conditional zoning district, including an exception (EX) district, the City Council may change the existing zoning designation of the property, or any part of the property covered by the petition, to another zoning district. This action may occur without the withdrawal or modification of the petition or further public hearings.\n\n\n*P.* Conditional Zoning Approval in a City General Election YearThe City Council may not vote on a zoning map amendment to a conditional zoning district during the time period beginning on the date of a municipal general election and concluding on the date immediately following the date on which the City Council holds its organizational meeting following a municipal general election unless no person spoke against the rezoning at the public hearing.\n*Q.* Withdrawal of Modification of Pending Zoning Map Amendment Petition\n\nWithdrawalA request to withdraw a proposed zoning map amendment shall be made to the Planning Department staff. A petition can be withdrawn by the petitioner at any time prior to the day of the first publication of the public hearing notice. After that time, the City Council shall decide, on the date scheduled for the hearing, whether to allow the withdrawal.\nModification\n\nA petitioner shall not be allowed to modify a proposed zoning map amendment after a public hearing has been scheduled unless such modification(s) are submitted to the UDO Administrator no later than four weeks prior to the scheduled public hearing. No modifications to the proposed zoning map amendment shall be accepted in the intervening weeks prior to the hearing. Also, no modifications to the proposed zoning map amendment shall be made at the hearing; however, potential modifications proposed by the petitioner, Planning Commission, City Council, and other interested parties may be considered by the City Council at the time of the hearing, if offered.\nIf modification to the petition is proposed by the petitioner after the public hearing, and before the Planning Commission recommendation, the Planning Commission shall evaluate whether a modification is substantial enough to recommend another public hearing, and make a recommendation to the City Council.\nIf the Planning Commission does not recommend another public hearing of a modified petition, it may defer action on the petition to a set date in order for staff and other interested parties to have the opportunity to review and comment on the amendment to the petition.\nIf the Planning Commission recommends that the modified petition move forward without recommending a deferral or new public hearing, the Planning Commission shall consider the revised petition and forward its recommendation to the City Council.\nIf a modification to the petition is proposed by the petitioner after the public hearing and the Planning Commission recommendation, the planning staff shall evaluate whether the modification is substantial enough to recommend another public hearing and make a recommendation to the City Council.\nIf the Planning Commission recommends that the modified petition move forward without recommending a deferral or new public hearing, the Planning Commission shall consider the revised petition and forward its recommendation to the City Council.\nEven if the Planning Commission or Planning staff does not recommend a new public hearing, the City Council may, at its discretion, schedule the modified petition for a new public hearing, preceded by the notice required in Section 37.2.I.\nIf the petitioner wishes to modify the proposed zoning map amendment after the Planning Commission’s recommendation and prior to a vote by the City Council, then prior to the time of the vote, the City Council shall refer the modified petition to the Planning Commission for a new review and a potentially updated recommendation unless the City Council, by a three-fourths vote of all members present, except members properly excused from voting, determines that the nature of the modification is such that the Planning Commission review and potential updated recommendation is not necessary.\n\n\n\n\n*R.*  Effect of Approval and Denial of Zoning Map Amendment\n\nEffect of ApprovalIf a petition for zoning map amendment to a conditional zoning, including an exception (EX) district, is approved, the development and use of the property shall be governed by the requirements of the zoning regulations in place at the time of the zoning map amendment approval, as well as the site plan and conditions of the approved conditional zoning district.\nEffect of Denial\n\nA petition for a zoning map amendment for a property that has been denied, in whole or in part, or approved to a zoning district other than the one originally requested, shall not be resubmitted within two years of the date of the City Council’s action on the original petition, except as permitted in item b below. This section shall not apply to rezoning petitions initiated by someone other than the property owner or authorized agent.\nThe City Council may, by a majority vote, allow resubmission of a zoning map amendment petition within the two-year time frame if it determines that, since the date of action on the prior petition, one or more of the following guidelines have been met:\n\nThere has been a similar or more intensive change in the zoning district designation of an adjacent property.\nThe City Council has adopted a public policy plan, an updated Comprehensive Plan, an area plan, or a transportation plan that changes public policy regarding how the property affected by the amendment should be developed.\nConstruction or expansion of a road, water line, sewer line, or other infrastructure has occurred to serve the property and which infrastructure can accommodate the intensity of development allowed under the proposed classification.\nThere has been some other substantial change in conditions or circumstances which justifies waiver of the two-year restriction on a new petition. This shall not include a change in the ownership of the subject property or, in the case of a petition for a zoning map amendment to a conditional zoning district, a change in the scale or features of the development proposed in the prior petition.\n\n\nPrior to voting on the resubmission, the City Council shall receive a report from the Planning Department containing its recommendations on resubmission of the petition.\n\n\n\n\n*S.* Changes to an Approved Conditional and Exception (EX) District Rezoning PetitionsChanges to approved conditional and exception (EX) plans and conditions of development will require a new application for a zoning map amendment, with a new public hearing, unless an approved administrative amendment, administrative minor adjustment, or variance is approved to allow the change\n*T.* Expiration of Zoning Map Amendment PetitionIf a decision on a proposed zoning map amendment has not been reached within two years from the date the zoning map amendment petition is submitted and deemed complete, then the petition shall become null and void.\n", "metadataJson": "{\"section_url\": \"/articles/article-37-amendments-development-approvals/#372-zoning-map-amendments\"}"}, {"title": "37.3 ADMINISTRATIVE MINOR AMENDMENTS", "text": "A. Purpose and Applicability\nAn administrative minor amendment is defined as an amendment to a conditional zoning district, which includes an exception (EX) district, that does not significantly alter a conditional or exception (EX) site plan or its conditions and the change does not have a significant impact upon adjacent properties.\nAll other modifications to the conditions of an approved conditional or exception (EX) district require a new zoning map amendment petition.\nB. Administrative Minor Amendment Process\nApplication\n\nAny petition for an administrative minor amendment shall include the details of the requested change and shall be on a form prescribed by the Planning Department, signed by the property owner(s), and submitted to the Planning Director. Accompanying the petition shall be the applicable fee for administrative review. Upon request, the petitioner shall provide any additional information that is requested.\nIf multiple parcels of land are subject to an approved conditional or exception (EX) district, the owners of individual parcels may apply for an administrative minor amendment to modify the conditions on their parcels so long as the modification would not result in other properties failing to meet the approved site plan, conditions, and standards of the zoning district and other regulations in the UDO or remove entitlements from other individual parcels without the owner’s consent. Any modifications approved through an administrative minor amendment shall apply only to those properties whose owners apply for the administrative minor amendment.\nAny changes that increase the density (number of dwelling units per acre) of the development or change allowed uses are considered to be significant changes that cannot be considered through an administrative minor amendment and shall go through the zoning map approval process to amend the conditional or exception (EX) site plan and conditions. Other significant changes to an approved site plan that cannot be considered an administrative minor amendment include the following:\n\nIncreasing the number of buildings.\nAdding driveway connections to arterials or limited access roads.\nReducing vehicular or bicycle parking spaces below the minimum number or above the maximum number in conditional and exception (EX) plans.\nReducing landscape yards and setbacks.\nMoving structures closer to abutting properties in a Neighborhood 1 Place Type or Neighborhood 2 Place Type or closer to a single family, duplex, triplex, or quadraplex dwelling.\nReducing open space.\nChanging owner occupied units to rental if noted on the site plan.\nIncreasing the mass of buildings.\n\n\n\n\nStaff Authority and Decision\n\nThe Planning Director shall have the authority to approve or deny an administrative minor amendment to an approved conditional or exception (EX) plan or conditions. The standard for approving or denying such a requested change shall be that the change does not significantly alter the site plan or its conditions and the change does not have a significant impact upon abutting properties.\nThe Planning Director shall also have the discretion to decline to exercise the authority due to uncertainty about approval of the change pursuant to the standard or because a rezoning petition for a public hearing and City Council consideration is deemed appropriate under the circumstances. If the Planning Director declines to exercise this authority, then the applicant can only file a rezoning petition for a new public hearing and Council decision.\n\n\nNotification of DecisionThe Planning Director making the decision on a request for an administrative minor amendment shall give written notice to the property owner and to the party who sought the decision, if different from the property owner. The notice may be issued in print or electronic form. Any decision issued exclusively in electronic form shall be protected from further editing once issued. The written notice of the decision shall be delivered by personal delivery, email, or first-class mail. If the notice is sent by first-class mail, the notice shall be sent to the last address listed for the property owner or the affected property on the Mecklenburg County tax abstract, and to the address provided in the application if the owner is not the petitioner.\nAppeals of Administrative Minor Amendment Decisions\n\nThe property owner or petitioner shall have 30 days from receipt of the written notice of decision within which to file an appeal with the clerk to the UDO Board of Adjustment. Any other person with standing to appeal has 30 days from receipt from any source of actual or constructive notice of the decision within which to file an appeal. In the absence of evidence to the contrary, notice given by first-class mail is deemed received on the third business day following deposit of the notice for mailing with the United States Postal Service.\nThe UDO Board of Adjustment shall hold an evidentiary hearing to hear the appeal. The UDO Board of Adjustment may affirm, reverse, or modify the decision under appeal, making findings of fact and conclusions of law to support its decision.\nAppeals of the UDO Board of Adjustment decision may be made to Mecklenburg County Superior Court.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-37-amendments-development-approvals/#373-administrative-minor-amendments\"}"}, {"title": "37.4 ADMINISTRATIVE ADJUSTMENTS", "text": "A. Administrative Adjustments for Quantitative Regulations\nPurpose and ApplicabilityAdministrative adjustments to quantitative regulations allow for adjustment of quantitative regulations in the zoning regulations (Articles 3 through 22), except where articles specifically state otherwise. For other articles, administrative adjustments fall under the jurisdiction of the corresponding administrator.\nAuthority\n\nThe designated administrator for each article has the authority to administratively adjust the quantitative standards in the articles listed in item 1 above.\n\nStandards may be adjusted by up to 10% by the designated administrator.\nAny changes that exceed the 10% threshold are not eligible for an administrative adjustment.\n\n\nThe Zoning Administrator shall have the authority to approve a handicap ramp or other encroachment compliant with ADA standards, if the encroachment is required by law and there is no other reasonable location.\nThe Zoning Administrator shall have the authority to approve an administrative adjustment to allow an encroachment into the frontage, side setback, rear setback, or landscape yards for the restoration or replacement of historic features on an existing structure in accordance with Section 14.1.\n\n\nZoning Exceptions and Limitations\n\nThe Zoning Administrator may not adjust quantitative standards related to zoning bonus provisions, density (residential units per acre), or signs.\nThe Zoning Administrator may not adjust specific conditions of an approved conditional zoning or exception zoning.\nThe Zoning Administrator may grant up to a 10% administrative adjustment or a two-foot administrative adjustment, whichever is greater, for frontages, side setbacks, rear setbacks, and landscape yards.\n\n\nProcedure\n\nAny request for an administrative adjustment shall include the details of the requested change, including a scaled survey or site plan, and shall be on an application form prescribed by the Planning Department, signed by the property owner(s), and submitted to the designated Administrator. Accompanying the application shall be the applicable fee for administrative review. Upon request, the applicant shall provide any additional information that is requested.\nThe designated administrator shall take reasonable steps to inform the owners of property abutting on that side of the location of the requested administrative adjustment or on all sides if all sides would be affected. The designated administrator shall inform the relevant abutting owner(s) that the owner is entitled to object. The abutting owner(s) shall have ten working days from the date of the letter to make comments to the Administrator. The designated administrator shall take into consideration any comments received. If any person with standing objects to the administrative adjustment with a stated reason before the written decision, the administrative adjustment shall be denied and the applicant may file for a variance.\nAny request for a zoning administrative adjustment shall be reviewed by the Zoning Administrator and shall meet any one of the following four conditions to be approved:\n\nThe physical contours of the street, the land, or some other topographical or geographical feature is the basis for the error.\nThe physical layout of the land and the structures upon the land are such that the Ordinance requirement cannot be met.\nBecause of the nature of the abutting property or intervening topographical or geographical features, the application of the Ordinance requirement would not serve a useful purpose.\nThe applicant has agreed to measures that would ameliorate the deviation from complete compliance with the Ordinance requirement.\nAn inadvertent error occurred which warrants the administrative adjustment. An inadvertent error includes, but is not limited to, a surveying error, a misunderstanding of a property line, or an error on the part of City or County staff.\n\n\nFor other administrative adjustment requests, the designated administrator shall review the administrative adjustment request against the following standards and determine that the adjustment meets each standard:\n\nIs consistent with the overall intent of the applicable regulation or zoning district.\nRelieves a minor practical difficulty or supports compliance with ADA standards.\nDoes not have a negative impact on public health, safety, and welfare.\n\n\n\n\nDecision and Notification\n\nThe designated administrator may approve or deny the administrative adjustment. The administrator may also determine that the proposed adjustment is outside of the general intent of an administrative adjustment and decline to review the administrative adjustment.\nThe designated administrator shall give written notice to the owner of the property and to the party that sought the decision, if different from the property owner. The decision may be issued in print or electronic form. Any decision issued exclusively in electronic form shall be protected from further editing once issued. The written notice of the decision shall be delivered by personal delivery, email, or first-class mail. If the notice is sent by first-class mail, the notice shall be sent to the last address listed for the property owner or the affected property on the Mecklenburg County tax abstract, and to the address provided in the application if the owner is not the applicant.\n\n\nAppeals of Administrative Adjustment DecisionsThe property owner or applicant shall have 30 days from receipt of the written notice of decision within which to file an appeal with the clerk of the UDO Board of Adjustment. In the absence of evidence to the contrary, notice given by first-class mail is deemed received on the third business day following deposit of the notice for mailing with the United States Postal Service.\n", "metadataJson": "{\"section_url\": \"/articles/article-37-amendments-development-approvals/#374-administrative-adjustments\"}"}, {"title": "37.5 HISTORIC DISTRICT CERTIFICATE OF APPROPRIATENESS", "text": "The regulations and requirements for a historic district certificate of appropriateness are located in Section 14.1.", "metadataJson": "{\"section_url\": \"/articles/article-37-amendments-development-approvals/#375-historic-district-certificate-of-appropriateness\"}"}, {"title": "37.6 VESTED RIGHTS", "text": "Pursuant to N.C.G.S. Chapter 160D-102, “Definitions, Chapter 160D-108, “Vested Rights and Permit Choice”, and Chapter 160D-108.1, “Vested-Rights – Site Specific Vesting Plans, “there are 5 types of vested rights outlined in this section, with different vested right time periods and provisions: site-specific vesting plans, multi-phased development plans, preliminary subdivision plans, development permit vesting, and common-law vesting.A. Applicability\nThe establishment of a vested right in this section does not preclude vesting under one or more of the other types of vesting outlined in this section.\nA vested right, once established, precludes any action by the City that would change, alter, impair, prevent, diminish, or otherwise delay the development or use of the property allowed by the applicable land development regulations(s), except where a change in State or federal law mandating City and County enforcement occurs after the development application is submitted that has a fundamental and retroactive effect on the development or use.\nVested rights run with the land, except for the use of land for outdoor advertising governed by N.C.G.S. Chapter 136-131.1 and 136-131.2 in which case the vested rights granted run with the owner of a permit issued by the North Carolina Department of Transportation.\nB. Site-Specific Vesting PlansA site-specific vesting plan is a development plan in which the applicant receives vesting approved by City Council. A site-specific plan provides a description of the type and intensity of use for a specific parcel(s) of property. The approval of such plans gives the owner the right to undertake and complete the development and use of said property under the terms and conditions of the site specific development plan, in accordance with N.C.G.S. Chapter 160D­108.1(a), (b), and (c), including any amendments.\nSite-Specific Development PlansConditional district (CD) and exception (EX) zoning map amendments are identified as site-specific vesting plans in this Ordinance.\nApproval\n\nA site-specific vesting plan associated with a conditional (CD) or exception EX zoning map amendment is approved by City Council, after notice and a legislative public hearing in accordance with Section 37.2, “Zoning Map Amendments.”\nA vested right becomes effective upon the date of approval.\n\n\nDurationConditional and exception (EX) zoning map amendments are vested for a period of two years. An extended five-year vesting may be requested by a petitioner and approved by City Council through a zoning map amendment, for development where such extended period is warranted in light of all relevant circumstances, including but not limited to, the size and phasing of development, the level of investment, the need for the development, economic cycles, and market conditions, or other considerations.\nTerminationA site-specific vested right terminates at the end of the applicable vesting period with respect to buildings and uses for which no valid building permit applications have been filed.\nC. Multi-Phased Development Vesting PlansA multi-phase development is a development containing at least 25 acres or more, planned to be developed in more than one phase, and subject to a master plan. A multi-phased development plan provides a description of committed elements including the type and intensity of uses for each phase.\nApprovalA multi-phased development plan including committed elements showing the type and intensity of use for each phase associated with a conditional (CD) or exception (EX) zoning map amendment is approved by City Council, after notice and a legislative public hearing in accordance with Section 37.2, “Zoning Map Amendments.”\nDurationThe entire multi-phase development is vested at the time of the site plan approval of a conditional (CD) or exception (EX) zoning map amendment. The vesting is valid for seven years and is for the development regulations in place at the time of the approval.\nTerminationA vested right for a multi-phased development plan expires at the end of the applicable vesting period.\nD. Other Provisions for Site-Specific and Multi-Phased Development Vesting Plans\nIf a variance is required for a site-specific plan, it shall be obtained prior to the approval of a site-specific vesting plan, per N.C.G.S. 160D-108.1(a).\nApproval of site-specific vesting does not preclude the application of overlay zoning regulations which impose additional requirements, but do not affect the allowable type or intensity of use, or regulations which are general in nature and are applicable to all property subject to development regulation.\nNew zoning regulations that occur after the approval of site-specific and multi-phased development vesting plans do not override the specific conditions and zoning regulations in effect at the time of approval of the conditional (CD) or exception (EX) site-specific or multi-phased development plans.\nFollowing approval of a site-specific or multi-phased development vesting plan, the City and/or County may make subsequent reviews and require subsequent approvals to ensure compliance with the terms and conditions of the original approval.\nAn approved site-specific or multi-phased development vesting plan and its conditions may be amended with the approval of the owner and the City through a zoning map amendment in accordance with Section 37.2, or through an administrative minor amendment in accordance with Section 37.3.\nThe establishment of a site-specific or multi-phased development vested right does not preclude, change, or impair the authority of the City to adopt and enforce development regulations governing nonconforming situations or uses.\nThe City may revoke the original site-specific or multi-phased development plan approval for failure to comply with applicable terms and conditions of the original approval or the applicable local development regulations in accordance with N.C.G.S. Chapter 160D-403(f).\nE. Preliminary Subdivision Plan Vesting\nApprovalA preliminary subdivision plan is approved by the Subdivision, Streets, and Infrastructure Administrator in accordance with Section 30.6.\nDurationA preliminary subdivision plan approval is vested for a period of three years, allowing the developer to begin construction, including installation of utilities associated with the plan approval. After the installation has occurred, the plan remains valid until construction is complete. If no construction is started within three years, the preliminary subdivision plan is no longer valid and a new plan submittal and approval are required.\nF. Development Permit Vesting ProvisionsDevelopment permits are administrative and quasi-judicial approvals that are required prior to commencing development or undertaking a specific activity, project, or development proposal, including, but not limited to, zoning permits, sign permits, site plan approvals, variances, certificates of appropriateness, driveway permits, soil erosion and sedimentation control permits, stormwater and land disturbance permits.\nApprovalUpon approval and issuance of a development permit, vesting becomes effective upon the date the application was filed, as long as the permit remains valid, in accordance with N.C.G.S. Chapter 143-755.\nDurationDevelopment permit approvals are vested for 12 months from the date the application was filed, and expires at 12 months unless work authorized by the permit is substantially commenced, or a development regulation provides for a longer permit expiration period, or the development regulation allows for time extension beyond the original 12 months, or provides a renewal process.\nTerminationThe vested right for a development permit shall expire for an uncompleted development project if development work is intentionally and voluntarily discontinued for a period of not less than 24 consecutive months.\nG. Common Law Vested RightA common law vested right establishes the right to undertake and complete the development and use of property where substantial expenditure of resources (which can include the expenditure of money, time, and/or labor) were made in good faith and the expenditures were made in reliance on a valid development permit or development approval. A person claiming a common law vested right shall submit information to substantiate that claim to the designated administrator that demonstrates that substantial expenditures were made relying in good faith on a valid development permit or development approval. The designated administrator shall make a determination as to the existence of the vested right, as provided in N.C.G.S. § 160D-108(h). Nothing in this section precludes judicial determination, based on common law principles or other statutory provisions, that a vested right exists in a particular case or that a compensable taking has occurred. Except as expressly provided in §160D-108, nothing in this section shall be construed to alter the existing common law.", "metadataJson": "{\"section_url\": \"/articles/article-37-amendments-development-approvals/#376-vested-rights\"}"}, {"title": "37.7 PERMIT CHOICE", "text": "A. If an applicant submits an application for any type of development, and a development regulation or ordinance is amended between the time the application was submitted and the development approval is made, the applicant may choose which adopted version of the development regulation(s) will apply to the building, structure, or land indicated on the application. If the applicant chooses the version applicable at the time of the application, the applicant shall not be required to await the outcome of the amendment to the regulation.\nFor the purposes of this section, the following definitions shall apply:\n\nDevelopmentAny of the following: 1) the construction, erection, alteration, enlargement, renovation, substantial repair, movement to another site, or demolition of any structure; 2) the excavation, grading, filling, clearing, or alteration of land; 3) the subdivision of land as defined in N.C.G.S. Chapter 160D-802; or 4) the initiation of substantial change in the use of land or in the intensity of use of land.\nDevelopment RegulationIncludes this Ordinance, zoning regulations, subdivision regulations, soil erosion and sedimentation control regulations, floodplain regulations, stormwater regulations, wireless telecommunication facility regulations, historic district regulations, or any local act or charter that regulates development. (N.C.G.S. Chapter 160D-102(14)).\nDevelopment ApprovalAn administrative or quasi-judicial approval that is written and required prior to commencing development or undertaking a specific activity, project, or development proposal. Development approvals include, but are not limited to, zoning permits, site plan approvals, variances, certificates of appropriateness, subdivision plat approvals, subdivision of land, driveway plan approval, erosion and sedimentation control permits, sign permits, and other permits issued.\n\n\nB. Where multiple development permits are required to complete a development project, the development permit applicant may choose the version of each of the local land development regulations applicable to the project upon submittal of the application for the initial development permit. This provision is applicable only for those subsequent development permit applications filed within 18 months of approval of the initial permit. For purposes of this section, an erosion and sedimentation control permit or sign permit is not an initial development permit.C. If a permit application is on hold for six consecutive months, then permit choice is waived. If an applicant resumes an application after six months of discontinuation, then the rules in effect at the time of resuming apply.", "metadataJson": "{\"section_url\": \"/articles/article-37-amendments-development-approvals/#377-permit-choice\"}"}, {"title": "37.8 VARIANCES AND APPEALS", "text": "A. Variances\nAuthorityThe UDO Board of Adjustment has authority to hear and decide variances from the requirements of the Ordinance regulations.\nUDO Board of Adjustment Variance LimitationsThe UDO Board of Adjustment has no jurisdiction with respect to the following variances:\n\nThe UDO Board of Adjustment has no jurisdiction with respect to a zoning variance which would allow the establishment of a use that is not otherwise permitted in the zoning district, would result in the extension or expansion of a nonconforming building, structure, or use, or would change the zoning district boundary or zoning district designation of the subject property.\nThe UDO Board of Adjustment has no jurisdiction for conditional zoning districts and exception (EX) districts except if the request pertains to a variance from specified minimum requirements of the zoning regulations that are not associated with specifically approved conditions of the plan.\nThe UDO Board of Adjustment has no jurisdiction regarding the bonus provisions of Section 16.3.\nThe UDO Board of Adjustment has no jurisdiction to address or rule upon constitutional and federal and state statutory issues or any other legal issues beyond its statutory authority.\n\n\nInitiation\n\nOnly the owner of the affected property, an agent authorized in writing to act on the owner’s behalf, or a person having a written contractual interest in the affected property can apply for a variance.\nA variance request filed with the UDO Board of Adjustment stays all proceedings and enforcement actions including fines until the UDO Board of Adjustment renders its decision.\n\n\nApplication SubmittalAll applications for a variance shall be in a form prescribed by the UDO Board of Adjustment and accompanied by the fee established by City Council and submitted to the clerk to the UDO Board of Adjustment.\nApplication DeadlineComplete applications shall be submitted in accordance with the City’s filing deadline calendar, if applicable.\nApplication Documents\n\nApplication documents required under this Ordinance shall be submitted as required by the UDO Board of Adjustment.\nFor minor and major watershed variances, the applicant shall provide a list of those local governments having jurisdiction in the watershed where the subject property is located and entities utilizing the receiving waters of the watershed as a water supply, as required by the North Carolina Environmental Management Commission per the North Carolina Administrative Code, Rules 15A NCAC 02B.0623, (5) and 15A NCAC 02B.0624.\nFor floodplain variances, the applicant shall provide a written report addressing each of the items listed in Section 37.8.A.13.b.\nFor zoning variances, the applicant shall provide a scaled survey or site plan for variance requests from quantitative standards and dimensional standards of this Ordinance.\n\n\nDetermination of CompletenessVariance applications will not be considered properly filed until deemed complete and accurate by the designated administrator.\nStaff Review and RecommendationThe clerk to the UDO Board of Adjustment shall transmit copies of the variance application to the designated administrator(s) and staff for review and preparation of a staff report.\nScheduling of Hearing and Notice\n\nThe UDO Board of Adjustment staff shall schedule an evidentiary hearing for the variance application when all requirements have been met and there is adequate time for staff to review and prepare a staff report on the variance request.\nA notice of the hearing shall be prepared by the UDO Board of Adjustment staff.\n\nThe notice of the evidentiary hearing, including the location of the property and a description of the variance being requested, shall be mailed to the applicant, to the property owner if different from the applicant, and to property owners of all parcels adjacent the parcel of land that is the subject of the hearing, and to any other persons entitled to mailed notice. In the absence of evidence to the contrary, the City may rely on the Mecklenburg County tax abstract to determine owners of property entitled to mailed notice. The notice shall be deposited in the mail at least ten days, but not more than 25 days, prior to the date of the hearing.\nNotice of the hearing shall be prominently posted on the site or on an adjacent street or highway right-of-way.\nNotice of a hearing for a major watershed variance shall be mailed to the list provided by the petitioner of local governments having jurisdiction in the watershed where the subject property is located and/or entities utilizing the receiving waters of the watershed as a water supply at least ten working days prior to the hearing.\n\n\nFor a minor or major watershed variance, in addition to the notification requirements in item b above, the UDO Board of Adjustment staff shall mail a written notice to each local government having jurisdiction in the watershed where the subject property is located and/or any entity utilizing the receiving waters of the watershed as a water supply at least ten working days prior to the public hearing.\n\nThe notice shall include a description of the variance being requested.\nRecipients of the notice of the variance request may submit comments at least three working days prior to the scheduled hearing date by the UDO Board of Adjustment. Such comments, properly filed, shall become part of the record of proceedings.\n\n\n\n\nTransmittal of Administrative Materials\n\nThe UDO Board of Adjustment staff shall transmit all materials prepared for the quasi-judicial meeting including applications, reports, written materials, and any comments received relevant to the matter being considered to the UDO Board of Adjustment members, the applicant, and the property owner if not the applicant, at the same time. The administrative materials may be provided in written or electronic form.\nComments on the variance for a minor or major watershed variance received at least three working days prior to the scheduled hearing shall also be transmitted to the UDO Board of Adjustment members, the applicant, and to the property owner if not the applicant, at the same time.\n\n\nEvidentiary Hearing\n\nThe evidentiary hearing shall be conducted in accordance with N.C.G.S. Chapter 160D-406 and the rules and procedures adopted by UDO Board of Adjustment.\nThe applicant and any representatives, City and County staff, and all persons with standing shall have the right to participate fully at the evidentiary hearing.\nOaths shall be administered to witnesses by the presiding officer.\nCounsel for the UDO Board of Adjustment may advise the Board as to applicable law and the findings of fact that shall be made for variances.\n\n\nQuasi-Judicial Decision\n\nThe UDO Board of Adjustment shall determine the contested facts and make a quasi-judicial decision based on competent, material, and substantial evidence in the record.\nA variance requires a majority vote of the members to make a decision on a variance request. Vacant positions on the UDO Board of Adjustment and members disqualified from voting shall not be considered members of the Board for calculation of the requisite majority if there are no qualified alternatives available to assume the place of such members.\nThe UDO Board of Adjustment shall follow quasi-judicial procedures in reviewing and deciding variances, and in reviewing and recommending a major watershed variance to the North Carolina Environmental Management Commission (EMC) for their review of a major watershed variance.\nExcept for a major watershed variance, the UDO Board of Adjustment may grant or deny a variance application, and may impose reasonable and appropriate conditions and safeguards on variances that the Board judges to be reasonably related to the variance.\nFor major watershed variances, the UDO Board of Adjustment has the following authority:\n\nThe UDO Board of Adjustment only has authority to deny a major watershed variance from the state required watershed regulations or recommend approval to the North Carolina Environmental Management Commission (EMC) as per Rule 15A NCAC 02B .0623 (5).\nIf the UDO Board of Adjustment recommends that the major watershed variance be granted, the City shall, within 30 working days, forward a preliminary record of the Board’s hearing to the North Carolina Environmental Management Commission (EMC) for final decision in accordance with the state’s rules and regulations. The preliminary record of the hearing shall include:\n\n*(A)*The variance application.\n*(B)*The hearing notices.\n*(C)*The evidence presented.\n*(D)*Motions, offers of proof, objections to evidence, and rulings on them.\n*(E)*Proposed findings and exceptions.\n*(F)*The proposed decision, including all conditions proposed to be added to the permit.\n\n\nWhen the EMC approves or denies the major variance, the EMC will prepare an EMC decision and send it to the UDO Board of Adjustment. The UDO Board of Adjustment shall then prepare a final decision granting or denying the proposed variance. If the EMC approves the variance with conditions and stipulations, the UDO Board of Adjustment shall prepare a final decision, including such conditions and stipulations, granting the proposed variance. The EMC decision shall constitute the final decision on the major variance request and the applicant shall be notified of the decision by the UDO Board of Adjustment.\nAny appeal of the EMC decision of a major watershed variance shall be made on judicial review to Superior Court.\nIf the UDO Board of Adjustment makes a decision to deny the major watershed variance, then the record of the Board’s hearing, findings, and conclusions shall not be forwarded to the EMC. Any appeal of the Board’s denial of a major watershed variance shall be pursuant to this section and N.C.G.S. § 160D-406(k).\nThe clerk of the UDO Board of Adjustment shall keep a record, including a description of each project receiving a watershed variance and any reasons stated for granting the variance, of all approved major and minor watershed variances. The City shall submit a record of the variances granted during the previous calendar year to the North Carolina Division of Environmental Management on or before January 1 of the following year. This record shall provide a description of each project receiving a variance and the reasons for granting the variance.\n\n\nVariances may be issued for the repair or rehabilitation of historic structures upon the determination that the proposed repair or rehabilitation shall not preclude the structure’s continued designation as a historic structure and the variance is the minimum necessary to preserve the historic character and design of the structure.\nThe fact that the property could be utilized more profitably or conveniently with the variance than without the variance shall not be considered as grounds for granting the variance.\nAny person or entity who wishes to receive a copy of the written decision of the UDO Board of Adjustment, shall file a written request for a copy of the UDO Board of Adjustment decision with the clerk to the UDO Board of Adjustment prior to the date the decision becomes effective.\n\n\nStandards for Granting a Variance\n\nStandards Applicable to VariancesWhen unnecessary hardships would result from carrying out the strict letter of zoning and development regulations, the UDO Board of Adjustment shall vary any of the provisions upon a showing of all of the following:\n\nUnnecessary hardship would result from the strict application of the regulation. It shall not be necessary to demonstrate that, in the absence of the variance, no reasonable use can be made of the property.\nThe hardship results from conditions that are peculiar to the property, such as location, size, or topography.  Hardships resulting from personal circumstances, as well as hardships resulting from conditions that are common to the neighborhood or the general public, may not be the basis for granting a variance. A variance may be granted when necessary and appropriate to make a reasonable accommodation under the Federal Fair Housing Act for a person with a disability.\nThe hardship did not result from actions taken by the applicant or the property owner. The act of purchasing property with knowledge that circumstances exist that may justify the granting of a variance shall not be regarded as a self-created hardship.\nThe requested variance is consistent with the spirit, purpose, and intent of the regulation, such that public safety is secured, and substantial justice is achieved.Additional factors for consideration in granting Floodplain Variances are provided in Section 37.8.A.13.b. Additional factors for consideration in granting Water Supply Watershed Protection Variances are provided in Section 37.8.A.13.c.\n\n\nFloodplain Variance -Factors for Consideration\n\nFloodplain variances shall only be issued prior to approval of a floodplain development permit. In acting upon variances, in addition to the standards for granting a variance in this section, the UDO Board of Adjustment shall consider all technical evaluations, all standards of Article 27, and the following in making their decision:\n\n*(A)*Danger that materials allowed to be placed in the floodway as a result of the variance may be swept onto other lands to the injury of others during a community base flood.\n*(B)*Danger to life and property due to flooding or erosion damage from a community base flood.\n*(C)*Susceptibility of the proposed facility and its contents to flood damage and the effect of such damage during the community base flood.\n*(D)*mportance of the services provided by the proposed facility to the community.\n*(E)*Necessity to the facility of a waterfront location, where applicable.\n*(F)*Availability of alternative locations, not subject to flooding or erosion damage during a community base flood, for the proposed use.\n*(G)*Compatibility of the proposed use with existing and anticipated development.\n*(H)*Relationship of the proposed use to the Floodplain Regulations Technical Guidance Document, Mecklenburg County Hazard Mitigation Plans, the Mecklenburg County Greenway Plan, and any other adopted land use plans for that area.\n*(I)*Safety of access to the property in times of a community base flood for ordinary and emergency vehicles.\n*(J)*Expected heights, velocity, duration, rate of rise and sediment transport of the floodwaters during a community base flood expected at the site.\n*(K)*Costs of providing governmental services during and after flood events, including maintenance and repair of public utilities and facilities, such as sewer, gas, electrical, and water systems and streets and bridges.\n\n\nIn addition to the other factors for consideration in this section, the following shall apply to floodplain variances:\n\n*(A)*Floodplain variances shall not be issued when the variance will make the structure in violation of other federal, state, or local laws, regulations, or ordinances.\n*(B)*Floodplain variances shall not be issued within any designated floodway if the variance would result in any increase in flood heights during the community and/or FEMA base flood discharge unless the requirements of Section 27.4.E are met.\n*(C)*Floodplain variances shall not be issued that would result in additional threats to public safety, or extraordinary public expense, create nuisance, cause fraud on or victimization of the public, or conflict with other existing local laws or ordinances.\n*(D)*Floodplain variances shall be considered if the variance request is the minimum necessary, considering the flood hazard, to afford relief.\n*(E)*Variances may be issued for functionally dependent facilities, if determined to meet the definition of Article 27, provided the provisions of Sections 27.3 and 27.4 have been satisfied, and such facilities are protected by methods that minimize flood damages during the base flood and create no additional threats to public safety.\n*(F)*A floodplain variance to the requirement for dryland access may be granted by the UDO Board of Adjustment if dryland access cannot be obtained, upon consideration of the following conditions:\n\n*(1)* A determination that all possible alternatives have been investigated in an attempt to provide the safest access from a proposed habitable building to a dry public street.\n*(2)* The existence of a site plan prepared by a North Carolina Professional Land Surveyor or North Carolina Professional Engineer indicating that the proposed access to habitable buildings on the property poses the least risk from flooding.\n\n\n*(G)*A floodplain variance may be issued by the UDO Board of Adjustment for solid waste disposal facilities, hazardous waste management facilities, salvage yards, and chemical storage facilities that are located in special flood hazard areas provided that all of the following criteria are met:\n\n*(1)*The use serves a critical need in the community.\n*(2)*No feasible location exists for the use outside the special flood hazard areas.\n*(3)*The lowest floor of any structure is elevated above the FPE or is designed and sealed by a North Carolina Professional Engineer or a North Carolina Licensed Architect to be watertight with walls substantially impermeable to the passage of water and with structural components capable of resisting hydrostatic and hydrodynamic loads and the effects of buoyancy.\n*(4)*There shall be no storage of materials or tanks which could flood within the special flood hazard area unless they are contained in a structure as defined in item (3) above.\n*(5)*The use complies with all other applicable laws and regulations.\n*(6)*The City has notified the Secretary of the State Department of Crime Control and Public Safety of its intention to grant a variance at least 30 calendar days prior to granting the variance.\n\n\n\n\n\n\nWater Supply Watershed Protection Variances (Article 23)\n\nA watershed variance that would not result in a relaxation of the state watershed standards shall comply with the procedures and standards of Section 37.8.A.\nA major watershed variance is a variance that would result in the relaxation of a state watershed standard and any one or more of the following and shall comply with the procedures and standards of 37.8.A.13.c for major watershed variances:\n\n*(A)*The relaxation, by a factor greater than 10%, of any management requirement under the Low-Density Option.\n*(B)*The relaxation, by a factor greater than 5% of any water quality buffer, density, or built-upon area requirement under the High-Density Option.\n*(C)*Any variation in the design, maintenance, or operation requirements of a wet detention pond or other approved storm water management system.\n\n\nA minor watershed variance is a variance that would result in the relaxation of a state watershed standard and any one or more of the following and shall comply with the procedures and standards of 37.8.A.13.c for minor watershed variances:\n\n*(A)*The relaxation, by a factor less than 10%, of any management requirement under the Low-Density Option.\n*(B)*The relaxation, by a factor less than 5% of any water quality buffer, density, or built-upon area requirement under the High-Density Option.\n\n\nThe UDO Board of Adjustment and the North Carolina Environmental Management Commission (EMC), in granting a minor or major watershed variance, shall ensure that the project will provide equal or better protection of North Carolina waters than the requirements of Rules 15A NCAC 02B .0621­.0624 of the North Carolina Administrative Code and that the stormwater controls will function in perpetuity.\n\n\n\n\nWritten Decisions and Delivery\n\nEach quasi-judicial decision shall be reduced to writing, reflect the UDO Board of Adjustment’s determination of contested facts and their application to the applicable standards, and be approved by the UDO Board of Adjustment and signed by the Chairperson, or other duly authorized member.\nThe written decision shall be issued in print or electronic form. Any decision issued exclusively in electronic form shall be protected from editing, once issued. The written decision shall be delivered by personal delivery, email, or by first-class mail to the applicant, property owner, and to any person who has submitted a written request for a copy prior to the date the decision becomes effective.\nThe UDO Board of Adjustment staff member required to deliver the decision notice shall certify to the City that proper notice has been made, and the certificate shall be deemed conclusive in the absence of fraud.\nIf a variance from the FEMA base flood elevation is granted, the following apply:\n\nAny applicant to whom a variance from the FEMA base flood elevation is granted shall be given a written notice from the Floodplain Administrator specifying the difference between the FEMA base flood elevation and the elevation to which the structure is to be built and a written statement that the cost of flood insurance shall be commensurate with the increased risk resulting from the reduced lowest floor elevation. Such notification shall be maintained with a record of all variance actions by the UDO Board of Adjustment.\nThe Floodplain Administrator shall report any variances regarding NFIP minimum standards to FEMA and the state upon request.\n\n\n\n\nEffective Date of DecisionA quasi-judicial decision is effective upon filing the written decision with the clerk of UDO Board of Adjustment. Quasi-judicial decisions of the NCEMC shall become effective when received by the clerk of the UDO Board of Adjustment.\nEffect of Granting a Variance\n\nAfter the approval of a variance, the applicant will be required to follow the procedures to develop the subject property. All decisions made by administrative officers under those procedures will comply with the variation in these regulations granted to the applicant.\nVariances attach to and run with the land.\n\n\nJudicial Review\n\nIf a petition for review pursuant to N.C.G.S. §160D-406(k) is filed, then the petitioner must order from the court recorder and pay for the original transcript of the hearing for delivery to the clerk of the UDO Board of Adjustment for the preparation of the filing of the record in superior court. If a court ultimately renders a decision in favor of the petitioner, then the City shall reimburse the petitioner for the cost of the transcript. In the event that the petitioner does not order the transcript and does not prevail on appeal, then the City shall request the Court to make the costs of the original transcript part of the costs of the action or recover the costs in the nature of debt owed.\nEvery quasi-judicial decision shall be subject to review by the Mecklenburg County Superior Court, in the nature of certiorari. Appeals shall be filed by the later of 30 days after the decision is effective or after a written copy of the decision is provided by personal delivery, email, or by first-class mail to the applicant, property owner and to any person who has submitted a written request for a copy prior to the date the decision becomes effective. When first-class mail is used to deliver the decision, mail shall be deemed delivered on the third business day following deposit of the notice for mailing with the United States Postal Service.\n\n\nB. Appeals\nAppeals of Administrative and Quasi-Judicial Actions\n\nAppeals to the UDO Board of Adjustment can be initiated for administrative decisions by staff, administrators, directors, and designees. Administrative decisions include, but are not limited to:\n\nOrders, decisions, determinations, and interpretations of Ordinance regulations\nSubdivision preliminary plan\nSubdivision final plat\nNotices of violation (NOV)\nAssessment of penalties and remedies\nCompliance orders\nCease and desist order\nStop work order\nDisapproval or modification of a proposed erosion and sedimentation control plan\nCorrective Action\n\n\n\n\nTime to Appeal\n\nThe owner or other party has 30 days from receipt of the written notice of the determination within which to file an appeal. Any other person with standing to appeal has 30 days from receipt from any source of actual or constructive notice of the determination within which to file an appeal, except for the following:\n\nPost Construction Stormwater Control AppealThe UDO Board of Adjustment may waive or extend the 30 day deadline only upon determining that the person filing the notice of appeal received no actual or constructive form of notice of the order, decision, determination, or interpretation being appealed.\n\n\nIn the absence of evidence to the contrary, notice given pursuant to N.C.G.S. Chapter 160D-403(b) by first-class mail is deemed received on the third business day following deposit of the notice for mailing with the United States Postal Service.\n\n\nInitiation\n\nPersons possessing any of the following criteria have standing to appeal:\n\nA person having an ownership interest in the property that is the subject of the decision being appealed; a leasehold interest in the property that is the subject of the decision being appealed; or an interest created by easement, restriction, or covenant in the property.\nA person with an option or contract to purchase the property that is the subject of the appeal.\nAn applicant whose decision is being appealed.\nAny other person who will suffer special damages as the result of the decision being appealed.\nAn incorporated or unincorporated association to which owners or lessees of the property in a designated area belong by virtue of their owning or leasing property in that area, or an association otherwise organized to protect and foster the interest of a particular neighborhood or local area, so long as at least one of the members of the association would have standing as an individual to challenge the decision being appealed, and the association was not created in response to the particular development or issue that is the subject of the appeal.\n\n\n\n\nFiling a Notice of AppealAppeals of an administrative decision (see Section 37.8.B.1) by a designated administrator, director of a department or agency, or their designees shall be filed with the clerk to the UDO Board of Adjustment, along with a filing fee set by the Planning Department.\nDetermination of CompletenessAn appeal will not be placed on the UDO Board of Adjustment agenda until the application is deemed complete, and accurate by the designated administrator.\nSupplementary RegulationsSpecific articles of this Ordinance have supplementary regulations related to appeals. These articles are arranged in alphabetical order below.\n\nPost Construction Stormwater Control Appeals (Article 25)If an appeal is made regarding the amount of the civil penalties assessed, the UDO Board of Adjustment shall find that the violation has occurred, but that in setting the amount of a penalty the Stormwater Administrator has not considered or given appropriate weight to either mitigating or aggravating factors. In making their decision, the UDO Board of Adjustment shall either decrease or increase the per day civil penalty within the range allowed in Section 39.2.D.6. Any decision of the UDO Board of Adjustment which modifies the amount of the civil penalty shall include, as part of the findings of fact and conclusions of law, findings as to which mitigating or aggravating factors exist and the appropriate weight that should have been given to such factors by the Stormwater Administrator in setting the amount of the civil penalty levied against the petitioner.\nSoil Erosion and Sedimentation Control Plan Appeals (Article 28)\n\nDisapproval or Modification of Proposed PlanProcedures for an appeal of the disapproval or modification of the proposed plan are as follows:\n\n*(A)*The disapproval or modification of any proposed plan by the Stormwater Administrator shall entitle the person submitting the plan (petitioner) to file a written request for an appeal with the clerk of the UDO Board of Adjustment within 30 days after receipt of the notice of disapproval or modification. Notice of the disapproval or modification sent by first-class mail is deemed received on the third business day following deposit of the notice for mailing with the United States Postal Service. The request for a hearing filed with the clerk shall be accompanied by a filing fee as established by the UDO Board of Adjustment. Failure to timely file such demand and fee shall constitute a waiver of any rights to appeal under Article 28 and this article, and the UDO Board of Adjustment shall have no jurisdiction to hear the appeal.\n*(B)*Within five days of receiving the request for an appeal, the clerk of the UDO Board of Adjustment shall notify the Stormwater Administrator. As soon as possible after the receipt of the notice, the clerk of the UDO Board of Adjustment shall set a time and place for the hearing and notify the petitioner by mail of the date, time, and place of the hearing. As per N.C.G.S. § 160D­406, notices of hearings shall be mailed to: 1) the person or entity whose appeal, is the subject of the hearing; 2) to the owner of the property that is the subject of the hearing, if the owner did not initiate the hearing; and 3) to the owners of all parcels of land adjacent to the parcel of land that is the subject of the hearing. The time specified for the hearing shall be either at the next regularly scheduled meeting of the UDO Board of Adjustment or as soon thereafter as practical, or at a special meeting. The hearing shall be conducted by the UDO Board of Adjustment in accordance with Sections 37.8.B.9 through 37.8.B.14.\n*(C)*If the UDO Board of Adjustment upholds the disapproval or modification of a proposed plan following the public hearing, the petitioner shall have 30 days from the receipt of the decision to appeal the decision to the North Carolina State Sedimentation Control Commission pursuant to Title 15, Article 4B, Section .0018(b) of the North Carolina Administrative Code and N.C.G.S. § 113A-61(c). Notice given by first-class mail is deemed received on the third business day following deposit of the notice for mailing with the United States Postal Service.\n\n\nNotice of Violation with Penalty AppealProcedures for an appeal of the issuance of a Notice of Violation with an assessment of a civil penalty are as follows:\n\n*(A)*If the UDO Board of Adjustment finds that the violation has occurred, but that in setting the amount of the penalty, the Stormwater Administrator has not considered or given appropriate weight to either mitigating or aggravating factors, the UDO Board of Adjustment shall either decrease or increase the per day civil penalty within the range allowed by Section 39.2.F.2.d. Any decision of the UDO Board of Adjustment which modifies the amount of the civil penalty shall include, as part of the findings of fact and conclusions of law, findings as to which mitigating or aggravating factors exist and the appropriate weight that should have been given to such factors by the Stormwater Administrator in setting the amount of the civil penalty levied against the petitioner.\n*(B)*Any person issued a notice of violation with penalty may file a request with the Sedimentation Control Commission for remission of the assessment within 30 days of receipt of the notice. A remission request shall be accompanied by a waiver of the right to a contested case hearing pursuant to N.C.G.S. § 150B-22 of the North Carolina General Statutes and stipulation of the facts on which the assessment was based.\n\n\n\n\nDrainage Appeals (Article 24)\n\nIf an appeal is made regarding the amount of the civil penalties assessed, the UDO Board of Adjustment shall find that the violation has occurred, but that in setting the amount of a penalty the Stormwater Administrator has not considered or given appropriate weight to either mitigating or aggravating factors. In making their decision, the UDO Board of Adjustment shall either decrease or increase the per day civil penalty within the range allowed in Section 39.2.G.5. Any decision of the UDO Board of Adjustment which modifies the amount of the civil penalty shall include, as part of the findings of fact and conclusions of law, findings as to which mitigating or aggravating factors exist and the appropriate weight that should have been given to such factors by the Stormwater Administrator in setting the amount of the civil penalty levied against the petitioner.\n\n\n\n\nStay of Enforcement and Penalties\n\nAn appeal of a notice of violation or other enforcement order stays enforcement of the action appealed from and accrual of any penalties/fines assessed while:\n\nThe appeal is pending to the UDO Board of Adjustment.\nAny subsequent appeal is pending to Mecklenburg County Superior Court.\nThe appeal is pending from a civil proceeding.\nAny subsequent appeal that is authorized by law.\n\n\nHowever, if the designated administrator who made the decision certifies to the board after the notice of appeal has been filed that, because of the facts stated in an affidavit, a stay would cause imminent peril to life or property, or because the violation is transitory in nature, a stay would seriously interfere with enforcement of the development regulation, then enforcement proceedings are not stayed except by a restraining order, which may be granted by a court. If enforcement proceedings are not stayed, the appellant may file with the designated administrator a request for an expedited hearing of the appeal, and the UDO Board of Adjustment shall meet to hear the appeal within 15 days after the request is filed.\nThe following stay of proceedings provisions apply to specific sections of this Ordinance. In the case of any conflicts, the standards below shall control:\n\nPost Construction Stormwater Control (Article 25)The filing of a notice to appeal shall stay any proceedings in furtherance of the contested action, except the Stormwater Administrator may certify in writing to the UDO Board of Adjustment that because of facts stated in the certificate, a stay imposes an imminent peril to life or property or would seriously interfere with the enforcement of this article. The UDO Board of Adjustment shall then review such certificate and may override the stay of further proceedings.\nDrainage (Article 24)The filing of a notice to appeal shall stay any proceedings in furtherance of the contested action, except the Stormwater Administrator may certify in writing to the UDO Board of Adjustment that because of facts stated in the certificate, a stay imposes an imminent peril to life or property or would seriously interfere with the enforcement of this article. The UDO Board of Adjustment shall then review such certificate and may override the stay of further proceedings.\nTree Appeals (Article 20, Sections 20.12 through 20.18)The filing of a notice to appeal shall stay any proceedings and accrual of any fines during the pendency of the appeal to the UDO Board of Adjustment, unless the Chief Urban Forester who made the decision certifies to the UDO Board of Adjustment that because of the facts stated in the certificate, a stay would cause imminent peril to life or property or that because the violation charged is transitory in nature, a stay would seriously interfere with the enforcement of Article 20, Sections 20.12 through 20.18and this Ordinance. In that case, enforcement shall not be stayed except by a restraining order, which may be granted by a court.\n\n\n\n\nStaff Review and RecommendationThe clerk to the UDO Board of Adjustment shall transmit the appeal to the designated administrator and staff for review and schedule an evidentiary public hearing before the UDO Board of Adjustment.\nScheduling of Hearing and Notice\n\nThe clerk to the UDO Board of Adjustment shall schedule an evidentiary hearing for the appeal when the designated administrator confirms all requirements have been met and there is adequate time for staff to review the appeal.\nA notice of the hearing shall be prepared by the UDO Board of Adjustment staff.\n\nThe notice of the evidentiary hearing, including the information on the appeal being requested, shall be mailed to the person or entity whose appeal is the subject of the hearing, to the property owner of the property that is the subject of the hearing if the owner did not file the appeal, and to any other persons entitled to receive notice. In the absence of evidence to the contrary, the City may rely on the Mecklenburg County tax abstract to determine owners of property entitled to mailed notice. The notice shall be deposited in the mail at least ten days, but not more than 25 days, prior to the date of the hearing.\nNotice of the hearing shall be prominently posted on the site or on an adjacent street or highway right-of-way, within at least ten days, but not more than 25 days, prior to the date of the hearing.\n\n\n\n\nTransmittal of Administrative MaterialsThe UDO Board of Adjustment staff shall transmit all materials prepared for the quasi-judicial hearing, including applications, reports, written materials, and any comments received relevant to the matter being considered to the UDO Board of Adjustment members, the applicant, and to the property owner if not the applicant, at the same time. The administrative materials may be provided in written or electronic form.\nEvidentiary Hearing\n\nThe evidentiary hearing shall be conducted in accordance with the rules and procedures adopted by UDO Board of Adjustment and N.C.G.S. §160D-406.\nThe designated administrator, director of the department or agency, or their designee, who made the decision being appealed, or the person currently occupying that position, if the decision maker is no longer employed, shall be present at the evidentiary hearing as a witness.\nThe applicant and any representatives, City and County staff, and all persons with standing shall have the right to fully participate at the evidentiary hearing.\nOaths shall be administered to witnesses by the presiding officer.\nCounsel for the UDO Board of Adjustment may advise the Board as to applicable law and the findings of fact that shall be made for appeals.\nOther witnesses may present competent, material, and substantial evidence that is not repetitive, as allowed by the UDO Board of Adjustment.\n\n\nQuasi-Judicial Decision\n\nThe UDO Board of Adjustment shall follow quasi-judicial procedures in reviewing the appeal, determining the contested facts, and making a quasi-judicial decision, based on competent, material, and substantial evidence in the record.\nThe UDO Board of Adjustment may reverse or affirm, wholly or partly, or may modify the administrative or quasi-judicial decision appealed from and shall make any order, requirement, decision, determination, or interpretation that ought to be made only upon finding an error in the application of these regulations on the part of the officer rendering the order, requirement, decision, or determination. The Board shall have all the powers of the designated administrator or director or their designee who made the decision.\nThe UDO Board of Adjustment requires a majority vote of members to reverse any order, requirement, decision, determination, or interpretation of any administrative official under an appeal, per the City Charter. Vacant positions on the Board and members who are disqualified from voting on an appeal shall not be considered members of the Board for calculation of the requisite majority if there are no qualified alternates available to take the place of such members.\nIf a petition for review pursuant to N.C.G.S. §160D-406(k) is filed, then the petitioner must order from the court reporter and pay for the original transcript of the hearing for delivery to the clerk of the UDO Board of Adjustment for the preparation of the filing of the record in superior court. If a court ultimately renders a decision in favor of the petitioner, then the City shall reimburse the petitioner for the cost of the transcript. In the event that the petitioner does not order the transcript and does not prevail on appeal, then the City shall request the Court to make the costs of the original transcript part of the costs of the action or recover the costs in the nature of a debt owed.\n\n\nWritten Decisions and Delivery\n\nEach quasi-judicial decision shall be reduced to writing, reflect the UDO Board of Adjustment’s determination of contested facts and their application to the applicable standards, and be approved by the UDO Board of Adjustment and signed by the Chairperson, or other duly authorized member.\nThe written decision may be issued in print or electronic form. Any decision issued exclusively in electronic form shall be protected from editing, once issued. The written decision shall be delivered by personal delivery, electronic mail, or by first-class mail to the applicant, property owner, if not the applicant, and to any person who has submitted a written request for a copy prior to the date the decision becomes effective. If the notice is sent by first-class mail, the notice shall be sent to the last address listed for the property owner or the affected property on the Mecklenburg County tax abstract, and to the address provided in the application if the owner is not the applicant.\nAny party or entity who wishes to receive a copy of the written decision of the UDO Board of Adjustment, shall file a written request for a copy of the UDO Board of Adjustment decision with the clerk to the UDO Board of Adjustment prior to the date the decision becomes effective.\nThe UDO Board of Adjustment staff member required to deliver the decision notice shall certify to the City that proper notice has been made, and the certificate shall be deemed conclusive in the absence of fraud.\nThe UDO Administrator shall maintain the records of all appeal actions.\n\n\nEffective Date of DecisionA quasi-judicial decision is effective upon filing the written decision with the clerk of UDO Board of Adjustment.\nJudicial Review\n\nAppeals of a quasi-judicial decision by the UDO Board of Adjustment, in the nature of certiorari, shall be made to the clerk of the Mecklenburg County Superior Court. Appeals shall be filed by the later of 30 days after the decision is effective or after a written copy of the decision is provided by personal delivery, email, or by first-class mail to the applicant, property owner and to any person who has submitted a written request for a copy prior to the date the decision becomes effective. When first-class mail is used to deliver the decision, mail shall be deemed delivered on the third business day following deposit of the notice for mailing with the United States Postal Service.\nIf a petition for review pursuant to N.C.G.S. § 160D-406(k) is filed, then the petitioner must order from the court reporter and pay for the original transcript of the hearing for delivery to the clerk of the UDO Board of Adjustment for the preparation of the filing of the record in superior court. If a court ultimately renders a decision in favor of the petitioner, then the City shall reimburse the petitioner for the cost of the transcript. In the event that the petitioner does not order the transcript and does not prevail on appeal, then the City shall request the Court to make the costs of the original transcript part of the costs of the action or recover the costs in the nature of debt owned.\n\n\n", "metadataJson": "{\"section_url\": \"/articles/article-37-amendments-development-approvals/#378-variances-and-appeals\"}"}, {"title": "37.9 DEVELOPMENT REVIEW AND APPROVAL PROCESSES", "text": "Development review and approval is intended to ensure that the development meets the requirements of this Ordinance. Development review and approval shall follow procedures and practices established by the City, this Ordinance, and other ordinances as applicable.", "metadataJson": "{\"section_url\": \"/articles/article-37-amendments-development-approvals/#379-development-review-and-approval-processes\"}"}]}